--------------------------------------------------------------------------------------------------------------------------------------------
       log:  E:\PCE\logfile\pce07.log
  log type:  text
 opened on:  25 Aug 2009, 11:55:15

. global dir0 "E:\PCE\temp\";

. global dir01 "E:\PCE\logfile\";

. global dir09 "E:\PCE\data\";

. global dir1 "E:\ifls1\hh\";

. global dir2 "E:\ifls2\hh\";

. global dir2p "E:\ifls2+\hh\";

. global dir3 "E:\ifls3\hh\public\";

. global dir7 "E:\ifls4\hh\public\";

. **************************************************************************** ;
. *pce07.do  ;
. *Files used: ;
.  * Original files: bk_sc.dta, bk_ar1.dta, b1_ks0.dta, b1_ks1.dta, b1_ks2.dta, b2_kr.dta  ;
. *Files created:  ;
. *attrit_pce07.dta  ;
. ****************************************************************************  ;
. set more off  ;

. set trace off  ;

. set mem 32m  ;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           32M    max. data space                 32.000M
    set matsize         300     max. RHS vars in models          0.712M
                                                            -----------
                                                                34.621M

. set matsize 300  ;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           32M    max. data space                 32.000M
    set matsize         300     max. RHS vars in models          0.712M
                                                            -----------
                                                                34.621M

. ****************************************************************************  ;
. * I. Create a file with kecamatan ID, kabupaten ID, etc  ;
. ****************************************************************************  ;
. use hhid07 commid07 result07 if hhid07~="" using $dir7\htrack, clear ;

.   gen com34=real(substr(commid07,3,2)) ;
(5321 missing values generated)

.   gen origea07=(com34~=.) ;

.   lab var origea "In IFLS EA 07" ;

.   drop com34  ;

.   sort hhid07 ;

. save $dir0\commid07, replace ;
file E:\PCE\temp\\commid07.dta saved

. use hhid07 x sc01* sc02* sc03* sc05*  using $dir7\bk_sc, clear ;

. * note the July 2 2009 version of bk_sc still has the wrong hhid07 ;
. * hhid07 is still the 9 digit version of the hhid ;
. * variable "x" is the hhid07 ;
.  rename hhid07 hhid07_9 ;

.  rename x hhid07 ;

.   bys hhid07: keep if _n==_N ;
(0 observations deleted)

.  gen provid07=sc010707 ;

.  gen double kabid07=sc010707*100+sc020707 ;

.  gen double kecid07=(kabid07*1000)+sc030707 ;

.  sort hhid07 ;

.  sort hhid07 ;

.  merge hhid07 using $dir0\commid07 ;

.  keep if _merge==3 ;
(282 observations deleted)

.  drop _merge ;

.  gen rural=(sc05~=1) ;

.  sort hhid07 ;

. save $dir0\sc07, replace  ;
file E:\PCE\temp\\sc07.dta saved

. **************************************************************************** ;
. * II. Housing Expenditures, Book KR (B2_KR.DTA)  ;
. ****************************************************************************
> * II.1 Identify outliers 
> ****************************************************************************  ;
. use hhid07 kr03 kr04* kr05* using  $dir7\b2_kr, clear  ;

. bys hhid07: keep if _n==_N ;
(0 observations deleted)

. format kr04a kr05a %12.0f  ;

. tab1 kr04a kr05a  ;

-> tabulation of kr04a  

    monthly |
       rent |      Freq.     Percent        Cum.
------------+-----------------------------------
        999 |          1        0.07        0.07
       2500 |          1        0.07        0.14
       3000 |          1        0.07        0.21
       5000 |          1        0.07        0.28
      10000 |          4        0.28        0.55
      12000 |          1        0.07        0.62
      15000 |          2        0.14        0.76
      18000 |          1        0.07        0.83
      20000 |          8        0.55        1.38
      22000 |          1        0.07        1.45
      25000 |          7        0.48        1.93
      30000 |          7        0.48        2.41
      35000 |          3        0.21        2.62
      40000 |         12        0.83        3.45
      45000 |          1        0.07        3.51
      50000 |         32        2.21        5.72
      60000 |         12        0.83        6.55
      65000 |          2        0.14        6.69
      70000 |          9        0.62        7.31
      75000 |         19        1.31        8.61
      76000 |          1        0.07        8.68
      80000 |         12        0.83        9.51
      85000 |          1        0.07        9.58
      90000 |          8        0.55       10.13
      91500 |          1        0.07       10.20
      93000 |          1        0.07       10.27
      95000 |          2        0.14       10.41
     100000 |         71        4.89       15.30
     110000 |          4        0.28       15.58
     115000 |          5        0.34       15.92
     117000 |          1        0.07       15.99
     120000 |         10        0.69       16.68
     125000 |         27        1.86       18.54
     130000 |          5        0.34       18.88
     135000 |          3        0.21       19.09
     140000 |          7        0.48       19.57
     150000 |         84        5.79       25.36
     152000 |          1        0.07       25.43
     155000 |          1        0.07       25.50
     156000 |          1        0.07       25.57
     160000 |          7        0.48       26.05
     165000 |          1        0.07       26.12
     168000 |          1        0.07       26.19
     170000 |          5        0.34       26.53
     175000 |         14        0.96       27.50
     180000 |          9        0.62       28.12
     185000 |          2        0.14       28.26
     190000 |          2        0.14       28.39
     200000 |        101        6.96       35.35
     215000 |          2        0.14       35.49
     220000 |          3        0.21       35.70
     225000 |          6        0.41       36.11
     230000 |          3        0.21       36.32
     235000 |          1        0.07       36.39
     240000 |          6        0.41       36.80
     250000 |         80        5.51       42.32
     260000 |          2        0.14       42.45
     265000 |          1        0.07       42.52
     270000 |          2        0.14       42.66
     275000 |          3        0.21       42.87
     300000 |        101        6.96       49.83
     315000 |          2        0.14       49.97
     320000 |          3        0.21       50.17
     325000 |          3        0.21       50.38
     330000 |          1        0.07       50.45
     345000 |          1        0.07       50.52
     350000 |         44        3.03       53.55
     360000 |          2        0.14       53.69
     370000 |          1        0.07       53.76
     375000 |          4        0.28       54.03
     380000 |          1        0.07       54.10
     400000 |         42        2.89       57.00
     410000 |          1        0.07       57.06
     420000 |          1        0.07       57.13
     425000 |          1        0.07       57.20
     432000 |          1        0.07       57.27
     450000 |         14        0.96       58.24
     470000 |          1        0.07       58.30
     500000 |         49        3.38       61.68
     550000 |          4        0.28       61.96
     600000 |         25        1.72       63.68
     625000 |          1        0.07       63.75
     650000 |          3        0.21       63.96
     700000 |         18        1.24       65.20
     720000 |          2        0.14       65.33
     750000 |         13        0.90       66.23
     800000 |         19        1.31       67.54
     850000 |          2        0.14       67.68
     900000 |          8        0.55       68.23
     940000 |          1        0.07       68.30
     950000 |          1        0.07       68.37
    1000000 |         50        3.45       71.81
    1050000 |          2        0.14       71.95
    1100000 |          5        0.34       72.29
    1150000 |          3        0.21       72.50
    1200000 |         24        1.65       74.16
    1250000 |          6        0.41       74.57
    1300000 |          7        0.48       75.05
    1400000 |          2        0.14       75.19
    1500000 |         56        3.86       79.05
    1600000 |          6        0.41       79.46
    1700000 |          6        0.41       79.88
    1750000 |          2        0.14       80.01
    1800000 |         14        0.96       80.98
    1900000 |          3        0.21       81.19
    2000000 |         55        3.79       84.98
    2100000 |          1        0.07       85.04
    2200000 |          6        0.41       85.46
    2250000 |          1        0.07       85.53
    2400000 |          5        0.34       85.87
    2500000 |         26        1.79       87.66
    2600000 |          1        0.07       87.73
    2700000 |          2        0.14       87.87
    2750000 |          4        0.28       88.15
    2800000 |          1        0.07       88.22
    3000000 |         42        2.89       91.11
    3250000 |          1        0.07       91.18
    3300000 |          1        0.07       91.25
    3400000 |          1        0.07       91.32
    3500000 |         22        1.52       92.83
    3600000 |          3        0.21       93.04
    3700000 |          1        0.07       93.11
    3750000 |          2        0.14       93.25
    3900000 |          1        0.07       93.31
    4000000 |         17        1.17       94.49
    4200000 |          1        0.07       94.56
    4500000 |         16        1.10       95.66
    4700000 |          1        0.07       95.73
    5000000 |         25        1.72       97.45
    5400000 |          1        0.07       97.52
    5500000 |          4        0.28       97.79
    6000000 |          7        0.48       98.28
    6500000 |          1        0.07       98.35
    7000000 |          3        0.21       98.55
    7500000 |          3        0.21       98.76
    8000000 |          1        0.07       98.83
    8500000 |          2        0.14       98.97
    9000000 |          2        0.14       99.10
    9250000 |          1        0.07       99.17
    9600000 |          1        0.07       99.24
   10000000 |          2        0.14       99.38
   12000000 |          3        0.21       99.59
   15000000 |          4        0.28       99.86
   19000000 |          1        0.07       99.93
   45000000 |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,451      100.00

-> tabulation of kr05a  

 rent would |
    pay per |
      month |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10        0.09        0.09
       2000 |          2        0.02        0.11
       2500 |          2        0.02        0.13
       3000 |          1        0.01        0.14
       5000 |          3        0.03        0.17
       6000 |          1        0.01        0.18
      10000 |         25        0.23        0.41
      12000 |          2        0.02        0.43
      15000 |         12        0.11        0.54
      20000 |         44        0.41        0.94
      25000 |         75        0.69        1.64
      30000 |         71        0.66        2.29
      35000 |          7        0.06        2.36
      40000 |         21        0.19        2.55
      45000 |          2        0.02        2.57
      50000 |        536        4.95        7.52
      56000 |          1        0.01        7.53
      60000 |         32        0.30        7.83
      62000 |          1        0.01        7.84
      65000 |          2        0.02        7.85
      70000 |         26        0.24        8.09
      75000 |         35        0.32        8.42
      80000 |         15        0.14        8.56
      90000 |          5        0.05        8.60
     100000 |        885        8.18       16.78
     120000 |         10        0.09       16.87
     125000 |         13        0.12       16.99
     150000 |        383        3.54       20.53
     160000 |          2        0.02       20.55
     165000 |          1        0.01       20.56
     170000 |          3        0.03       20.59
     175000 |          2        0.02       20.61
     180000 |          6        0.06       20.66
     192500 |          1        0.01       20.67
     200000 |        740        6.84       27.51
     209000 |          1        0.01       27.52
     210000 |          1        0.01       27.53
     220000 |          1        0.01       27.54
     224000 |          1        0.01       27.55
     225000 |          1        0.01       27.55
     230000 |          1        0.01       27.56
     240000 |          5        0.05       27.61
     250000 |        230        2.13       29.74
     270000 |          1        0.01       29.74
     275000 |          1        0.01       29.75
     300000 |        763        7.05       36.80
     320000 |          2        0.02       36.82
     325000 |          1        0.01       36.83
     350000 |         78        0.72       37.55
     360000 |          8        0.07       37.63
     400000 |        247        2.28       39.91
     450000 |         24        0.22       40.13
     500000 |      1,239       11.45       51.58
     550000 |          6        0.06       51.64
     600000 |        229        2.12       53.75
     650000 |          3        0.03       53.78
     700000 |        167        1.54       55.32
     750000 |         87        0.80       56.13
     800000 |        118        1.09       57.22
     850000 |          3        0.03       57.24
     900000 |         18        0.17       57.41
    1000000 |      1,365       12.61       70.02
    1050000 |          2        0.02       70.04
    1100000 |          3        0.03       70.07
    1200000 |        110        1.02       71.09
    1250000 |          4        0.04       71.12
    1300000 |          7        0.06       71.19
    1400000 |          4        0.04       71.23
    1500000 |        603        5.57       76.80
    1550000 |          1        0.01       76.81
    1600000 |          3        0.03       76.83
    1700000 |          7        0.06       76.90
    1750000 |          1        0.01       76.91
    1800000 |         17        0.16       77.07
    1900000 |          1        0.01       77.07
    2000000 |        649        6.00       83.07
    2200000 |          2        0.02       83.09
    2250000 |          2        0.02       83.11
    2300000 |          1        0.01       83.12
    2400000 |         16        0.15       83.27
    2500000 |        195        1.80       85.07
    2700000 |          3        0.03       85.10
    2750000 |          1        0.01       85.10
    2900000 |          1        0.01       85.11
    3000000 |        405        3.74       88.86
    3400000 |          1        0.01       88.87
    3500000 |         71        0.66       89.52
    3600000 |         12        0.11       89.63
    3800000 |          1        0.01       89.64
    4000000 |        170        1.57       91.21
    4200000 |          1        0.01       91.22
    4500000 |         18        0.17       91.39
    4800000 |          1        0.01       91.40
    5000000 |        331        3.06       94.46
    5500000 |          1        0.01       94.46
    5700000 |          1        0.01       94.47
    6000000 |        106        0.98       95.45
    6500000 |          3        0.03       95.48
    6800000 |          1        0.01       95.49
    7000000 |         73        0.67       96.17
    7500000 |         15        0.14       96.30
    8000000 |         58        0.54       96.84
    8500000 |          1        0.01       96.85
    9000000 |         10        0.09       96.94
    9500000 |          1        0.01       96.95
   10000000 |        133        1.23       98.18
   10500000 |          1        0.01       98.19
   11000000 |          2        0.02       98.21
   12000000 |         15        0.14       98.35
   12500000 |          2        0.02       98.36
   14000000 |          4        0.04       98.40
   15000000 |         64        0.59       98.99
   17000000 |          2        0.02       99.01
   17400000 |          1        0.01       99.02
   20000000 |         36        0.33       99.35
   21000000 |          1        0.01       99.36
   24000000 |          3        0.03       99.39
   25000000 |          6        0.06       99.45
   30000000 |         19        0.18       99.62
   35000000 |          1        0.01       99.63
   36000000 |          1        0.01       99.64
   40000000 |          7        0.06       99.70
   50000000 |         13        0.12       99.82
   60000000 |          3        0.03       99.85
   70000000 |          1        0.01       99.86
   75000000 |          1        0.01       99.87
   80000000 |          1        0.01       99.88
  100000000 |          2        0.02       99.90
  115000000 |          1        0.01       99.91
  120000000 |          1        0.01       99.92
  150000000 |          1        0.01       99.93
  200000000 |          3        0.03       99.95
  300000000 |          1        0.01       99.96
  350000000 |          1        0.01       99.97
  999999999 |          3        0.03      100.00
------------+-----------------------------------
      Total |     10,822      100.00

. sort hhid07  ;

. gen kr04=kr04a if kr04ax==2 ;
(12211 missing values generated)

. replace kr04=kr04a/12 if kr04ax==1 ;
(675 real changes made)

. gen kr05=kr05a if kr05ax==2 ;
(9132 missing values generated)

. replace kr05=kr05a/12 if kr05ax==1 ;
(6967 real changes made)

. gen _outlierkr04=1 if kr04>20000000 & kr04~=. ;
(12987 missing values generated)

. gen _outlierkr05=1 if kr05>20000000 & kr05~=.  ;
(12976 missing values generated)

. list hhid07 kr04 if _outlierkr04==1 ;

. list hhid07 kr05 if _outlierkr05==1  ;

       +--------------------+
       |  hhid07       kr05 |
       |--------------------|
 1929. | 0451500   8.33e+07 |
 2047. | 0471921   8.33e+07 |
 3093. | 0751900   2.92e+07 |
 3221. | 0800900   3.00e+07 |
 3355. | 0850511   2.50e+07 |
       |--------------------|
 3825. | 1021031   5.00e+07 |
 6644. | 1692300   1.50e+08 |
 6841. | 1742011   8.33e+07 |
 7380. | 1851300   7.00e+07 |
 8805. | 2260700   5.00e+07 |
       |--------------------|
10680. | 2730141   2.50e+07 |
       +--------------------+

. *replace kr04=. if _outlierkr04==1 ;
. *replace kr05=. if _outlierkr05==1 ;
. mvencode _outlierkr*, mv(0)  ;
_outlierkr04: 12987 missing values recoded
_outlierkr05: 12976 missing values recoded

. list hhid07 kr04 kr05 if _outlierkr04==1 | _outlierkr05==1  ;

       +---------------------------+
       |  hhid07   kr04       kr05 |
       |---------------------------|
 1929. | 0451500      .   8.33e+07 |
 2047. | 0471921      .   8.33e+07 |
 3093. | 0751900      .   2.92e+07 |
 3221. | 0800900      .   3.00e+07 |
 3355. | 0850511      .   2.50e+07 |
       |---------------------------|
 3825. | 1021031      .   5.00e+07 |
 6644. | 1692300      .   1.50e+08 |
 6841. | 1742011      .   8.33e+07 |
 7380. | 1851300      .   7.00e+07 |
 8805. | 2260700      .   5.00e+07 |
       |---------------------------|
10680. | 2730141      .   2.50e+07 |
       +---------------------------+

. tab1 _outlier*  ;

-> tabulation of _outlierkr04  

_outlierkr0 |
          4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,987      100.00      100.00
------------+-----------------------------------
      Total |     12,987      100.00

-> tabulation of _outlierkr05  

_outlierkr0 |
          5 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,976       99.92       99.92
          1 |         11        0.08      100.00
------------+-----------------------------------
      Total |     12,987      100.00

. sort hhid07  ;

. save $dir0\tempkr07, replace  ;
file E:\PCE\temp\\tempkr07.dta saved

. * II.2 Merge with kecid, kabid, information  ;
. ****************************************************************************  ;
. use $dir0\sc07, clear  ;

. sort hhid07  ;

. merge hhid07 using $dir0\tempkr07 ;

. tab _merge  ;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        549        4.06        4.06
          3 |     12,987       95.94      100.00
------------+-----------------------------------
      Total |     13,536      100.00

. *Only keep HHs who answered Book 2  ;
. keep if _merge==3  ;
(549 observations deleted)

. drop _merge  ;

. tab kr04ax  ;

do you know |
    monthly |
      rent? |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        675       46.17       46.17
          2 |        776       53.08       99.25
          8 |         10        0.68       99.93
          9 |          1        0.07      100.00
------------+-----------------------------------
      Total |      1,462      100.00

. tab kr05ax  ;

do you know |
   how much |
  hse would |
  rent for? |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,967       60.45       60.45
          2 |      3,855       33.45       93.90
          8 |        699        6.07       99.97
          9 |          4        0.03      100.00
------------+-----------------------------------
      Total |     11,525      100.00

. * II.3 Generate median variables   ;
. ****************************************************************************  ;
. egen medcom05a=median(kr05), by(commid07)  ;
(237 missing values generated)

. egen medkec05a=median(kr05), by(kecid)  ;
(227 missing values generated)

. egen medkab05a=median(kr05), by(kabid)  ;
(6 missing values generated)

. egen medcom04a=median(kr04), by(origea)  ;

. egen medkec04a=median(kr04), by(kecid)  ;
(6120 missing values generated)

. egen medkab04a=median(kr04), by(kabid)  ;
(1825 missing values generated)

. compress  ;
provid07 was float now byte
origea07 was float now byte
rural was float now byte
_outlierkr04 was float now byte
_outlierkr05 was float now byte
kabid07 was double now int
kecid07 was double now long

. * II.4. Imputation   ;
. ****************************************************************************  ;
. rename kr04 origkr04  ;

. rename kr05 origkr05  ;

. gen kr04=origkr04 if kr04ax~=. & origkr04~=.  ;
(11536 missing values generated)

. replace kr04=medcom04a if origea==1 & kr04ax~=. & origkr04==.  ;
(1 real change made)

. replace kr04=medkec04a if kr04ax~=. & kr04==.  ;
(5 real changes made)

. replace kr04=medkab04a if kr04ax~=. & kr04==.  ;
(5 real changes made)

. gen kr05=origkr05 if kr05ax~=. & origkr05~=.  ;
(2165 missing values generated)

. replace kr05=medcom05a if origea==1 & kr05ax~=. & origkr05==. ;
(409 real changes made)

.  replace kr05=medkec05a if kr05ax~=. & kr05==.  ;
(220 real changes made)

. replace kr05=medkab05a if kr05ax~=. & kr05==.  ;
(71 real changes made)

. gen  owners=(kr05ax~=.)  ;

. lab define owners 1 "Owners" 0 "Renters" ;

.  lab value owners owners  ;

. lab var owners "Owners or renters?"  ;

. replace kr04=. if _outlierkr04==1  ;
(0 real changes made)

. replace kr05=. if _outlierkr05==1  ;
(11 real changes made, 11 to missing)

. gen _outlierkr=(_outlierkr04==1 | _outlierkr05==1)  ;

. lab var _outlierkr04 "Any outlier in kr04"  ;

. lab var _outlierkr05 "Any outlier in kr05" ;

.  lab var _outlierkr "Any outlier in kr"  ;

. * II.5 Generate variable containing information on missing values in this data file   ;
. ****************************************************************************  ;
. gen misskr=1 if kr04==. & kr04ax~=.  ;
(12987 missing values generated)

. replace misskr=1 if kr05==. & kr05ax~=.  ;
(14 real changes made)

. replace misskr=0 if misskr==.  ;
(12973 real changes made)

. lab var misskr "Household with missng kr04 or kr05"  ;

. tab misskr, m  ;

  Household |
with missng |
    kr04 or |
       kr05 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,973       99.89       99.89
          1 |         14        0.11      100.00
------------+-----------------------------------
      Total |     12,987      100.00

. * II.6 Label, compress, sort, and save the data  ;
. ****************************************************************************  ;
. lab data "KRwith imputed values"  ;

. compress  ;
owners was float now byte
_outlierkr was float now byte
misskr was float now byte

. sort hhid07   ;

. capture drop med* origk*  ;

. save $dir0\b2_kr07, replace  ;
file E:\PCE\temp\\b2_kr07.dta saved

. ************************************************************************  ;
. * III. Book 1 - KS  Food Consumption: KS02, KS03  ;
. ************************************************************************  ;
. * III.1 Identify outliers  ;
. ****************************************************************************  ;
. use hhid07 ks02 ks03 ks1type using $dir7\b1_ks1, clear  ;

. bys hhid07 ks1type: keep if _n==_N ;
(0 observations deleted)

. format ks02 ks03 %12.0f  ;

. compress  ;

. * KS02  ;
. gen y=1 if ks02>=999995 ;
(479665 missing values generated)

. gen z=1 if ks03>=999995 ;
(479799 missing values generated)

. replace ks02=. if y==1 ;
(484 real changes made, 484 to missing)

. replace ks03=. if z==1 ;
(350 real changes made, 350 to missing)

. bys hhid07: egen _outlierks02=max(y)  ;
(475191 missing values generated)

. bys hhid07: egen _outlierks03=max(z)  ;
(476856 missing values generated)

. mvencode _outlierks02, mv(0)  ;
_outlierks02: 475191 missing values recoded

. mvencode _outlierks03, mv(0)  ;
_outlierks03: 476856 missing values recoded

. lab var _outlierks02 "Any outlier in ks02" ;

.  lab var _outlierks03 "Any outlier in ks03"  ;

. tab1 _outlierks02 _outlierks03  ;

-> tabulation of _outlierks02  

Any outlier |
    in ks02 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    475,191       98.97       98.97
          1 |      4,958        1.03      100.00
------------+-----------------------------------
      Total |    480,149      100.00

-> tabulation of _outlierks03  

Any outlier |
    in ks03 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    476,856       99.31       99.31
          1 |      3,293        0.69      100.00
------------+-----------------------------------
      Total |    480,149      100.00

. drop y  z   ;

. sort hhid07  ;

. * III.2. Reshape b1_ks1.dta from long to wide  ;
. ****************************************************************************  ;
. reshape wide ks02 ks03, i(hhid) j(ks1type) string  ;
(note: j = A AA B BA C CA D DA E EA F FA G GA H HA I IA IB J K L M N OA OB P Q R S T U V W X Y Z)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   480149   ->   12977
Number of variables                   6   ->      77
j variable (37 values)          ks1type   ->   (dropped)
xij variables:
                                   ks02   ->   ks02A ks02AA ... ks02Z
                                   ks03   ->   ks03A ks03AA ... ks03Z
-----------------------------------------------------------------------------

. gen _outlierks=(_outlierks02==1 | _outlierks03==1)  ;

. lab var _outlierks02 "Any outlier in ks02"  ;

. lab var _outlierks03 "Any outlier in ks03"  ;

. lab var _outlierks "Any outlier in ks"  ;

. aorder  ;

. sort hhid07 ;

. save $dir0\b1_ks107wide, replace ;
file E:\PCE\temp\\b1_ks107wide.dta saved

.  compress  ;
_outlierks was float now byte
_outlierks02 was float now byte
_outlierks03 was float now byte
ks03D was long now int
ks03R was long now int
ks03S was long now int

. * III.3. Merge with kecamatan ID, etc ;
.  ****************************************************************************  ;
. use $dir0\sc07, clear  ;

. sort hhid07  ;

. merge hhid07 using $dir0\b1_ks107wide  ;

. tab _merge  ;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        559        4.13        4.13
          3 |     12,977       95.87      100.00
------------+-----------------------------------
      Total |     13,536      100.00

. keep if _merge==3  ;
(559 observations deleted)

. drop _merge  ;

. * III.4. Generate median variables  ;
. ****************************************************************************  ;
. for var ks*: egen medcomX=median(X), by(commid07)  ;

->  egen medcomks02A=median(ks02A), by(commid07)

->  egen medcomks02AA=median(ks02AA), by(commid07)

->  egen medcomks02B=median(ks02B), by(commid07)

->  egen medcomks02BA=median(ks02BA), by(commid07)

->  egen medcomks02C=median(ks02C), by(commid07)

->  egen medcomks02CA=median(ks02CA), by(commid07)

->  egen medcomks02D=median(ks02D), by(commid07)

->  egen medcomks02DA=median(ks02DA), by(commid07)

->  egen medcomks02E=median(ks02E), by(commid07)

->  egen medcomks02EA=median(ks02EA), by(commid07)

->  egen medcomks02F=median(ks02F), by(commid07)

->  egen medcomks02FA=median(ks02FA), by(commid07)

->  egen medcomks02G=median(ks02G), by(commid07)

->  egen medcomks02GA=median(ks02GA), by(commid07)

->  egen medcomks02H=median(ks02H), by(commid07)

->  egen medcomks02HA=median(ks02HA), by(commid07)
(7 missing values generated)

->  egen medcomks02I=median(ks02I), by(commid07)

->  egen medcomks02IA=median(ks02IA), by(commid07)
(3 missing values generated)

->  egen medcomks02IB=median(ks02IB), by(commid07)
(1 missing value generated)

->  egen medcomks02J=median(ks02J), by(commid07)

->  egen medcomks02K=median(ks02K), by(commid07)

->  egen medcomks02L=median(ks02L), by(commid07)

->  egen medcomks02M=median(ks02M), by(commid07)

->  egen medcomks02N=median(ks02N), by(commid07)

->  egen medcomks02OA=median(ks02OA), by(commid07)

->  egen medcomks02OB=median(ks02OB), by(commid07)

->  egen medcomks02P=median(ks02P), by(commid07)

->  egen medcomks02Q=median(ks02Q), by(commid07)

->  egen medcomks02R=median(ks02R), by(commid07)

->  egen medcomks02S=median(ks02S), by(commid07)

->  egen medcomks02T=median(ks02T), by(commid07)

->  egen medcomks02U=median(ks02U), by(commid07)

->  egen medcomks02V=median(ks02V), by(commid07)

->  egen medcomks02W=median(ks02W), by(commid07)

->  egen medcomks02X=median(ks02X), by(commid07)

->  egen medcomks02Y=median(ks02Y), by(commid07)

->  egen medcomks02Z=median(ks02Z), by(commid07)

->  egen medcomks03A=median(ks03A), by(commid07)
(1 missing value generated)

->  egen medcomks03AA=median(ks03AA), by(commid07)

->  egen medcomks03B=median(ks03B), by(commid07)

->  egen medcomks03BA=median(ks03BA), by(commid07)

->  egen medcomks03C=median(ks03C), by(commid07)

->  egen medcomks03CA=median(ks03CA), by(commid07)

->  egen medcomks03D=median(ks03D), by(commid07)

->  egen medcomks03DA=median(ks03DA), by(commid07)

->  egen medcomks03E=median(ks03E), by(commid07)

->  egen medcomks03EA=median(ks03EA), by(commid07)
(1 missing value generated)

->  egen medcomks03F=median(ks03F), by(commid07)
(1 missing value generated)

->  egen medcomks03FA=median(ks03FA), by(commid07)

->  egen medcomks03G=median(ks03G), by(commid07)

->  egen medcomks03GA=median(ks03GA), by(commid07)

->  egen medcomks03H=median(ks03H), by(commid07)

->  egen medcomks03HA=median(ks03HA), by(commid07)

->  egen medcomks03I=median(ks03I), by(commid07)

->  egen medcomks03IA=median(ks03IA), by(commid07)

->  egen medcomks03IB=median(ks03IB), by(commid07)

->  egen medcomks03J=median(ks03J), by(commid07)

->  egen medcomks03K=median(ks03K), by(commid07)

->  egen medcomks03L=median(ks03L), by(commid07)

->  egen medcomks03M=median(ks03M), by(commid07)
(1 missing value generated)

->  egen medcomks03N=median(ks03N), by(commid07)

->  egen medcomks03OA=median(ks03OA), by(commid07)

->  egen medcomks03OB=median(ks03OB), by(commid07)

->  egen medcomks03P=median(ks03P), by(commid07)

->  egen medcomks03Q=median(ks03Q), by(commid07)

->  egen medcomks03R=median(ks03R), by(commid07)

->  egen medcomks03S=median(ks03S), by(commid07)

->  egen medcomks03T=median(ks03T), by(commid07)

->  egen medcomks03U=median(ks03U), by(commid07)

->  egen medcomks03V=median(ks03V), by(commid07)

->  egen medcomks03W=median(ks03W), by(commid07)

->  egen medcomks03X=median(ks03X), by(commid07)

->  egen medcomks03Y=median(ks03Y), by(commid07)

->  egen medcomks03Z=median(ks03Z), by(commid07)
(1 missing value generated)

. for var ks*: egen medkecX=median(X), by(kecid)  ;

->  egen medkecks02A=median(ks02A), by(kecid)

->  egen medkecks02AA=median(ks02AA), by(kecid)

->  egen medkecks02B=median(ks02B), by(kecid)

->  egen medkecks02BA=median(ks02BA), by(kecid)

->  egen medkecks02C=median(ks02C), by(kecid)

->  egen medkecks02CA=median(ks02CA), by(kecid)

->  egen medkecks02D=median(ks02D), by(kecid)

->  egen medkecks02DA=median(ks02DA), by(kecid)

->  egen medkecks02E=median(ks02E), by(kecid)

->  egen medkecks02EA=median(ks02EA), by(kecid)

->  egen medkecks02F=median(ks02F), by(kecid)

->  egen medkecks02FA=median(ks02FA), by(kecid)

->  egen medkecks02G=median(ks02G), by(kecid)

->  egen medkecks02GA=median(ks02GA), by(kecid)

->  egen medkecks02H=median(ks02H), by(kecid)

->  egen medkecks02HA=median(ks02HA), by(kecid)
(6 missing values generated)

->  egen medkecks02I=median(ks02I), by(kecid)

->  egen medkecks02IA=median(ks02IA), by(kecid)
(3 missing values generated)

->  egen medkecks02IB=median(ks02IB), by(kecid)
(1 missing value generated)

->  egen medkecks02J=median(ks02J), by(kecid)

->  egen medkecks02K=median(ks02K), by(kecid)

->  egen medkecks02L=median(ks02L), by(kecid)

->  egen medkecks02M=median(ks02M), by(kecid)

->  egen medkecks02N=median(ks02N), by(kecid)

->  egen medkecks02OA=median(ks02OA), by(kecid)

->  egen medkecks02OB=median(ks02OB), by(kecid)

->  egen medkecks02P=median(ks02P), by(kecid)

->  egen medkecks02Q=median(ks02Q), by(kecid)

->  egen medkecks02R=median(ks02R), by(kecid)

->  egen medkecks02S=median(ks02S), by(kecid)

->  egen medkecks02T=median(ks02T), by(kecid)

->  egen medkecks02U=median(ks02U), by(kecid)

->  egen medkecks02V=median(ks02V), by(kecid)

->  egen medkecks02W=median(ks02W), by(kecid)

->  egen medkecks02X=median(ks02X), by(kecid)

->  egen medkecks02Y=median(ks02Y), by(kecid)

->  egen medkecks02Z=median(ks02Z), by(kecid)

->  egen medkecks03A=median(ks03A), by(kecid)
(1 missing value generated)

->  egen medkecks03AA=median(ks03AA), by(kecid)

->  egen medkecks03B=median(ks03B), by(kecid)

->  egen medkecks03BA=median(ks03BA), by(kecid)

->  egen medkecks03C=median(ks03C), by(kecid)

->  egen medkecks03CA=median(ks03CA), by(kecid)

->  egen medkecks03D=median(ks03D), by(kecid)

->  egen medkecks03DA=median(ks03DA), by(kecid)

->  egen medkecks03E=median(ks03E), by(kecid)

->  egen medkecks03EA=median(ks03EA), by(kecid)
(1 missing value generated)

->  egen medkecks03F=median(ks03F), by(kecid)
(1 missing value generated)

->  egen medkecks03FA=median(ks03FA), by(kecid)

->  egen medkecks03G=median(ks03G), by(kecid)

->  egen medkecks03GA=median(ks03GA), by(kecid)

->  egen medkecks03H=median(ks03H), by(kecid)

->  egen medkecks03HA=median(ks03HA), by(kecid)

->  egen medkecks03I=median(ks03I), by(kecid)

->  egen medkecks03IA=median(ks03IA), by(kecid)

->  egen medkecks03IB=median(ks03IB), by(kecid)

->  egen medkecks03J=median(ks03J), by(kecid)

->  egen medkecks03K=median(ks03K), by(kecid)

->  egen medkecks03L=median(ks03L), by(kecid)

->  egen medkecks03M=median(ks03M), by(kecid)
(1 missing value generated)

->  egen medkecks03N=median(ks03N), by(kecid)

->  egen medkecks03OA=median(ks03OA), by(kecid)

->  egen medkecks03OB=median(ks03OB), by(kecid)

->  egen medkecks03P=median(ks03P), by(kecid)

->  egen medkecks03Q=median(ks03Q), by(kecid)

->  egen medkecks03R=median(ks03R), by(kecid)

->  egen medkecks03S=median(ks03S), by(kecid)

->  egen medkecks03T=median(ks03T), by(kecid)

->  egen medkecks03U=median(ks03U), by(kecid)

->  egen medkecks03V=median(ks03V), by(kecid)

->  egen medkecks03W=median(ks03W), by(kecid)

->  egen medkecks03X=median(ks03X), by(kecid)

->  egen medkecks03Y=median(ks03Y), by(kecid)

->  egen medkecks03Z=median(ks03Z), by(kecid)
(1 missing value generated)

. for var ks*: egen medkabX=median(X), by(kabid)  ;

->  egen medkabks02A=median(ks02A), by(kabid)

->  egen medkabks02AA=median(ks02AA), by(kabid)

->  egen medkabks02B=median(ks02B), by(kabid)

->  egen medkabks02BA=median(ks02BA), by(kabid)

->  egen medkabks02C=median(ks02C), by(kabid)

->  egen medkabks02CA=median(ks02CA), by(kabid)

->  egen medkabks02D=median(ks02D), by(kabid)

->  egen medkabks02DA=median(ks02DA), by(kabid)

->  egen medkabks02E=median(ks02E), by(kabid)

->  egen medkabks02EA=median(ks02EA), by(kabid)

->  egen medkabks02F=median(ks02F), by(kabid)

->  egen medkabks02FA=median(ks02FA), by(kabid)

->  egen medkabks02G=median(ks02G), by(kabid)

->  egen medkabks02GA=median(ks02GA), by(kabid)

->  egen medkabks02H=median(ks02H), by(kabid)

->  egen medkabks02HA=median(ks02HA), by(kabid)

->  egen medkabks02I=median(ks02I), by(kabid)

->  egen medkabks02IA=median(ks02IA), by(kabid)

->  egen medkabks02IB=median(ks02IB), by(kabid)

->  egen medkabks02J=median(ks02J), by(kabid)

->  egen medkabks02K=median(ks02K), by(kabid)

->  egen medkabks02L=median(ks02L), by(kabid)

->  egen medkabks02M=median(ks02M), by(kabid)

->  egen medkabks02N=median(ks02N), by(kabid)

->  egen medkabks02OA=median(ks02OA), by(kabid)

->  egen medkabks02OB=median(ks02OB), by(kabid)

->  egen medkabks02P=median(ks02P), by(kabid)

->  egen medkabks02Q=median(ks02Q), by(kabid)

->  egen medkabks02R=median(ks02R), by(kabid)

->  egen medkabks02S=median(ks02S), by(kabid)

->  egen medkabks02T=median(ks02T), by(kabid)

->  egen medkabks02U=median(ks02U), by(kabid)

->  egen medkabks02V=median(ks02V), by(kabid)

->  egen medkabks02W=median(ks02W), by(kabid)

->  egen medkabks02X=median(ks02X), by(kabid)

->  egen medkabks02Y=median(ks02Y), by(kabid)

->  egen medkabks02Z=median(ks02Z), by(kabid)

->  egen medkabks03A=median(ks03A), by(kabid)

->  egen medkabks03AA=median(ks03AA), by(kabid)

->  egen medkabks03B=median(ks03B), by(kabid)

->  egen medkabks03BA=median(ks03BA), by(kabid)

->  egen medkabks03C=median(ks03C), by(kabid)

->  egen medkabks03CA=median(ks03CA), by(kabid)

->  egen medkabks03D=median(ks03D), by(kabid)

->  egen medkabks03DA=median(ks03DA), by(kabid)

->  egen medkabks03E=median(ks03E), by(kabid)

->  egen medkabks03EA=median(ks03EA), by(kabid)

->  egen medkabks03F=median(ks03F), by(kabid)

->  egen medkabks03FA=median(ks03FA), by(kabid)

->  egen medkabks03G=median(ks03G), by(kabid)

->  egen medkabks03GA=median(ks03GA), by(kabid)

->  egen medkabks03H=median(ks03H), by(kabid)

->  egen medkabks03HA=median(ks03HA), by(kabid)

->  egen medkabks03I=median(ks03I), by(kabid)

->  egen medkabks03IA=median(ks03IA), by(kabid)

->  egen medkabks03IB=median(ks03IB), by(kabid)

->  egen medkabks03J=median(ks03J), by(kabid)

->  egen medkabks03K=median(ks03K), by(kabid)

->  egen medkabks03L=median(ks03L), by(kabid)

->  egen medkabks03M=median(ks03M), by(kabid)

->  egen medkabks03N=median(ks03N), by(kabid)

->  egen medkabks03OA=median(ks03OA), by(kabid)

->  egen medkabks03OB=median(ks03OB), by(kabid)

->  egen medkabks03P=median(ks03P), by(kabid)

->  egen medkabks03Q=median(ks03Q), by(kabid)

->  egen medkabks03R=median(ks03R), by(kabid)

->  egen medkabks03S=median(ks03S), by(kabid)

->  egen medkabks03T=median(ks03T), by(kabid)

->  egen medkabks03U=median(ks03U), by(kabid)

->  egen medkabks03V=median(ks03V), by(kabid)

->  egen medkabks03W=median(ks03W), by(kabid)

->  egen medkabks03X=median(ks03X), by(kabid)

->  egen medkabks03Y=median(ks03Y), by(kabid)

->  egen medkabks03Z=median(ks03Z), by(kabid)

. * III.5. Imputation  ;
. ****************************************************************************  ;
. for var ks*: gen origX=X  ;

->  gen origks02A=ks02A
(8 missing values generated)

->  gen origks02AA=ks02AA
(17 missing values generated)

->  gen origks02B=ks02B
(6 missing values generated)

->  gen origks02BA=ks02BA
(10 missing values generated)

->  gen origks02C=ks02C
(9 missing values generated)

->  gen origks02CA=ks02CA
(15 missing values generated)

->  gen origks02D=ks02D
(7 missing values generated)

->  gen origks02DA=ks02DA
(8 missing values generated)

->  gen origks02E=ks02E
(10 missing values generated)

->  gen origks02EA=ks02EA
(11 missing values generated)

->  gen origks02F=ks02F
(14 missing values generated)

->  gen origks02FA=ks02FA
(12 missing values generated)

->  gen origks02G=ks02G
(9 missing values generated)

->  gen origks02GA=ks02GA
(8 missing values generated)

->  gen origks02H=ks02H
(17 missing values generated)

->  gen origks02HA=ks02HA
(45 missing values generated)

->  gen origks02I=ks02I
(14 missing values generated)

->  gen origks02IA=ks02IA
(22 missing values generated)

->  gen origks02IB=ks02IB
(22 missing values generated)

->  gen origks02J=ks02J
(15 missing values generated)

->  gen origks02K=ks02K
(10 missing values generated)

->  gen origks02L=ks02L
(14 missing values generated)

->  gen origks02M=ks02M
(12 missing values generated)

->  gen origks02N=ks02N
(12 missing values generated)

->  gen origks02OA=ks02OA
(7 missing values generated)

->  gen origks02OB=ks02OB
(13 missing values generated)

->  gen origks02P=ks02P
(12 missing values generated)

->  gen origks02Q=ks02Q
(14 missing values generated)

->  gen origks02R=ks02R
(16 missing values generated)

->  gen origks02S=ks02S
(13 missing values generated)

->  gen origks02T=ks02T
(13 missing values generated)

->  gen origks02U=ks02U
(8 missing values generated)

->  gen origks02V=ks02V
(24 missing values generated)

->  gen origks02W=ks02W
(12 missing values generated)

->  gen origks02X=ks02X
(6 missing values generated)

->  gen origks02Y=ks02Y
(14 missing values generated)

->  gen origks02Z=ks02Z
(5 missing values generated)

->  gen origks03A=ks03A
(13 missing values generated)

->  gen origks03AA=ks03AA
(10 missing values generated)

->  gen origks03B=ks03B
(7 missing values generated)

->  gen origks03BA=ks03BA
(9 missing values generated)

->  gen origks03C=ks03C
(8 missing values generated)

->  gen origks03CA=ks03CA
(12 missing values generated)

->  gen origks03D=ks03D
(9 missing values generated)

->  gen origks03DA=ks03DA
(8 missing values generated)

->  gen origks03E=ks03E
(8 missing values generated)

->  gen origks03EA=ks03EA
(11 missing values generated)

->  gen origks03F=ks03F
(14 missing values generated)

->  gen origks03FA=ks03FA
(10 missing values generated)

->  gen origks03G=ks03G
(8 missing values generated)

->  gen origks03GA=ks03GA
(7 missing values generated)

->  gen origks03H=ks03H
(17 missing values generated)

->  gen origks03HA=ks03HA
(10 missing values generated)

->  gen origks03I=ks03I
(6 missing values generated)

->  gen origks03IA=ks03IA
(18 missing values generated)

->  gen origks03IB=ks03IB
(9 missing values generated)

->  gen origks03J=ks03J
(13 missing values generated)

->  gen origks03K=ks03K
(7 missing values generated)

->  gen origks03L=ks03L
(9 missing values generated)

->  gen origks03M=ks03M
(11 missing values generated)

->  gen origks03N=ks03N
(7 missing values generated)

->  gen origks03OA=ks03OA
(6 missing values generated)

->  gen origks03OB=ks03OB
(7 missing values generated)

->  gen origks03P=ks03P
(11 missing values generated)

->  gen origks03Q=ks03Q
(10 missing values generated)

->  gen origks03R=ks03R
(9 missing values generated)

->  gen origks03S=ks03S
(9 missing values generated)

->  gen origks03T=ks03T
(7 missing values generated)

->  gen origks03U=ks03U
(7 missing values generated)

->  gen origks03V=ks03V
(11 missing values generated)

->  gen origks03W=ks03W
(7 missing values generated)

->  gen origks03X=ks03X
(5 missing values generated)

->  gen origks03Y=ks03Y
(11 missing values generated)

->  gen origks03Z=ks03Z
(9 missing values generated)

. for var ks*: replace X=origX if origX~=.  ;

->  replace ks02A=origks02A if origks02A~=.
(0 real changes made)

->  replace ks02AA=origks02AA if origks02AA~=.
(0 real changes made)

->  replace ks02B=origks02B if origks02B~=.
(0 real changes made)

->  replace ks02BA=origks02BA if origks02BA~=.
(0 real changes made)

->  replace ks02C=origks02C if origks02C~=.
(0 real changes made)

->  replace ks02CA=origks02CA if origks02CA~=.
(0 real changes made)

->  replace ks02D=origks02D if origks02D~=.
(0 real changes made)

->  replace ks02DA=origks02DA if origks02DA~=.
(0 real changes made)

->  replace ks02E=origks02E if origks02E~=.
(0 real changes made)

->  replace ks02EA=origks02EA if origks02EA~=.
(0 real changes made)

->  replace ks02F=origks02F if origks02F~=.
(0 real changes made)

->  replace ks02FA=origks02FA if origks02FA~=.
(0 real changes made)

->  replace ks02G=origks02G if origks02G~=.
(0 real changes made)

->  replace ks02GA=origks02GA if origks02GA~=.
(0 real changes made)

->  replace ks02H=origks02H if origks02H~=.
(0 real changes made)

->  replace ks02HA=origks02HA if origks02HA~=.
(0 real changes made)

->  replace ks02I=origks02I if origks02I~=.
(0 real changes made)

->  replace ks02IA=origks02IA if origks02IA~=.
(0 real changes made)

->  replace ks02IB=origks02IB if origks02IB~=.
(0 real changes made)

->  replace ks02J=origks02J if origks02J~=.
(0 real changes made)

->  replace ks02K=origks02K if origks02K~=.
(0 real changes made)

->  replace ks02L=origks02L if origks02L~=.
(0 real changes made)

->  replace ks02M=origks02M if origks02M~=.
(0 real changes made)

->  replace ks02N=origks02N if origks02N~=.
(0 real changes made)

->  replace ks02OA=origks02OA if origks02OA~=.
(0 real changes made)

->  replace ks02OB=origks02OB if origks02OB~=.
(0 real changes made)

->  replace ks02P=origks02P if origks02P~=.
(0 real changes made)

->  replace ks02Q=origks02Q if origks02Q~=.
(0 real changes made)

->  replace ks02R=origks02R if origks02R~=.
(0 real changes made)

->  replace ks02S=origks02S if origks02S~=.
(0 real changes made)

->  replace ks02T=origks02T if origks02T~=.
(0 real changes made)

->  replace ks02U=origks02U if origks02U~=.
(0 real changes made)

->  replace ks02V=origks02V if origks02V~=.
(0 real changes made)

->  replace ks02W=origks02W if origks02W~=.
(0 real changes made)

->  replace ks02X=origks02X if origks02X~=.
(0 real changes made)

->  replace ks02Y=origks02Y if origks02Y~=.
(0 real changes made)

->  replace ks02Z=origks02Z if origks02Z~=.
(0 real changes made)

->  replace ks03A=origks03A if origks03A~=.
(0 real changes made)

->  replace ks03AA=origks03AA if origks03AA~=.
(0 real changes made)

->  replace ks03B=origks03B if origks03B~=.
(0 real changes made)

->  replace ks03BA=origks03BA if origks03BA~=.
(0 real changes made)

->  replace ks03C=origks03C if origks03C~=.
(0 real changes made)

->  replace ks03CA=origks03CA if origks03CA~=.
(0 real changes made)

->  replace ks03D=origks03D if origks03D~=.
(0 real changes made)

->  replace ks03DA=origks03DA if origks03DA~=.
(0 real changes made)

->  replace ks03E=origks03E if origks03E~=.
(0 real changes made)

->  replace ks03EA=origks03EA if origks03EA~=.
(0 real changes made)

->  replace ks03F=origks03F if origks03F~=.
(0 real changes made)

->  replace ks03FA=origks03FA if origks03FA~=.
(0 real changes made)

->  replace ks03G=origks03G if origks03G~=.
(0 real changes made)

->  replace ks03GA=origks03GA if origks03GA~=.
(0 real changes made)

->  replace ks03H=origks03H if origks03H~=.
(0 real changes made)

->  replace ks03HA=origks03HA if origks03HA~=.
(0 real changes made)

->  replace ks03I=origks03I if origks03I~=.
(0 real changes made)

->  replace ks03IA=origks03IA if origks03IA~=.
(0 real changes made)

->  replace ks03IB=origks03IB if origks03IB~=.
(0 real changes made)

->  replace ks03J=origks03J if origks03J~=.
(0 real changes made)

->  replace ks03K=origks03K if origks03K~=.
(0 real changes made)

->  replace ks03L=origks03L if origks03L~=.
(0 real changes made)

->  replace ks03M=origks03M if origks03M~=.
(0 real changes made)

->  replace ks03N=origks03N if origks03N~=.
(0 real changes made)

->  replace ks03OA=origks03OA if origks03OA~=.
(0 real changes made)

->  replace ks03OB=origks03OB if origks03OB~=.
(0 real changes made)

->  replace ks03P=origks03P if origks03P~=.
(0 real changes made)

->  replace ks03Q=origks03Q if origks03Q~=.
(0 real changes made)

->  replace ks03R=origks03R if origks03R~=.
(0 real changes made)

->  replace ks03S=origks03S if origks03S~=.
(0 real changes made)

->  replace ks03T=origks03T if origks03T~=.
(0 real changes made)

->  replace ks03U=origks03U if origks03U~=.
(0 real changes made)

->  replace ks03V=origks03V if origks03V~=.
(0 real changes made)

->  replace ks03W=origks03W if origks03W~=.
(0 real changes made)

->  replace ks03X=origks03X if origks03X~=.
(0 real changes made)

->  replace ks03Y=origks03Y if origks03Y~=.
(0 real changes made)

->  replace ks03Z=origks03Z if origks03Z~=.
(0 real changes made)

. for var ks02*: replace X=medcomX if X==. & origea==1 & _outlierks02~=1  ;

->  replace ks02A=medcomks02A if ks02A==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02AA=medcomks02AA if ks02AA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02B=medcomks02B if ks02B==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02BA=medcomks02BA if ks02BA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02C=medcomks02C if ks02C==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02CA=medcomks02CA if ks02CA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02D=medcomks02D if ks02D==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02DA=medcomks02DA if ks02DA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02E=medcomks02E if ks02E==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02EA=medcomks02EA if ks02EA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02F=medcomks02F if ks02F==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02FA=medcomks02FA if ks02FA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02G=medcomks02G if ks02G==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02GA=medcomks02GA if ks02GA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02H=medcomks02H if ks02H==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02HA=medcomks02HA if ks02HA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02I=medcomks02I if ks02I==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02IA=medcomks02IA if ks02IA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02IB=medcomks02IB if ks02IB==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02J=medcomks02J if ks02J==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02K=medcomks02K if ks02K==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02L=medcomks02L if ks02L==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02M=medcomks02M if ks02M==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02N=medcomks02N if ks02N==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02OA=medcomks02OA if ks02OA==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02OB=medcomks02OB if ks02OB==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02P=medcomks02P if ks02P==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02Q=medcomks02Q if ks02Q==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02R=medcomks02R if ks02R==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02S=medcomks02S if ks02S==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02T=medcomks02T if ks02T==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02U=medcomks02U if ks02U==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02V=medcomks02V if ks02V==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02W=medcomks02W if ks02W==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02X=medcomks02X if ks02X==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02Y=medcomks02Y if ks02Y==. & origea==1 & _outlierks02~=1
(0 real changes made)

->  replace ks02Z=medcomks02Z if ks02Z==. & origea==1 & _outlierks02~=1
(0 real changes made)

. for var ks02*: replace X=medkecX if X==. & _outlierks02~=1  ;

->  replace ks02A=medkecks02A if ks02A==. & _outlierks02~=1
(0 real changes made)

->  replace ks02AA=medkecks02AA if ks02AA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02B=medkecks02B if ks02B==. & _outlierks02~=1
(0 real changes made)

->  replace ks02BA=medkecks02BA if ks02BA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02C=medkecks02C if ks02C==. & _outlierks02~=1
(0 real changes made)

->  replace ks02CA=medkecks02CA if ks02CA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02D=medkecks02D if ks02D==. & _outlierks02~=1
(0 real changes made)

->  replace ks02DA=medkecks02DA if ks02DA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02E=medkecks02E if ks02E==. & _outlierks02~=1
(0 real changes made)

->  replace ks02EA=medkecks02EA if ks02EA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02F=medkecks02F if ks02F==. & _outlierks02~=1
(0 real changes made)

->  replace ks02FA=medkecks02FA if ks02FA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02G=medkecks02G if ks02G==. & _outlierks02~=1
(0 real changes made)

->  replace ks02GA=medkecks02GA if ks02GA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02H=medkecks02H if ks02H==. & _outlierks02~=1
(0 real changes made)

->  replace ks02HA=medkecks02HA if ks02HA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02I=medkecks02I if ks02I==. & _outlierks02~=1
(0 real changes made)

->  replace ks02IA=medkecks02IA if ks02IA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02IB=medkecks02IB if ks02IB==. & _outlierks02~=1
(0 real changes made)

->  replace ks02J=medkecks02J if ks02J==. & _outlierks02~=1
(0 real changes made)

->  replace ks02K=medkecks02K if ks02K==. & _outlierks02~=1
(0 real changes made)

->  replace ks02L=medkecks02L if ks02L==. & _outlierks02~=1
(0 real changes made)

->  replace ks02M=medkecks02M if ks02M==. & _outlierks02~=1
(0 real changes made)

->  replace ks02N=medkecks02N if ks02N==. & _outlierks02~=1
(0 real changes made)

->  replace ks02OA=medkecks02OA if ks02OA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02OB=medkecks02OB if ks02OB==. & _outlierks02~=1
(0 real changes made)

->  replace ks02P=medkecks02P if ks02P==. & _outlierks02~=1
(0 real changes made)

->  replace ks02Q=medkecks02Q if ks02Q==. & _outlierks02~=1
(0 real changes made)

->  replace ks02R=medkecks02R if ks02R==. & _outlierks02~=1
(0 real changes made)

->  replace ks02S=medkecks02S if ks02S==. & _outlierks02~=1
(0 real changes made)

->  replace ks02T=medkecks02T if ks02T==. & _outlierks02~=1
(0 real changes made)

->  replace ks02U=medkecks02U if ks02U==. & _outlierks02~=1
(0 real changes made)

->  replace ks02V=medkecks02V if ks02V==. & _outlierks02~=1
(0 real changes made)

->  replace ks02W=medkecks02W if ks02W==. & _outlierks02~=1
(0 real changes made)

->  replace ks02X=medkecks02X if ks02X==. & _outlierks02~=1
(0 real changes made)

->  replace ks02Y=medkecks02Y if ks02Y==. & _outlierks02~=1
(0 real changes made)

->  replace ks02Z=medkecks02Z if ks02Z==. & _outlierks02~=1
(0 real changes made)

. for var ks02*: replace X=medkabX if X==. & _outlierks02~=1  ;

->  replace ks02A=medkabks02A if ks02A==. & _outlierks02~=1
(0 real changes made)

->  replace ks02AA=medkabks02AA if ks02AA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02B=medkabks02B if ks02B==. & _outlierks02~=1
(0 real changes made)

->  replace ks02BA=medkabks02BA if ks02BA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02C=medkabks02C if ks02C==. & _outlierks02~=1
(0 real changes made)

->  replace ks02CA=medkabks02CA if ks02CA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02D=medkabks02D if ks02D==. & _outlierks02~=1
(0 real changes made)

->  replace ks02DA=medkabks02DA if ks02DA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02E=medkabks02E if ks02E==. & _outlierks02~=1
(0 real changes made)

->  replace ks02EA=medkabks02EA if ks02EA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02F=medkabks02F if ks02F==. & _outlierks02~=1
(0 real changes made)

->  replace ks02FA=medkabks02FA if ks02FA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02G=medkabks02G if ks02G==. & _outlierks02~=1
(0 real changes made)

->  replace ks02GA=medkabks02GA if ks02GA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02H=medkabks02H if ks02H==. & _outlierks02~=1
(0 real changes made)

->  replace ks02HA=medkabks02HA if ks02HA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02I=medkabks02I if ks02I==. & _outlierks02~=1
(0 real changes made)

->  replace ks02IA=medkabks02IA if ks02IA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02IB=medkabks02IB if ks02IB==. & _outlierks02~=1
(0 real changes made)

->  replace ks02J=medkabks02J if ks02J==. & _outlierks02~=1
(0 real changes made)

->  replace ks02K=medkabks02K if ks02K==. & _outlierks02~=1
(0 real changes made)

->  replace ks02L=medkabks02L if ks02L==. & _outlierks02~=1
(0 real changes made)

->  replace ks02M=medkabks02M if ks02M==. & _outlierks02~=1
(0 real changes made)

->  replace ks02N=medkabks02N if ks02N==. & _outlierks02~=1
(0 real changes made)

->  replace ks02OA=medkabks02OA if ks02OA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02OB=medkabks02OB if ks02OB==. & _outlierks02~=1
(0 real changes made)

->  replace ks02P=medkabks02P if ks02P==. & _outlierks02~=1
(0 real changes made)

->  replace ks02Q=medkabks02Q if ks02Q==. & _outlierks02~=1
(0 real changes made)

->  replace ks02R=medkabks02R if ks02R==. & _outlierks02~=1
(0 real changes made)

->  replace ks02S=medkabks02S if ks02S==. & _outlierks02~=1
(0 real changes made)

->  replace ks02T=medkabks02T if ks02T==. & _outlierks02~=1
(0 real changes made)

->  replace ks02U=medkabks02U if ks02U==. & _outlierks02~=1
(0 real changes made)

->  replace ks02V=medkabks02V if ks02V==. & _outlierks02~=1
(0 real changes made)

->  replace ks02W=medkabks02W if ks02W==. & _outlierks02~=1
(0 real changes made)

->  replace ks02X=medkabks02X if ks02X==. & _outlierks02~=1
(0 real changes made)

->  replace ks02Y=medkabks02Y if ks02Y==. & _outlierks02~=1
(0 real changes made)

->  replace ks02Z=medkabks02Z if ks02Z==. & _outlierks02~=1
(0 real changes made)

. for var ks03*: replace X=medcomX if X==. & origea==1 & _outlierks03~=1  ;

->  replace ks03A=medcomks03A if ks03A==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03AA=medcomks03AA if ks03AA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03B=medcomks03B if ks03B==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03BA=medcomks03BA if ks03BA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03C=medcomks03C if ks03C==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03CA=medcomks03CA if ks03CA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03D=medcomks03D if ks03D==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03DA=medcomks03DA if ks03DA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03E=medcomks03E if ks03E==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03EA=medcomks03EA if ks03EA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03F=medcomks03F if ks03F==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03FA=medcomks03FA if ks03FA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03G=medcomks03G if ks03G==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03GA=medcomks03GA if ks03GA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03H=medcomks03H if ks03H==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03HA=medcomks03HA if ks03HA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03I=medcomks03I if ks03I==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03IA=medcomks03IA if ks03IA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03IB=medcomks03IB if ks03IB==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03J=medcomks03J if ks03J==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03K=medcomks03K if ks03K==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03L=medcomks03L if ks03L==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03M=medcomks03M if ks03M==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03N=medcomks03N if ks03N==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03OA=medcomks03OA if ks03OA==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03OB=medcomks03OB if ks03OB==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03P=medcomks03P if ks03P==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03Q=medcomks03Q if ks03Q==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03R=medcomks03R if ks03R==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03S=medcomks03S if ks03S==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03T=medcomks03T if ks03T==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03U=medcomks03U if ks03U==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03V=medcomks03V if ks03V==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03W=medcomks03W if ks03W==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03X=medcomks03X if ks03X==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03Y=medcomks03Y if ks03Y==. & origea==1 & _outlierks03~=1
(0 real changes made)

->  replace ks03Z=medcomks03Z if ks03Z==. & origea==1 & _outlierks03~=1
(0 real changes made)

. for var ks03*: replace X=medkecX if X==. & _outlierks03~=1  ;

->  replace ks03A=medkecks03A if ks03A==. & _outlierks03~=1
(0 real changes made)

->  replace ks03AA=medkecks03AA if ks03AA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03B=medkecks03B if ks03B==. & _outlierks03~=1
(0 real changes made)

->  replace ks03BA=medkecks03BA if ks03BA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03C=medkecks03C if ks03C==. & _outlierks03~=1
(0 real changes made)

->  replace ks03CA=medkecks03CA if ks03CA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03D=medkecks03D if ks03D==. & _outlierks03~=1
(0 real changes made)

->  replace ks03DA=medkecks03DA if ks03DA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03E=medkecks03E if ks03E==. & _outlierks03~=1
(0 real changes made)

->  replace ks03EA=medkecks03EA if ks03EA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03F=medkecks03F if ks03F==. & _outlierks03~=1
(0 real changes made)

->  replace ks03FA=medkecks03FA if ks03FA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03G=medkecks03G if ks03G==. & _outlierks03~=1
(0 real changes made)

->  replace ks03GA=medkecks03GA if ks03GA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03H=medkecks03H if ks03H==. & _outlierks03~=1
(0 real changes made)

->  replace ks03HA=medkecks03HA if ks03HA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03I=medkecks03I if ks03I==. & _outlierks03~=1
(0 real changes made)

->  replace ks03IA=medkecks03IA if ks03IA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03IB=medkecks03IB if ks03IB==. & _outlierks03~=1
(0 real changes made)

->  replace ks03J=medkecks03J if ks03J==. & _outlierks03~=1
(0 real changes made)

->  replace ks03K=medkecks03K if ks03K==. & _outlierks03~=1
(0 real changes made)

->  replace ks03L=medkecks03L if ks03L==. & _outlierks03~=1
(0 real changes made)

->  replace ks03M=medkecks03M if ks03M==. & _outlierks03~=1
(0 real changes made)

->  replace ks03N=medkecks03N if ks03N==. & _outlierks03~=1
(0 real changes made)

->  replace ks03OA=medkecks03OA if ks03OA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03OB=medkecks03OB if ks03OB==. & _outlierks03~=1
(0 real changes made)

->  replace ks03P=medkecks03P if ks03P==. & _outlierks03~=1
(0 real changes made)

->  replace ks03Q=medkecks03Q if ks03Q==. & _outlierks03~=1
(0 real changes made)

->  replace ks03R=medkecks03R if ks03R==. & _outlierks03~=1
(0 real changes made)

->  replace ks03S=medkecks03S if ks03S==. & _outlierks03~=1
(0 real changes made)

->  replace ks03T=medkecks03T if ks03T==. & _outlierks03~=1
(0 real changes made)

->  replace ks03U=medkecks03U if ks03U==. & _outlierks03~=1
(0 real changes made)

->  replace ks03V=medkecks03V if ks03V==. & _outlierks03~=1
(0 real changes made)

->  replace ks03W=medkecks03W if ks03W==. & _outlierks03~=1
(0 real changes made)

->  replace ks03X=medkecks03X if ks03X==. & _outlierks03~=1
(0 real changes made)

->  replace ks03Y=medkecks03Y if ks03Y==. & _outlierks03~=1
(0 real changes made)

->  replace ks03Z=medkecks03Z if ks03Z==. & _outlierks03~=1
(0 real changes made)

. for var ks03*: replace X=medkabX if X==. & _outlierks03~=1  ;

->  replace ks03A=medkabks03A if ks03A==. & _outlierks03~=1
(0 real changes made)

->  replace ks03AA=medkabks03AA if ks03AA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03B=medkabks03B if ks03B==. & _outlierks03~=1
(0 real changes made)

->  replace ks03BA=medkabks03BA if ks03BA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03C=medkabks03C if ks03C==. & _outlierks03~=1
(0 real changes made)

->  replace ks03CA=medkabks03CA if ks03CA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03D=medkabks03D if ks03D==. & _outlierks03~=1
(0 real changes made)

->  replace ks03DA=medkabks03DA if ks03DA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03E=medkabks03E if ks03E==. & _outlierks03~=1
(0 real changes made)

->  replace ks03EA=medkabks03EA if ks03EA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03F=medkabks03F if ks03F==. & _outlierks03~=1
(0 real changes made)

->  replace ks03FA=medkabks03FA if ks03FA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03G=medkabks03G if ks03G==. & _outlierks03~=1
(0 real changes made)

->  replace ks03GA=medkabks03GA if ks03GA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03H=medkabks03H if ks03H==. & _outlierks03~=1
(0 real changes made)

->  replace ks03HA=medkabks03HA if ks03HA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03I=medkabks03I if ks03I==. & _outlierks03~=1
(0 real changes made)

->  replace ks03IA=medkabks03IA if ks03IA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03IB=medkabks03IB if ks03IB==. & _outlierks03~=1
(0 real changes made)

->  replace ks03J=medkabks03J if ks03J==. & _outlierks03~=1
(0 real changes made)

->  replace ks03K=medkabks03K if ks03K==. & _outlierks03~=1
(0 real changes made)

->  replace ks03L=medkabks03L if ks03L==. & _outlierks03~=1
(0 real changes made)

->  replace ks03M=medkabks03M if ks03M==. & _outlierks03~=1
(0 real changes made)

->  replace ks03N=medkabks03N if ks03N==. & _outlierks03~=1
(0 real changes made)

->  replace ks03OA=medkabks03OA if ks03OA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03OB=medkabks03OB if ks03OB==. & _outlierks03~=1
(0 real changes made)

->  replace ks03P=medkabks03P if ks03P==. & _outlierks03~=1
(0 real changes made)

->  replace ks03Q=medkabks03Q if ks03Q==. & _outlierks03~=1
(0 real changes made)

->  replace ks03R=medkabks03R if ks03R==. & _outlierks03~=1
(0 real changes made)

->  replace ks03S=medkabks03S if ks03S==. & _outlierks03~=1
(0 real changes made)

->  replace ks03T=medkabks03T if ks03T==. & _outlierks03~=1
(0 real changes made)

->  replace ks03U=medkabks03U if ks03U==. & _outlierks03~=1
(0 real changes made)

->  replace ks03V=medkabks03V if ks03V==. & _outlierks03~=1
(0 real changes made)

->  replace ks03W=medkabks03W if ks03W==. & _outlierks03~=1
(0 real changes made)

->  replace ks03X=medkabks03X if ks03X==. & _outlierks03~=1
(0 real changes made)

->  replace ks03Y=medkabks03Y if ks03Y==. & _outlierks03~=1
(0 real changes made)

->  replace ks03Z=medkabks03Z if ks03Z==. & _outlierks03~=1
(0 real changes made)

. for var ks*: replace X=medcomX if origX==. & X==.  ;

->  replace ks02A=medcomks02A if origks02A==. & ks02A==.
(8 real changes made)

->  replace ks02AA=medcomks02AA if origks02AA==. & ks02AA==.
(17 real changes made)

->  replace ks02B=medcomks02B if origks02B==. & ks02B==.
(6 real changes made)

->  replace ks02BA=medcomks02BA if origks02BA==. & ks02BA==.
(10 real changes made)

->  replace ks02C=medcomks02C if origks02C==. & ks02C==.
(9 real changes made)

->  replace ks02CA=medcomks02CA if origks02CA==. & ks02CA==.
(15 real changes made)

->  replace ks02D=medcomks02D if origks02D==. & ks02D==.
(7 real changes made)

->  replace ks02DA=medcomks02DA if origks02DA==. & ks02DA==.
(8 real changes made)

->  replace ks02E=medcomks02E if origks02E==. & ks02E==.
(10 real changes made)

->  replace ks02EA=medcomks02EA if origks02EA==. & ks02EA==.
(11 real changes made)

->  replace ks02F=medcomks02F if origks02F==. & ks02F==.
(14 real changes made)

->  replace ks02FA=medcomks02FA if origks02FA==. & ks02FA==.
(12 real changes made)

->  replace ks02G=medcomks02G if origks02G==. & ks02G==.
(9 real changes made)

->  replace ks02GA=medcomks02GA if origks02GA==. & ks02GA==.
(8 real changes made)

->  replace ks02H=medcomks02H if origks02H==. & ks02H==.
(17 real changes made)

->  replace ks02HA=medcomks02HA if origks02HA==. & ks02HA==.
(38 real changes made)

->  replace ks02I=medcomks02I if origks02I==. & ks02I==.
(14 real changes made)

->  replace ks02IA=medcomks02IA if origks02IA==. & ks02IA==.
(19 real changes made)

->  replace ks02IB=medcomks02IB if origks02IB==. & ks02IB==.
(21 real changes made)

->  replace ks02J=medcomks02J if origks02J==. & ks02J==.
(15 real changes made)

->  replace ks02K=medcomks02K if origks02K==. & ks02K==.
(10 real changes made)

->  replace ks02L=medcomks02L if origks02L==. & ks02L==.
(14 real changes made)

->  replace ks02M=medcomks02M if origks02M==. & ks02M==.
(12 real changes made)

->  replace ks02N=medcomks02N if origks02N==. & ks02N==.
(12 real changes made)

->  replace ks02OA=medcomks02OA if origks02OA==. & ks02OA==.
(7 real changes made)

->  replace ks02OB=medcomks02OB if origks02OB==. & ks02OB==.
(13 real changes made)

->  replace ks02P=medcomks02P if origks02P==. & ks02P==.
(12 real changes made)

->  replace ks02Q=medcomks02Q if origks02Q==. & ks02Q==.
(14 real changes made)

->  replace ks02R=medcomks02R if origks02R==. & ks02R==.
(16 real changes made)

->  replace ks02S=medcomks02S if origks02S==. & ks02S==.
(13 real changes made)

->  replace ks02T=medcomks02T if origks02T==. & ks02T==.
(13 real changes made)

->  replace ks02U=medcomks02U if origks02U==. & ks02U==.
(8 real changes made)

->  replace ks02V=medcomks02V if origks02V==. & ks02V==.
(24 real changes made)

->  replace ks02W=medcomks02W if origks02W==. & ks02W==.
(12 real changes made)

->  replace ks02X=medcomks02X if origks02X==. & ks02X==.
(6 real changes made)

->  replace ks02Y=medcomks02Y if origks02Y==. & ks02Y==.
(14 real changes made)

->  replace ks02Z=medcomks02Z if origks02Z==. & ks02Z==.
(5 real changes made)

->  replace ks03A=medcomks03A if origks03A==. & ks03A==.
(12 real changes made)

->  replace ks03AA=medcomks03AA if origks03AA==. & ks03AA==.
(10 real changes made)

->  replace ks03B=medcomks03B if origks03B==. & ks03B==.
(7 real changes made)

->  replace ks03BA=medcomks03BA if origks03BA==. & ks03BA==.
(9 real changes made)

->  replace ks03C=medcomks03C if origks03C==. & ks03C==.
(8 real changes made)

->  replace ks03CA=medcomks03CA if origks03CA==. & ks03CA==.
(12 real changes made)

->  replace ks03D=medcomks03D if origks03D==. & ks03D==.
(9 real changes made)

->  replace ks03DA=medcomks03DA if origks03DA==. & ks03DA==.
(8 real changes made)

->  replace ks03E=medcomks03E if origks03E==. & ks03E==.
(8 real changes made)

->  replace ks03EA=medcomks03EA if origks03EA==. & ks03EA==.
(10 real changes made)

->  replace ks03F=medcomks03F if origks03F==. & ks03F==.
(13 real changes made)

->  replace ks03FA=medcomks03FA if origks03FA==. & ks03FA==.
(10 real changes made)

->  replace ks03G=medcomks03G if origks03G==. & ks03G==.
(8 real changes made)

->  replace ks03GA=medcomks03GA if origks03GA==. & ks03GA==.
(7 real changes made)

->  replace ks03H=medcomks03H if origks03H==. & ks03H==.
(17 real changes made)

->  replace ks03HA=medcomks03HA if origks03HA==. & ks03HA==.
(10 real changes made)

->  replace ks03I=medcomks03I if origks03I==. & ks03I==.
(6 real changes made)

->  replace ks03IA=medcomks03IA if origks03IA==. & ks03IA==.
(18 real changes made)

->  replace ks03IB=medcomks03IB if origks03IB==. & ks03IB==.
(9 real changes made)

->  replace ks03J=medcomks03J if origks03J==. & ks03J==.
(13 real changes made)

->  replace ks03K=medcomks03K if origks03K==. & ks03K==.
(7 real changes made)

->  replace ks03L=medcomks03L if origks03L==. & ks03L==.
(9 real changes made)

->  replace ks03M=medcomks03M if origks03M==. & ks03M==.
(10 real changes made)

->  replace ks03N=medcomks03N if origks03N==. & ks03N==.
(7 real changes made)

->  replace ks03OA=medcomks03OA if origks03OA==. & ks03OA==.
(6 real changes made)

->  replace ks03OB=medcomks03OB if origks03OB==. & ks03OB==.
(7 real changes made)

->  replace ks03P=medcomks03P if origks03P==. & ks03P==.
(11 real changes made)

->  replace ks03Q=medcomks03Q if origks03Q==. & ks03Q==.
(10 real changes made)

->  replace ks03R=medcomks03R if origks03R==. & ks03R==.
(9 real changes made)

->  replace ks03S=medcomks03S if origks03S==. & ks03S==.
(9 real changes made)

->  replace ks03T=medcomks03T if origks03T==. & ks03T==.
(7 real changes made)

->  replace ks03U=medcomks03U if origks03U==. & ks03U==.
(7 real changes made)

->  replace ks03V=medcomks03V if origks03V==. & ks03V==.
(11 real changes made)

->  replace ks03W=medcomks03W if origks03W==. & ks03W==.
(7 real changes made)

->  replace ks03X=medcomks03X if origks03X==. & ks03X==.
(5 real changes made)

->  replace ks03Y=medcomks03Y if origks03Y==. & ks03Y==.
(11 real changes made)

->  replace ks03Z=medcomks03Z if origks03Z==. & ks03Z==.
(8 real changes made)

. for var ks02*: replace X=. if _outlierks02==1  ;

->  replace ks02A=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02AA=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02B=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02BA=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02C=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02CA=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02D=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02DA=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02E=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02EA=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02F=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02FA=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02G=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02GA=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02H=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02HA=. if _outlierks02==1
(127 real changes made, 127 to missing)

->  replace ks02I=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02IA=. if _outlierks02==1
(131 real changes made, 131 to missing)

->  replace ks02IB=. if _outlierks02==1
(133 real changes made, 133 to missing)

->  replace ks02J=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02K=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02L=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02M=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02N=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02OA=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02OB=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02P=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02Q=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02R=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02S=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02T=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02U=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02V=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02W=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02X=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02Y=. if _outlierks02==1
(134 real changes made, 134 to missing)

->  replace ks02Z=. if _outlierks02==1
(134 real changes made, 134 to missing)

. for var ks03*: replace X=. if _outlierks03==1  ;

->  replace ks03A=. if _outlierks03==1
(88 real changes made, 88 to missing)

->  replace ks03AA=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03B=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03BA=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03C=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03CA=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03D=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03DA=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03E=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03EA=. if _outlierks03==1
(88 real changes made, 88 to missing)

->  replace ks03F=. if _outlierks03==1
(88 real changes made, 88 to missing)

->  replace ks03FA=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03G=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03GA=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03H=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03HA=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03I=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03IA=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03IB=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03J=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03K=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03L=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03M=. if _outlierks03==1
(88 real changes made, 88 to missing)

->  replace ks03N=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03OA=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03OB=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03P=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03Q=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03R=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03S=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03T=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03U=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03V=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03W=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03X=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03Y=. if _outlierks03==1
(89 real changes made, 89 to missing)

->  replace ks03Z=. if _outlierks03==1
(88 real changes made, 88 to missing)

. ********************************************************************** 
> 
> 
> * III.6. Generate total  ;
. gen sumks02=ks02A+ks02AA+ks02B+ks02BA+ks02C+ks02CA+ks02D+ks02DA+ks02E+ks02EA+ks02F+ks02FA+ks02G+ks02GA /* ;
> */ +ks02H+ ks02HA+ks02I+ks02IA+ks02IB+ ks02J+ks02K+ks02L+ks02M+ks02N+ks02OA+ks02OB+ks02P+ks02Q+ks02S /* ;
> */ +ks02R+ks02T+ks02U+ks02V+ks02W+ks02X+ks02Y+ks02Z  ;
(134 missing values generated)

. gen sumks03=ks03A+ks03AA+ks03B+ks03BA+ks03C+ks03CA+ks03D+ks03DA+ks03E+ks03EA+ks03F+ks03FA+ks03G+ks03GA /*   ;
> */ +ks03H+ ks03HA+ ks03I+ ks03IA+ks03IB+ ks03J+ks03K+ks03L+ks03M+ks03N+ks03OA+ks03OB+ks03P+ks03Q+ks03S  /* ;
> */ +ks03R+ks03T+ks03U+ks03V+ks03W+ks03X+ks03Y+ks03Z  ;
(89 missing values generated)

. * III.7 Generate variable containing information on missing values in this data file   ;
. **************************************************************************** 
> capture drop missks02  ;
. capture drop missks03  ;

. gen missks02=(sumks02==.)  ;

. gen missks03=(sumks03==.)  ;

. lab var missks02 "Household w/ at least 1 KS02 missing"  ;

. lab var missks03 "Household w/ at least 1 KS03 missing"  ;

. tab1 miss*  ;

-> tabulation of missks02  

  Household |
w/ at least |
     1 KS02 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,843       98.97       98.97
          1 |        134        1.03      100.00
------------+-----------------------------------
      Total |     12,977      100.00

-> tabulation of missks03  

  Household |
w/ at least |
     1 KS03 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,888       99.31       99.31
          1 |         89        0.69      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. * III.8 Label, sort, save the data  ;
. ****************************************************************************  ;
. sort hhid07   ;

. capture drop med* origk* sum*  ;

. compress  ;
provid07 was float now byte
origea07 was float now byte
rural was float now byte
_outlierks was float now byte
_outlierks02 was float now byte
_outlierks03 was float now byte
ks03D was long now int
ks03R was long now int
ks03S was long now int
missks02 was float now byte
missks03 was float now byte
kabid07 was double now int
kecid07 was double now long

. label data "Wide version of b1_ks1, with imputation"  ;

. save $dir0\b1_ks107, replace  ;
file E:\PCE\temp\\b1_ks107.dta saved

. ********************************************************************************  ;
. * IV. KS06 (B1_KS2.DTA)  ;
. ********************************************************************************  ;
. * IV.1 Identify outliers  ;
. ****************************************************************************  ;
. use hhid07 ks2type ks06 using $dir7\b1_ks2, clear  ;

. bys hhid07 ks2type: keep if _n==_N ;
(0 observations deleted)

. format ks06 %16.0f ;

. replace ks06=. if ks06>=99999995 ;
(398 real changes made, 398 to missing)

. gen  z=0  ;

. replace z=1 if ks06>=9100000 & ks2type=="C1" ;
(14 real changes made)

. replace z=1 if ks06>=6100000 & ks2type=="D" ;
(29 real changes made)

. replace z=1 if ks06>=9000000 & ks2type=="E" ;
(77 real changes made)

. replace z=1 if ks06>=7000000 & ks2type=="F2" ;
(22 real changes made)

. replace z=1 if ks06>=15000000 & ks2type=="G" ;
(32 real changes made)

. *replace ks06=. if z==1 ;
. bys hhid07: egen _outlierks06=max(z)  ;

. drop z ;

. lab var _outlierks06 "Any outlier in ks06" ;

.  tab _outlierks06  ;

Any outlier |
    in ks06 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    154,428       99.17       99.17
          1 |      1,296        0.83      100.00
------------+-----------------------------------
      Total |    155,724      100.00

. sort hhid07  ;

. compress  ;
_outlierks06 was float now byte

. * IV.2. Generate variable containing information on missing values in this data file   ;
. ****************************************************************************  ;
. gen   x=1 if ks06==.  ;
(155326 missing values generated)

. replace x=0 if ks2type=="F2" ;
(12977 real changes made)

.  replace x=0 if x==.   ;
(142370 real changes made)

. egen   missks06=max(x), by(hhid07) ;

.  lab var missks06 "Household w/ at least 1 KS06 missing, excl. F2"  ;

. compress  ;
x was float now byte
missks06 was float now byte

. drop x  ;

. * IV.3. Reshape b1_ks2.dta from long to wide  ;
. ****************************************************************************  ;
. reshape wide ks06, i(hhid07) j(ks2type) string  ;
(note: j = A1 A2 A3 A4 B C C1 D E F1 F2 G)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   155724   ->   12977
Number of variables                   5   ->      15
j variable (12 values)          ks2type   ->   (dropped)
xij variables:
                                   ks06   ->   ks06A1 ks06A2 ... ks06G
-----------------------------------------------------------------------------

. tab missks06  ;

  Household |
w/ at least |
     1 KS06 |
   missing, |
   excl. F2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,794       98.59       98.59
          1 |        183        1.41      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. sort hhid07  ;

. compress  ;

. label data "Wide version of b1_ks2"  ;

. save $dir0\b1_ks207_wide, replace  ;
file E:\PCE\temp\\b1_ks207_wide.dta saved

.  * IV.5. Merge with commid, kecid, kabid info  ;
. ****************************************************************************  ;
. use hhid* kecid kabid commid07 rural origea using $dir0\sc07, clear  ;

. sort hhid07  ;

. merge hhid07 using $dir0\b1_ks207_wide  ;

. tab _merge  ;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        559        4.13        4.13
          3 |     12,977       95.87      100.00
------------+-----------------------------------
      Total |     13,536      100.00

. *Only keep HHs which answered Book 1  ;
. keep if _merge==3  ;
(559 observations deleted)

. drop _merge  ;

. inspect ks06*  ;

ks06A1:  A1 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            2179      2179          -
|  #                         Positive       10767     10767          -
|  #                                        -----     -----      -----
|  #                         Total          12946     12946          -
|  #   .   .   .   .         Missing           31
+----------------------                     -----
0               3400000                     12977
(More than 99 unique values)

ks06A2:  A2 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            9887      9887          -
|  #                         Positive        3066      3066          -
|  #                                        -----     -----      -----
|  #                         Total          12953     12953          -
|  #   .   .   .   .         Missing           24
+----------------------                     -----
0               3000000                     12977
(More than 99 unique values)

ks06A3:  A3 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            2348      2348          -
|  #                         Positive       10613     10613          -
|  #                                        -----     -----      -----
|  #                         Total          12961     12961          -
|  #   .   .   .   .         Missing           16
+----------------------                     -----
0               2420000                     12977
(More than 99 unique values)

ks06A4:  A4 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            5755      5755          -
|  #                         Positive        7139      7139          -
|  #                                        -----     -----      -----
|  #                         Total          12894     12894          -
|  #   .   .   .   .         Missing           83
+----------------------                     -----
0               3675000                     12977
(More than 99 unique values)

ks06B:  B ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero             435       435          -
|  #                         Positive       12509     12509          -
|  #                                        -----     -----      -----
|  #                         Total          12944     12944          -
|  #   .   .   .   .         Missing           33
+----------------------                     -----
0               2000000                     12977
(More than 99 unique values)

ks06C:  C ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero             741       741          -
|  #                         Positive       12206     12206          -
|  #                                        -----     -----      -----
|  #                         Total          12947     12947          -
|  #   .   .   .   .         Missing           30
+----------------------                     -----
0               2250000                     12977
(More than 99 unique values)

ks06C1:  C1 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           11776     11776          -
|  #                         Positive        1188      1188          -
|  #                                        -----     -----      -----
|  #                         Total          12964     12964          -
|  #   .   .   .   .         Missing           13
+----------------------                     -----
0              1.00e+07                     12977
(More than 99 unique values)

ks06D:  D ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           10827     10827          -
|  #                         Positive        2123      2123          -
|  #                                        -----     -----      -----
|  #                         Total          12950     12950          -
|  #   .   .   .   .         Missing           27
+----------------------                     -----
0              1.00e+07                     12977
(More than 99 unique values)

ks06E:  E ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            3857      3857          -
|  #                         Positive        9045      9045          -
|  #                                        -----     -----      -----
|  #                         Total          12902     12902          -
|  #   .   .   .   .         Missing           75
+----------------------                     -----
0              1.12e+07                     12977
(More than 99 unique values)

ks06F1:  F1 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           12820     12820          -
|  #                         Positive         141       141          -
|  #                                        -----     -----      -----
|  #                         Total          12961     12961          -
|  #   .   .   .   .         Missing           16
+----------------------                     -----
0               3000000                     12977
  (49 unique values)

ks06F2:  F2 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            8147      8147          -
|  #                         Positive        4809      4809          -
|  #                                        -----     -----      -----
|  #                         Total          12956     12956          -
|  #   .   .   .   .         Missing           21
+----------------------                     -----
0              1.20e+07                     12977
(More than 99 unique values)

ks06G:  G ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           10274     10274          -
|  #                         Positive        2674      2674          -
|  #                                        -----     -----      -----
|  #                         Total          12948     12948          -
|  #   .   .   .   .         Missing           29
+----------------------                     -----
0              3.12e+07                     12977
(More than 99 unique values)

. * IV.5. Generate median variables  ;
. ****************************************************************************  ;
. for var ks*:  egen medcomX=median(X), by(commid07)  ;

->  egen medcomks06A1=median(ks06A1), by(commid07)
(2 missing values generated)

->  egen medcomks06A2=median(ks06A2), by(commid07)
(1 missing value generated)

->  egen medcomks06A3=median(ks06A3), by(commid07)
(1 missing value generated)

->  egen medcomks06A4=median(ks06A4), by(commid07)
(5 missing values generated)

->  egen medcomks06B=median(ks06B), by(commid07)

->  egen medcomks06C=median(ks06C), by(commid07)

->  egen medcomks06C1=median(ks06C1), by(commid07)

->  egen medcomks06D=median(ks06D), by(commid07)
(1 missing value generated)

->  egen medcomks06E=median(ks06E), by(commid07)
(3 missing values generated)

->  egen medcomks06F1=median(ks06F1), by(commid07)

->  egen medcomks06F2=median(ks06F2), by(commid07)

->  egen medcomks06G=median(ks06G), by(commid07)
(1 missing value generated)

. for var ks*:  egen medkecX=median(X), by(kecid)  ;

->  egen medkecks06A1=median(ks06A1), by(kecid)
(2 missing values generated)

->  egen medkecks06A2=median(ks06A2), by(kecid)
(1 missing value generated)

->  egen medkecks06A3=median(ks06A3), by(kecid)
(1 missing value generated)

->  egen medkecks06A4=median(ks06A4), by(kecid)
(5 missing values generated)

->  egen medkecks06B=median(ks06B), by(kecid)

->  egen medkecks06C=median(ks06C), by(kecid)

->  egen medkecks06C1=median(ks06C1), by(kecid)

->  egen medkecks06D=median(ks06D), by(kecid)
(1 missing value generated)

->  egen medkecks06E=median(ks06E), by(kecid)
(3 missing values generated)

->  egen medkecks06F1=median(ks06F1), by(kecid)

->  egen medkecks06F2=median(ks06F2), by(kecid)

->  egen medkecks06G=median(ks06G), by(kecid)
(1 missing value generated)

. for var ks*:  egen medkabX=median(X), by(kabid)  ;

->  egen medkabks06A1=median(ks06A1), by(kabid)

->  egen medkabks06A2=median(ks06A2), by(kabid)

->  egen medkabks06A3=median(ks06A3), by(kabid)

->  egen medkabks06A4=median(ks06A4), by(kabid)

->  egen medkabks06B=median(ks06B), by(kabid)

->  egen medkabks06C=median(ks06C), by(kabid)

->  egen medkabks06C1=median(ks06C1), by(kabid)

->  egen medkabks06D=median(ks06D), by(kabid)

->  egen medkabks06E=median(ks06E), by(kabid)

->  egen medkabks06F1=median(ks06F1), by(kabid)

->  egen medkabks06F2=median(ks06F2), by(kabid)

->  egen medkabks06G=median(ks06G), by(kabid)

. compress   ;
origea07 was float now byte
rural was float now byte
medkabks06F1 was float now byte
kabid07 was double now int
kecid07 was double now long

. * IV.6. Imputation  ;
. ****************************************************************************  ;
. for var ks*: gen origX=X  ;

->  gen origks06A1=ks06A1
(31 missing values generated)

->  gen origks06A2=ks06A2
(24 missing values generated)

->  gen origks06A3=ks06A3
(16 missing values generated)

->  gen origks06A4=ks06A4
(83 missing values generated)

->  gen origks06B=ks06B
(33 missing values generated)

->  gen origks06C=ks06C
(30 missing values generated)

->  gen origks06C1=ks06C1
(13 missing values generated)

->  gen origks06D=ks06D
(27 missing values generated)

->  gen origks06E=ks06E
(75 missing values generated)

->  gen origks06F1=ks06F1
(16 missing values generated)

->  gen origks06F2=ks06F2
(21 missing values generated)

->  gen origks06G=ks06G
(29 missing values generated)

. for var ks*: replace X=medcomX if X==. & origea==1  & _outlierks06~=1  ;

->  replace ks06A1=medcomks06A1 if ks06A1==. & origea==1 & _outlierks06~=1
(9 real changes made)

->  replace ks06A2=medcomks06A2 if ks06A2==. & origea==1 & _outlierks06~=1
(4 real changes made)

->  replace ks06A3=medcomks06A3 if ks06A3==. & origea==1 & _outlierks06~=1
(3 real changes made)

->  replace ks06A4=medcomks06A4 if ks06A4==. & origea==1 & _outlierks06~=1
(33 real changes made)

->  replace ks06B=medcomks06B if ks06B==. & origea==1 & _outlierks06~=1
(8 real changes made)

->  replace ks06C=medcomks06C if ks06C==. & origea==1 & _outlierks06~=1
(6 real changes made)

->  replace ks06C1=medcomks06C1 if ks06C1==. & origea==1 & _outlierks06~=1
(0 real changes made)

->  replace ks06D=medcomks06D if ks06D==. & origea==1 & _outlierks06~=1
(0 real changes made)

->  replace ks06E=medcomks06E if ks06E==. & origea==1 & _outlierks06~=1
(0 real changes made)

->  replace ks06F1=medcomks06F1 if ks06F1==. & origea==1 & _outlierks06~=1
(1 real change made)

->  replace ks06F2=medcomks06F2 if ks06F2==. & origea==1 & _outlierks06~=1
(0 real changes made)

->  replace ks06G=medcomks06G if ks06G==. & origea==1 & _outlierks06~=1
(0 real changes made)

. for var ks*: replace X=medkecX if X==. & _outlierks06~=1  ;

->  replace ks06A1=medkecks06A1 if ks06A1==. & _outlierks06~=1
(9 real changes made)

->  replace ks06A2=medkecks06A2 if ks06A2==. & _outlierks06~=1
(9 real changes made)

->  replace ks06A3=medkecks06A3 if ks06A3==. & _outlierks06~=1
(3 real changes made)

->  replace ks06A4=medkecks06A4 if ks06A4==. & _outlierks06~=1
(12 real changes made)

->  replace ks06B=medkecks06B if ks06B==. & _outlierks06~=1
(5 real changes made)

->  replace ks06C=medkecks06C if ks06C==. & _outlierks06~=1
(5 real changes made)

->  replace ks06C1=medkecks06C1 if ks06C1==. & _outlierks06~=1
(0 real changes made)

->  replace ks06D=medkecks06D if ks06D==. & _outlierks06~=1
(0 real changes made)

->  replace ks06E=medkecks06E if ks06E==. & _outlierks06~=1
(0 real changes made)

->  replace ks06F1=medkecks06F1 if ks06F1==. & _outlierks06~=1
(0 real changes made)

->  replace ks06F2=medkecks06F2 if ks06F2==. & _outlierks06~=1
(0 real changes made)

->  replace ks06G=medkecks06G if ks06G==. & _outlierks06~=1
(0 real changes made)

. for var ks*: replace X=medkabX if X==. & _outlierks06~=1  ;

->  replace ks06A1=medkabks06A1 if ks06A1==. & _outlierks06~=1
(2 real changes made)

->  replace ks06A2=medkabks06A2 if ks06A2==. & _outlierks06~=1
(1 real change made)

->  replace ks06A3=medkabks06A3 if ks06A3==. & _outlierks06~=1
(1 real change made)

->  replace ks06A4=medkabks06A4 if ks06A4==. & _outlierks06~=1
(3 real changes made)

->  replace ks06B=medkabks06B if ks06B==. & _outlierks06~=1
(0 real changes made)

->  replace ks06C=medkabks06C if ks06C==. & _outlierks06~=1
(0 real changes made)

->  replace ks06C1=medkabks06C1 if ks06C1==. & _outlierks06~=1
(0 real changes made)

->  replace ks06D=medkabks06D if ks06D==. & _outlierks06~=1
(0 real changes made)

->  replace ks06E=medkabks06E if ks06E==. & _outlierks06~=1
(0 real changes made)

->  replace ks06F1=medkabks06F1 if ks06F1==. & _outlierks06~=1
(0 real changes made)

->  replace ks06F2=medkabks06F2 if ks06F2==. & _outlierks06~=1
(0 real changes made)

->  replace ks06G=medkabks06G if ks06G==. & _outlierks06~=1
(0 real changes made)

. for var ks06*: replace X=medcomX if origX==. & X==.  ;

->  replace ks06A1=medcomks06A1 if origks06A1==. & ks06A1==.
(11 real changes made)

->  replace ks06A2=medcomks06A2 if origks06A2==. & ks06A2==.
(10 real changes made)

->  replace ks06A3=medcomks06A3 if origks06A3==. & ks06A3==.
(9 real changes made)

->  replace ks06A4=medcomks06A4 if origks06A4==. & ks06A4==.
(33 real changes made)

->  replace ks06B=medcomks06B if origks06B==. & ks06B==.
(20 real changes made)

->  replace ks06C=medcomks06C if origks06C==. & ks06C==.
(19 real changes made)

->  replace ks06C1=medcomks06C1 if origks06C1==. & ks06C1==.
(13 real changes made)

->  replace ks06D=medcomks06D if origks06D==. & ks06D==.
(26 real changes made)

->  replace ks06E=medcomks06E if origks06E==. & ks06E==.
(72 real changes made)

->  replace ks06F1=medcomks06F1 if origks06F1==. & ks06F1==.
(15 real changes made)

->  replace ks06F2=medcomks06F2 if origks06F2==. & ks06F2==.
(21 real changes made)

->  replace ks06G=medcomks06G if origks06G==. & ks06G==.
(28 real changes made)

. for var ks06*: replace X=. if _outlierks06==1  ;

->  replace ks06A1=. if _outlierks06==1
(108 real changes made, 108 to missing)

->  replace ks06A2=. if _outlierks06==1
(108 real changes made, 108 to missing)

->  replace ks06A3=. if _outlierks06==1
(108 real changes made, 108 to missing)

->  replace ks06A4=. if _outlierks06==1
(106 real changes made, 106 to missing)

->  replace ks06B=. if _outlierks06==1
(108 real changes made, 108 to missing)

->  replace ks06C=. if _outlierks06==1
(108 real changes made, 108 to missing)

->  replace ks06C1=. if _outlierks06==1
(108 real changes made, 108 to missing)

->  replace ks06D=. if _outlierks06==1
(107 real changes made, 107 to missing)

->  replace ks06E=. if _outlierks06==1
(105 real changes made, 105 to missing)

->  replace ks06F1=. if _outlierks06==1
(108 real changes made, 108 to missing)

->  replace ks06F2=. if _outlierks06==1
(108 real changes made, 108 to missing)

->  replace ks06G=. if _outlierks06==1
(107 real changes made, 107 to missing)

. ********** END OF THE 'MANUAL' IMPUTATION OF KS06************************************************************  ;
. * IV.7 Generate variable containing information on missing values in this data file   ;
. ****************************************************************************  ;
. capture drop missks06 ;

. gen ks06A=ks06A1+ks06A2+ks06A3+ks06A4  ;
(108 missing values generated)

. gen sumks06=ks06A+ks06B+ks06C+ks06C1+ks06D+ks06E+ks06F1+ks06G  ;
(108 missing values generated)

. gen missks06=(sumks06==.)  ;

. lab var missks06 "Household w/ at least 1 KS06 missing -excluding F2"  ;

. tab missks06  ;

  Household |
w/ at least |
     1 KS06 |
    missing |
 -excluding |
         F2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,869       99.17       99.17
          1 |        108        0.83      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. * IV.8. save the data ;
. ****************************************************************************  ;
. compress  ;
missks06 was float now byte

. capture drop origk* med* sumks  ;

. sort hhid07 ;

. save $dir0\b1_ks207, replace  ;
file E:\PCE\temp\\b1_ks207.dta saved

. ********************************************************************************  ;
. * V. KS08, KS09a,  (B1_KS3.DTA)  ;
. ********************************************************************************  ;
. * V.1. Identify outliers  ;
. ****************************************************************************  ;
. use ks08 ks09a ks3type hhid07 using $dir7\b1_ks3, clear  ;

. bys hhid07 ks3type: keep if _n==_N ;
(0 observations deleted)

. replace ks08=. if ks08>=98989998 ;
(444 real changes made, 444 to missing)

. replace ks09a=. if ks09a>=98998998 ;
(150 real changes made, 150 to missing)

. sort hhid07 ks3type  ;

. gen     _z=1 if ks08>12000000 & ks08~=.  & ks3type=="A" ;
(90834 missing values generated)

. replace _z=1 if ks08>13500000 & ks08~=.  & ks3type=="B" ;
(6 real changes made)

. replace _z=1 if ks08>30000000 & ks08~=.  & ks3type=="C" ;
(9 real changes made)

. replace _z=1 if ks08>41000000 & ks08~=.  & ks3type=="D" ;
(6 real changes made)

. replace _z=1 if ks08>10300000 & ks08~=.  & ks3type=="E" ;
(2 real changes made)

. replace _z=1 if ks08>81000000 & ks08~=.  & ks3type=="F" ;
(4 real changes made)

. replace _z=1 if ks08>17000000 & ks08~=.  & ks3type=="G" ;
(2 real changes made)

. gen     _x=1 if ks09>5000000 & ks09~=.  & ks3type=="A" ;
(90836 missing values generated)

. replace _x=1 if ks09>3160000 & ks09~=.  & ks3type=="B" ;
(1 real change made)

. replace _x=1 if ks09>30000000 & ks09~=.  & ks3type=="C" ;
(1 real change made)

. replace _x=1 if ks09>20000000 & ks09~=.  & ks3type=="D" ;
(2 real changes made)

. replace _x=1 if ks09>28000000 & ks09~=.  & ks3type=="F" ;
(2 real changes made)

. replace ks08=. if _z==1 ;
(34 real changes made, 34 to missing)

. replace ks09=. if _x==1 ;
(9 real changes made, 9 to missing)

. bys hhid: egen _outlierks08=max(_z) ;
(90601 missing values generated)

. bys hhid: egen _outlierks09=max(_x) ;
(90776 missing values generated)

. mvencode _outlierks08, mv(0) ;
_outlierks08: 90601 missing values recoded

. mvencode _outlierks09, mv(0) ;
_outlierks09: 90776 missing values recoded

. drop _x _z ;

. sort hhid07  ;

. compress  ;
_outlierks08 was float now byte
_outlierks09 was float now byte

. lab var _outlierks08 "Any outlier in ks08"  ;

. lab var _outlierks09 "Any outlier in ks09"  ;

. tab1 _outlier*  ;

-> tabulation of _outlierks08  

Any outlier |
    in ks08 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,601       99.74       99.74
          1 |        238        0.26      100.00
------------+-----------------------------------
      Total |     90,839      100.00

-> tabulation of _outlierks09  

Any outlier |
    in ks09 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,776       99.93       99.93
          1 |         63        0.07      100.00
------------+-----------------------------------
      Total |     90,839      100.00

. compress  ;

. *V.2. Reshape b1_ks3.dta from long to wide  ;
. ****************************************************************************  ;
. reshape wide ks08 ks09a, i(hhid07 ) j(ks3type) string  ;
(note: j = A B C D E F G)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    90839   ->   12977
Number of variables                   6   ->      17
j variable (7 values)           ks3type   ->   (dropped)
xij variables:
                                   ks08   ->   ks08A ks08B ... ks08G
                                  ks09a   ->   ks09aA ks09aB ... ks09aG
-----------------------------------------------------------------------------

. sort hhid07   ;

. compress  ;
ks09aE was long now byte
ks09aG was long now byte

. label data "Wide version of b1_ks3 created pre_pce.do"  ;

. save $dir0\b1_ks307_wide, replace  ;
file E:\PCE\temp\\b1_ks307_wide.dta saved

. *V.3 Merge with kecamatan ID information  ;
. ****************************************************************************  ;
. use $dir0\b1_ks307_wide, clear  ;
(Wide version of b1_ks3 created pre_pce.do)

. sort hhid07  ;

. save $dir0\tempks307, replace  ;
file E:\PCE\temp\\tempks307.dta saved

. use hhid*  commid07 kecid kabid origea rural using $dir0\sc07, clear  ;

. sort hhid07  ;

. merge hhid07 using $dir0\tempks307  ;

. tab _merge  ;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        559        4.13        4.13
          3 |     12,977       95.87      100.00
------------+-----------------------------------
      Total |     13,536      100.00

. *Only keep HHs which answered Book 2  ;
. keep if _merge==3  ;
(559 observations deleted)

. drop _merge  ;

. inspect ks*  ;

ks08A:  A ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            1426      1426          -
|  #                         Positive       11504     11504          -
|  #                                        -----     -----      -----
|  #                         Total          12930     12930          -
|  #   .   .   .   .         Missing           47
+----------------------                     -----
0              1.20e+07                     12977
(More than 99 unique values)

ks09aA:  A ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            8517      8517          -
|  #                         Positive        4403      4403          -
|  #                                        -----     -----      -----
|  #                         Total          12920     12920          -
|  #   .   .   .   .         Missing           57
+----------------------                     -----
0               5000000                     12977
(More than 99 unique values)

ks08B:  B ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            8561      8561          -
|  #                         Positive        4387      4387          -
|  #                                        -----     -----      -----
|  #                         Total          12948     12948          -
|  #   .   .   .   .         Missing           29
+----------------------                     -----
0              1.35e+07                     12977
(More than 99 unique values)

ks09aB:  B ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           12256     12256          -
|  #                         Positive         705       705          -
|  #                                        -----     -----      -----
|  #                         Total          12961     12961          -
|  #   .   .   .   .         Missing           16
+----------------------                     -----
0               3160000                     12977
  (81 unique values)

ks08C:  C ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            1919      1919          -
|  #                         Positive       10998     10998          -
|  #                                        -----     -----      -----
|  #                         Total          12917     12917          -
|  #   .   .   .   .         Missing           60
+----------------------                     -----
0              3.00e+07                     12977
(More than 99 unique values)

ks09aC:  C ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           12031     12031          -
|  #                         Positive         907       907          -
|  #                                        -----     -----      -----
|  #                         Total          12938     12938          -
|  #   .   .   .   .         Missing           39
+----------------------                     -----
0              3.00e+07                     12977
(More than 99 unique values)

ks08D:  D ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            1527      1527          -
|  #                         Positive       11359     11359          -
|  #                                        -----     -----      -----
|  #                         Total          12886     12886          -
|  #   .   .   .   .         Missing           91
+----------------------                     -----
0              4.03e+07                     12977
(More than 99 unique values)

ks09aD:  D ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           11799     11799          -
|  #                         Positive        1151      1151          -
|  #                                        -----     -----      -----
|  #                         Total          12950     12950          -
|  #   .   .   .   .         Missing           27
+----------------------                     -----
0              2.00e+07                     12977
(More than 99 unique values)

ks08E:  E ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            4125      4125          -
|  #                         Positive        8687      8687          -
|  #                                        -----     -----      -----
|  #                         Total          12812     12812          -
|  #   .   .   .   .         Missing          165
+----------------------                     -----
0              1.03e+07                     12977
(More than 99 unique values)

ks09aE:  E ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|                            Negative           -         -          -
|                            Zero               -         -          -
|                            Positive           -         -          -
|                                           -----     -----      -----
|                            Total              -         -          -
|                            Missing        12977
+----------------------                     -----
.             -9.0e+307                     12977
   (0 unique value)

ks08F:  F ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            9703      9703          -
|  #                         Positive        3220      3220          -
|  #                                        -----     -----      -----
|  #                         Total          12923     12923          -
|  #   .   .   .   .         Missing           54
+----------------------                     -----
0              8.05e+07                     12977
(More than 99 unique values)

ks09aF:  F ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           12614     12614          -
|  #                         Positive         343       343          -
|  #                                        -----     -----      -----
|  #                         Total          12957     12957          -
|  #   .   .   .   .         Missing           20
+----------------------                     -----
0              2.80e+07                     12977
  (92 unique values)

ks08G:  G ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           10878     10878          -
|  #                         Positive        2067      2067          -
|  #                                        -----     -----      -----
|  #                         Total          12945     12945          -
|  #   .   .   .   .         Missing           32
+----------------------                     -----
0              1.70e+07                     12977
(More than 99 unique values)

ks09aG:  G ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|                            Negative           -         -          -
|                            Zero               -         -          -
|                            Positive           -         -          -
|                                           -----     -----      -----
|                            Total              -         -          -
|                            Missing        12977
+----------------------                     -----
.             -9.0e+307                     12977
   (0 unique value)

. *V.4 Generate median variables  ;
. ****************************************************************************  ;
. for var ks*: egen medcomX=median(X), by(commid07)  ;

->  egen medcomks08A=median(ks08A), by(commid07)
(1 missing value generated)

->  egen medcomks09aA=median(ks09aA), by(commid07)
(2 missing values generated)

->  egen medcomks08B=median(ks08B), by(commid07)

->  egen medcomks09aB=median(ks09aB), by(commid07)

->  egen medcomks08C=median(ks08C), by(commid07)
(5 missing values generated)

->  egen medcomks09aC=median(ks09aC), by(commid07)
(3 missing values generated)

->  egen medcomks08D=median(ks08D), by(commid07)
(5 missing values generated)

->  egen medcomks09aD=median(ks09aD), by(commid07)

->  egen medcomks08E=median(ks08E), by(commid07)
(11 missing values generated)

->  egen medcomks09aE=median(ks09aE), by(commid07)
(12977 missing values generated)

->  egen medcomks08F=median(ks08F), by(commid07)

->  egen medcomks09aF=median(ks09aF), by(commid07)

->  egen medcomks08G=median(ks08G), by(commid07)
(1 missing value generated)

->  egen medcomks09aG=median(ks09aG), by(commid07)
(12977 missing values generated)

. for var ks*: egen medkecX=median(X), by(kecid)  ;

->  egen medkecks08A=median(ks08A), by(kecid)
(1 missing value generated)

->  egen medkecks09aA=median(ks09aA), by(kecid)
(2 missing values generated)

->  egen medkecks08B=median(ks08B), by(kecid)

->  egen medkecks09aB=median(ks09aB), by(kecid)

->  egen medkecks08C=median(ks08C), by(kecid)
(5 missing values generated)

->  egen medkecks09aC=median(ks09aC), by(kecid)
(2 missing values generated)

->  egen medkecks08D=median(ks08D), by(kecid)
(5 missing values generated)

->  egen medkecks09aD=median(ks09aD), by(kecid)

->  egen medkecks08E=median(ks08E), by(kecid)
(10 missing values generated)

->  egen medkecks09aE=median(ks09aE), by(kecid)
(12977 missing values generated)

->  egen medkecks08F=median(ks08F), by(kecid)

->  egen medkecks09aF=median(ks09aF), by(kecid)

->  egen medkecks08G=median(ks08G), by(kecid)
(1 missing value generated)

->  egen medkecks09aG=median(ks09aG), by(kecid)
(12977 missing values generated)

. for var ks*: egen medkabX=median(X), by(kabid)  ;

->  egen medkabks08A=median(ks08A), by(kabid)

->  egen medkabks09aA=median(ks09aA), by(kabid)

->  egen medkabks08B=median(ks08B), by(kabid)

->  egen medkabks09aB=median(ks09aB), by(kabid)

->  egen medkabks08C=median(ks08C), by(kabid)

->  egen medkabks09aC=median(ks09aC), by(kabid)
(1 missing value generated)

->  egen medkabks08D=median(ks08D), by(kabid)

->  egen medkabks09aD=median(ks09aD), by(kabid)

->  egen medkabks08E=median(ks08E), by(kabid)
(1 missing value generated)

->  egen medkabks09aE=median(ks09aE), by(kabid)
(12977 missing values generated)

->  egen medkabks08F=median(ks08F), by(kabid)

->  egen medkabks09aF=median(ks09aF), by(kabid)

->  egen medkabks08G=median(ks08G), by(kabid)

->  egen medkabks09aG=median(ks09aG), by(kabid)
(12977 missing values generated)

. *V.5. Imputation  ;
. ****************************************************************************  ;
. for var ks*: gen origX=X  ;

->  gen origks08A=ks08A
(47 missing values generated)

->  gen origks09aA=ks09aA
(57 missing values generated)

->  gen origks08B=ks08B
(29 missing values generated)

->  gen origks09aB=ks09aB
(16 missing values generated)

->  gen origks08C=ks08C
(60 missing values generated)

->  gen origks09aC=ks09aC
(39 missing values generated)

->  gen origks08D=ks08D
(91 missing values generated)

->  gen origks09aD=ks09aD
(27 missing values generated)

->  gen origks08E=ks08E
(165 missing values generated)

->  gen origks09aE=ks09aE
(12977 missing values generated)

->  gen origks08F=ks08F
(54 missing values generated)

->  gen origks09aF=ks09aF
(20 missing values generated)

->  gen origks08G=ks08G
(32 missing values generated)

->  gen origks09aG=ks09aG
(12977 missing values generated)

. for var ks08*: replace X=medcomX if X==. & origea==1  & _outlierks08~=1  ;

->  replace ks08A=medcomks08A if ks08A==. & origea==1 & _outlierks08~=1
(20 real changes made)

->  replace ks08B=medcomks08B if ks08B==. & origea==1 & _outlierks08~=1
(9 real changes made)

->  replace ks08C=medcomks08C if ks08C==. & origea==1 & _outlierks08~=1
(21 real changes made)

->  replace ks08D=medcomks08D if ks08D==. & origea==1 & _outlierks08~=1
(36 real changes made)

->  replace ks08E=medcomks08E if ks08E==. & origea==1 & _outlierks08~=1
(80 real changes made)

->  replace ks08F=medcomks08F if ks08F==. & origea==1 & _outlierks08~=1
(20 real changes made)

->  replace ks08G=medcomks08G if ks08G==. & origea==1 & _outlierks08~=1
(9 real changes made)

. for var ks08*: replace X=medkecX if X==. & _outlierks08~=1  ;

->  replace ks08A=medkecks08A if ks08A==. & _outlierks08~=1
(20 real changes made)

->  replace ks08B=medkecks08B if ks08B==. & _outlierks08~=1
(14 real changes made)

->  replace ks08C=medkecks08C if ks08C==. & _outlierks08~=1
(24 real changes made)

->  replace ks08D=medkecks08D if ks08D==. & _outlierks08~=1
(42 real changes made)

->  replace ks08E=medkecks08E if ks08E==. & _outlierks08~=1
(72 real changes made)

->  replace ks08F=medkecks08F if ks08F==. & _outlierks08~=1
(28 real changes made)

->  replace ks08G=medkecks08G if ks08G==. & _outlierks08~=1
(19 real changes made)

. for var ks08*: replace X=medkabX if X==. & _outlierks08~=1  ;

->  replace ks08A=medkabks08A if ks08A==. & _outlierks08~=1
(1 real change made)

->  replace ks08B=medkabks08B if ks08B==. & _outlierks08~=1
(0 real changes made)

->  replace ks08C=medkabks08C if ks08C==. & _outlierks08~=1
(5 real changes made)

->  replace ks08D=medkabks08D if ks08D==. & _outlierks08~=1
(5 real changes made)

->  replace ks08E=medkabks08E if ks08E==. & _outlierks08~=1
(9 real changes made)

->  replace ks08F=medkabks08F if ks08F==. & _outlierks08~=1
(0 real changes made)

->  replace ks08G=medkabks08G if ks08G==. & _outlierks08~=1
(1 real change made)

. for var ks09*: replace X=medcomX if X==. & origea==1  & _outlierks09~=1  ;

->  replace ks09aA=medcomks09aA if ks09aA==. & origea==1 & _outlierks09~=1
(32 real changes made)

->  replace ks09aB=medcomks09aB if ks09aB==. & origea==1 & _outlierks09~=1
(5 real changes made)

->  replace ks09aC=medcomks09aC if ks09aC==. & origea==1 & _outlierks09~=1
(21 real changes made)

->  replace ks09aD=medcomks09aD if ks09aD==. & origea==1 & _outlierks09~=1
(13 real changes made)

->  replace ks09aE=medcomks09aE if ks09aE==. & origea==1 & _outlierks09~=1
(0 real changes made)

->  replace ks09aF=medcomks09aF if ks09aF==. & origea==1 & _outlierks09~=1
(5 real changes made)

->  replace ks09aG=medcomks09aG if ks09aG==. & origea==1 & _outlierks09~=1
(0 real changes made)

. for var ks09*: replace X=medkecX if X==. & _outlierks09~=1  ;

->  replace ks09aA=medkecks09aA if ks09aA==. & _outlierks09~=1
(21 real changes made)

->  replace ks09aB=medkecks09aB if ks09aB==. & _outlierks09~=1
(10 real changes made)

->  replace ks09aC=medkecks09aC if ks09aC==. & _outlierks09~=1
(15 real changes made)

->  replace ks09aD=medkecks09aD if ks09aD==. & _outlierks09~=1
(12 real changes made)

->  replace ks09aE=medkecks09aE if ks09aE==. & _outlierks09~=1
(0 real changes made)

->  replace ks09aF=medkecks09aF if ks09aF==. & _outlierks09~=1
(13 real changes made)

->  replace ks09aG=medkecks09aG if ks09aG==. & _outlierks09~=1
(0 real changes made)

. for var ks09*: replace X=medkabX if X==. & _outlierks09~=1  ;

->  replace ks09aA=medkabks09aA if ks09aA==. & _outlierks09~=1
(1 real change made)

->  replace ks09aB=medkabks09aB if ks09aB==. & _outlierks09~=1
(0 real changes made)

->  replace ks09aC=medkabks09aC if ks09aC==. & _outlierks09~=1
(1 real change made)

->  replace ks09aD=medkabks09aD if ks09aD==. & _outlierks09~=1
(0 real changes made)

->  replace ks09aE=medkabks09aE if ks09aE==. & _outlierks09~=1
(0 real changes made)

->  replace ks09aF=medkabks09aF if ks09aF==. & _outlierks09~=1
(0 real changes made)

->  replace ks09aG=medkabks09aG if ks09aG==. & _outlierks09~=1
(0 real changes made)

. for var ks08* ks09*: replace X=medcomX if origX==. & X==.  ;

->  replace ks08A=medcomks08A if origks08A==. & ks08A==.
(6 real changes made)

->  replace ks08B=medcomks08B if origks08B==. & ks08B==.
(6 real changes made)

->  replace ks08C=medcomks08C if origks08C==. & ks08C==.
(10 real changes made)

->  replace ks08D=medcomks08D if origks08D==. & ks08D==.
(8 real changes made)

->  replace ks08E=medcomks08E if origks08E==. & ks08E==.
(2 real changes made)

->  replace ks08F=medcomks08F if origks08F==. & ks08F==.
(6 real changes made)

->  replace ks08G=medcomks08G if origks08G==. & ks08G==.
(3 real changes made)

->  replace ks09aA=medcomks09aA if origks09aA==. & ks09aA==.
(2 real changes made)

->  replace ks09aB=medcomks09aB if origks09aB==. & ks09aB==.
(1 real change made)

->  replace ks09aC=medcomks09aC if origks09aC==. & ks09aC==.
(0 real changes made)

->  replace ks09aD=medcomks09aD if origks09aD==. & ks09aD==.
(2 real changes made)

->  replace ks09aE=medcomks09aE if origks09aE==. & ks09aE==.
(0 real changes made)

->  replace ks09aF=medcomks09aF if origks09aF==. & ks09aF==.
(2 real changes made)

->  replace ks09aG=medcomks09aG if origks09aG==. & ks09aG==.
(0 real changes made)

. for var ks08*: replace X=. if _outlierks08==1  ;

->  replace ks08A=. if _outlierks08==1
(34 real changes made, 34 to missing)

->  replace ks08B=. if _outlierks08==1
(34 real changes made, 34 to missing)

->  replace ks08C=. if _outlierks08==1
(34 real changes made, 34 to missing)

->  replace ks08D=. if _outlierks08==1
(34 real changes made, 34 to missing)

->  replace ks08E=. if _outlierks08==1
(33 real changes made, 33 to missing)

->  replace ks08F=. if _outlierks08==1
(34 real changes made, 34 to missing)

->  replace ks08G=. if _outlierks08==1
(34 real changes made, 34 to missing)

. for var ks09*: replace X=. if _outlierks09==1  ;

->  replace ks09aA=. if _outlierks09==1
(8 real changes made, 8 to missing)

->  replace ks09aB=. if _outlierks09==1
(9 real changes made, 9 to missing)

->  replace ks09aC=. if _outlierks09==1
(8 real changes made, 8 to missing)

->  replace ks09aD=. if _outlierks09==1
(9 real changes made, 9 to missing)

->  replace ks09aE=. if _outlierks09==1
(0 real changes made)

->  replace ks09aF=. if _outlierks09==1
(9 real changes made, 9 to missing)

->  replace ks09aG=. if _outlierks09==1
(0 real changes made)

. ********** END OF THE 'MANUAL' IMPUTATION OF KS08 AND KS09 ************************************************************  ;
. inspect ks*  ;

ks08A:  A ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            1425      1425          -
|  #                         Positive       11518     11518          -
|  #                                        -----     -----      -----
|  #                         Total          12943     12943          -
|  #   .   .   .   .         Missing           34
+----------------------                     -----
0              1.20e+07                     12977
(More than 99 unique values)

ks09aA:  A ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            8557      8557          -
|  #                         Positive        4411      4411          -
|  #                                        -----     -----      -----
|  #                         Total          12968     12968          -
|  #   .   .   .   .         Missing            9
+----------------------                     -----
0               5000000                     12977
(More than 99 unique values)

ks08B:  B ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            8565      8565          -
|  #                         Positive        4378      4378          -
|  #                                        -----     -----      -----
|  #                         Total          12943     12943          -
|  #   .   .   .   .         Missing           34
+----------------------                     -----
0              1.35e+07                     12977
(More than 99 unique values)

ks09aB:  B ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           12264     12264          -
|  #                         Positive         704       704          -
|  #                                        -----     -----      -----
|  #                         Total          12968     12968          -
|  #   .   .   .   .         Missing            9
+----------------------                     -----
0               3160000                     12977
  (81 unique values)

ks08C:  C ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            1919      1919          -
|  #                         Positive       11024     11024          -
|  #                                        -----     -----      -----
|  #                         Total          12943     12943          -
|  #   .   .   .   .         Missing           34
+----------------------                     -----
0              3.00e+07                     12977
(More than 99 unique values)

ks09aC:  C ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           12061     12061          -
|  #                         Positive         906       906          -
|  #                                        -----     -----      -----
|  #                         Total          12967     12967          -
|  #   .   .   .   .         Missing           10
+----------------------                     -----
0              3.00e+07                     12977
(More than 99 unique values)

ks08D:  D ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            1533      1533          -
|  #                         Positive       11410     11410          -
|  #                                        -----     -----      -----
|  #                         Total          12943     12943          -
|  #   .   .   .   .         Missing           34
+----------------------                     -----
0              4.03e+07                     12977
(More than 99 unique values)

ks09aD:  D ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           11818     11818          -
|  #                         Positive        1150      1150          -
|  #                                        -----     -----      -----
|  #                         Total          12968     12968          -
|  #   .   .   .   .         Missing            9
+----------------------                     -----
0              2.00e+07                     12977
(More than 99 unique values)

ks08E:  E ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            4167      4167          -
|  #                         Positive        8775      8775          -
|  #                                        -----     -----      -----
|  #                         Total          12942     12942          -
|  #   .   .   .   .         Missing           35
+----------------------                     -----
0              1.03e+07                     12977
(More than 99 unique values)

ks09aE:  E ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|                            Negative           -         -          -
|                            Zero               -         -          -
|                            Positive           -         -          -
|                                           -----     -----      -----
|                            Total              -         -          -
|                            Missing        12977
+----------------------                     -----
.             -9.0e+307                     12977
   (0 unique value)

ks08F:  F ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            9731      9731          -
|  #                         Positive        3212      3212          -
|  #                                        -----     -----      -----
|  #                         Total          12943     12943          -
|  #   .   .   .   .         Missing           34
+----------------------                     -----
0              8.05e+07                     12977
(More than 99 unique values)

ks09aF:  F ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           12627     12627          -
|  #                         Positive         341       341          -
|  #                                        -----     -----      -----
|  #                         Total          12968     12968          -
|  #   .   .   .   .         Missing            9
+----------------------                     -----
0              2.04e+07                     12977
  (91 unique values)

ks08G:  G ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero           10881     10881          -
|  #                         Positive        2062      2062          -
|  #                                        -----     -----      -----
|  #                         Total          12943     12943          -
|  #   .   .   .   .         Missing           34
+----------------------                     -----
0              1.70e+07                     12977
(More than 99 unique values)

ks09aG:  G ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|                            Negative           -         -          -
|                            Zero               -         -          -
|                            Positive           -         -          -
|                                           -----     -----      -----
|                            Total              -         -          -
|                            Missing        12977
+----------------------                     -----
.             -9.0e+307                     12977
   (0 unique value)

. compress   ;
origea07 was float now byte
rural was float now byte
medcomks09aE was float now byte
medcomks09aG was float now byte
medkecks09aE was float now byte
medkecks09aG was float now byte
medkabks09aE was float now byte
medkabks09aG was float now byte
origks09aE was float now byte
origks09aG was float now byte
kabid07 was double now int
kecid07 was double now long

. sort hhid07  ;

. * V.6 Generate variable containing information on missing values in this data file   ;
. ****************************************************************************  ;
. gen sumks08=ks08A+ks08B+ks08C+ks08D+ks08E+ks08F+ks08G  ;
(35 missing values generated)

. capture drop missks08  ;

. gen missks08=(sumks08==.)  ;

. gen sumks09=ks09aA+ks09aB+ks09aC+ks09aD+ks09aF  ;
(10 missing values generated)

. capture drop missks09  ;

. gen missks09=(sumks09==.)  ;

. *V.7. save the data  ;
. ****************************************************************************  ;
. lab var  missks08 "Household w/ at least 1 KS08 missing"  ;

. lab var  missks09 "Household w/ at least 1 KS09a missing"  ;

. tab1 miss*  ;

-> tabulation of missks08  

  Household |
w/ at least |
     1 KS08 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,942       99.73       99.73
          1 |         35        0.27      100.00
------------+-----------------------------------
      Total |     12,977      100.00

-> tabulation of missks09  

  Household |
w/ at least |
    1 KS09a |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,967       99.92       99.92
          1 |         10        0.08      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. capture drop med* origk* sum*  ;

. compress  ;
missks08 was float now byte
missks09 was float now byte

. sort hhid07  ;

. save $dir0\b1_ks307, replace  ;
file E:\PCE\temp\\b1_ks307.dta saved

. ********************************************************************************  ;
. * VI. B1_KS0  ;
. ********************************************************************************  ;
. use  hhid07 ks04b ks07a ks10aa ks10ab ks11aa ks11ab ks12aa ks12ab ks12bb using $dir7\b1_ks0, clear  ;

. bys hhid07: keep if _n==_N ;
(0 observations deleted)

. replace ks04b=. if ks04b>=995995 ;
(45 real changes made, 45 to missing)

. gen _outlierks04b=. ;
(12977 missing values generated)

. replace ks07a=. if ks07a>=99999995 ;
(30 real changes made, 30 to missing)

. gen _outlierks07a=1 if ks07a> 3610000;
(12944 missing values generated)

.  for var ks10* ks11* ks12*: replace X=. if X>=98998998;

->  replace ks10aa=. if ks10aa>=98998998
(42 real changes made, 42 to missing)

->  replace ks10ab=. if ks10ab>=98998998
(26 real changes made, 26 to missing)

->  replace ks11aa=. if ks11aa>=98998998
(46 real changes made, 46 to missing)

->  replace ks11ab=. if ks11ab>=98998998
(23 real changes made, 23 to missing)

->  replace ks12aa=. if ks12aa>=98998998
(37 real changes made, 37 to missing)

->  replace ks12ab=. if ks12ab>=98998998
(17 real changes made, 17 to missing)

->  replace ks12bb=. if ks12bb>=98998998
(15 real changes made, 15 to missing)

. for var ks10* ks11* ks12*: gen _outlierX=. ;

->  gen _outlierks10aa=.
(12977 missing values generated)

->  gen _outlierks10ab=.
(12977 missing values generated)

->  gen _outlierks11aa=.
(12977 missing values generated)

->  gen _outlierks11ab=.
(12977 missing values generated)

->  gen _outlierks12aa=.
(12977 missing values generated)

->  gen _outlierks12ab=.
(12977 missing values generated)

->  gen _outlierks12bb=.
(12977 missing values generated)

. replace _outlierks10aa=1 if ks10aa>31200000 ;
(45 real changes made)

. replace _outlierks10ab=1 if ks10ab>35000000;
(28 real changes made)

. replace _outlierks11aa=1 if ks11aa>7720000;
(51 real changes made)

. replace _outlierks11ab=1 if ks11ab>12250000;
(25 real changes made)

. replace _outlierks12ab=1 if ks12ab>40000000 ;
(18 real changes made)

. replace _outlierks12bb=1 if ks12bb>27000000;
(16 real changes made)

. sort hhid07  ;

. mvencode  _outlier*, mv(0) ;
_outlier~04b: 12977 missing values recoded
_outlier~07a: 12944 missing values recoded
_outlier~0aa: 12932 missing values recoded
_outlier~0ab: 12949 missing values recoded
_outlier~1aa: 12926 missing values recoded
_outlier~1ab: 12952 missing values recoded
_outlier~2aa: 12977 missing values recoded
_outlier~2ab: 12959 missing values recoded
_outlierk~bb: 12961 missing values recoded

. lab var _outlierks04b "Any outlier in ks04b" ;

. lab var _outlierks07a "Any outlier in ks07a" ;

. lab var _outlierks10aa "Any outlier in ks10aa" ;

. lab var _outlierks10ab "Any outlier in ks10ab" ;

. lab var _outlierks11aa "Any outlier in ks11aa" ;

. lab var _outlierks11ab "Any outlier in ks11ab" ;

. lab var _outlierks12aa "Any outlier in ks12aa" ;

. lab var _outlierks12ab "Any outlier in ks12ab " ;

. lab var _outlierks12bb "Any outlier in ks12bb" ;

. merge hhid07 using $dir0\sc07  ;

. tab _merge  ;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        559        4.13        4.13
          3 |     12,977       95.87      100.00
------------+-----------------------------------
      Total |     13,536      100.00

. keep if _merge==3  ;
(559 observations deleted)

. drop _merge  ;

.  * VI.1. Identify outliers  ;
. ********************************************************************************  ;
. gen byte _outlierks0=0   ;

. lab var _outlierks0 "Any outlier in ks0.dta"  ;

. tab _outlierks0  ;

Any outlier |
 in ks0.dta |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. * VI.2. Generate median variables  ;
. ********************************************************************************  ;
. for var ks*: egen medcomX=median(X), by(commid07) ;

->  egen medcomks04b=median(ks04b), by(commid07)
(5 missing values generated)

->  egen medcomks07a=median(ks07a), by(commid07)
(1 missing value generated)

->  egen medcomks10aa=median(ks10aa), by(commid07)
(1 missing value generated)

->  egen medcomks10ab=median(ks10ab), by(commid07)
(3 missing values generated)

->  egen medcomks11aa=median(ks11aa), by(commid07)

->  egen medcomks11ab=median(ks11ab), by(commid07)
(4 missing values generated)

->  egen medcomks12aa=median(ks12aa), by(commid07)
(3 missing values generated)

->  egen medcomks12ab=median(ks12ab), by(commid07)
(1 missing value generated)

->  egen medcomks12bb=median(ks12bb), by(commid07)
(1 missing value generated)

.  for var ks*: egen medkecX=median(X), by(kecid)  ;

->  egen medkecks04b=median(ks04b), by(kecid)
(5 missing values generated)

->  egen medkecks07a=median(ks07a), by(kecid)
(1 missing value generated)

->  egen medkecks10aa=median(ks10aa), by(kecid)
(1 missing value generated)

->  egen medkecks10ab=median(ks10ab), by(kecid)
(3 missing values generated)

->  egen medkecks11aa=median(ks11aa), by(kecid)

->  egen medkecks11ab=median(ks11ab), by(kecid)
(4 missing values generated)

->  egen medkecks12aa=median(ks12aa), by(kecid)
(3 missing values generated)

->  egen medkecks12ab=median(ks12ab), by(kecid)
(1 missing value generated)

->  egen medkecks12bb=median(ks12bb), by(kecid)
(1 missing value generated)

. for var ks*: egen medkabX=median(X), by(kabid) ;

->  egen medkabks04b=median(ks04b), by(kabid)

->  egen medkabks07a=median(ks07a), by(kabid)
(1 missing value generated)

->  egen medkabks10aa=median(ks10aa), by(kabid)

->  egen medkabks10ab=median(ks10ab), by(kabid)

->  egen medkabks11aa=median(ks11aa), by(kabid)

->  egen medkabks11ab=median(ks11ab), by(kabid)

->  egen medkabks12aa=median(ks12aa), by(kabid)

->  egen medkabks12ab=median(ks12ab), by(kabid)

->  egen medkabks12bb=median(ks12bb), by(kabid)

. * VI.3. Imputation  ;
. ********************************************************************************  ;
. for var ks*: gen origX=X  ;

->  gen origks04b=ks04b
(45 missing values generated)

->  gen origks07a=ks07a
(30 missing values generated)

->  gen origks10aa=ks10aa
(42 missing values generated)

->  gen origks10ab=ks10ab
(26 missing values generated)

->  gen origks11aa=ks11aa
(46 missing values generated)

->  gen origks11ab=ks11ab
(23 missing values generated)

->  gen origks12aa=ks12aa
(37 missing values generated)

->  gen origks12ab=ks12ab
(17 missing values generated)

->  gen origks12bb=ks12bb
(15 missing values generated)

. for var ks*: replace X=medcomX if X==. & origea==1  & _outlierks0~=1  ;

->  replace ks04b=medcomks04b if ks04b==. & origea==1 & _outlierks0~=1
(17 real changes made)

->  replace ks07a=medcomks07a if ks07a==. & origea==1 & _outlierks0~=1
(12 real changes made)

->  replace ks10aa=medcomks10aa if ks10aa==. & origea==1 & _outlierks0~=1
(22 real changes made)

->  replace ks10ab=medcomks10ab if ks10ab==. & origea==1 & _outlierks0~=1
(11 real changes made)

->  replace ks11aa=medcomks11aa if ks11aa==. & origea==1 & _outlierks0~=1
(23 real changes made)

->  replace ks11ab=medcomks11ab if ks11ab==. & origea==1 & _outlierks0~=1
(6 real changes made)

->  replace ks12aa=medcomks12aa if ks12aa==. & origea==1 & _outlierks0~=1
(16 real changes made)

->  replace ks12ab=medcomks12ab if ks12ab==. & origea==1 & _outlierks0~=1
(5 real changes made)

->  replace ks12bb=medcomks12bb if ks12bb==. & origea==1 & _outlierks0~=1
(2 real changes made)

. for var ks*: replace X=medkecX if X==. & _outlierks0~=1  ;

->  replace ks04b=medkecks04b if ks04b==. & _outlierks0~=1
(23 real changes made)

->  replace ks07a=medkecks07a if ks07a==. & _outlierks0~=1
(17 real changes made)

->  replace ks10aa=medkecks10aa if ks10aa==. & _outlierks0~=1
(19 real changes made)

->  replace ks10ab=medkecks10ab if ks10ab==. & _outlierks0~=1
(12 real changes made)

->  replace ks11aa=medkecks11aa if ks11aa==. & _outlierks0~=1
(23 real changes made)

->  replace ks11ab=medkecks11ab if ks11ab==. & _outlierks0~=1
(13 real changes made)

->  replace ks12aa=medkecks12aa if ks12aa==. & _outlierks0~=1
(18 real changes made)

->  replace ks12ab=medkecks12ab if ks12ab==. & _outlierks0~=1
(11 real changes made)

->  replace ks12bb=medkecks12bb if ks12bb==. & _outlierks0~=1
(12 real changes made)

. for var ks*: replace X=medkabX if X==. & _outlierks0~=1  ;

->  replace ks04b=medkabks04b if ks04b==. & _outlierks0~=1
(5 real changes made)

->  replace ks07a=medkabks07a if ks07a==. & _outlierks0~=1
(0 real changes made)

->  replace ks10aa=medkabks10aa if ks10aa==. & _outlierks0~=1
(1 real change made)

->  replace ks10ab=medkabks10ab if ks10ab==. & _outlierks0~=1
(3 real changes made)

->  replace ks11aa=medkabks11aa if ks11aa==. & _outlierks0~=1
(0 real changes made)

->  replace ks11ab=medkabks11ab if ks11ab==. & _outlierks0~=1
(4 real changes made)

->  replace ks12aa=medkabks12aa if ks12aa==. & _outlierks0~=1
(3 real changes made)

->  replace ks12ab=medkabks12ab if ks12ab==. & _outlierks0~=1
(1 real change made)

->  replace ks12bb=medkabks12bb if ks12bb==. & _outlierks0~=1
(1 real change made)

.  for var ks07a* ks10* ks1* : replace X=medcomX if origX==. & X==.  ;

->  replace ks07a=medcomks07a if origks07a==. & ks07a==.
(0 real changes made)

->  replace ks10aa=medcomks10aa if origks10aa==. & ks10aa==.
(0 real changes made)

->  replace ks10ab=medcomks10ab if origks10ab==. & ks10ab==.
(0 real changes made)

->  replace ks10aa=medcomks10aa if origks10aa==. & ks10aa==.
(0 real changes made)

->  replace ks10ab=medcomks10ab if origks10ab==. & ks10ab==.
(0 real changes made)

->  replace ks11aa=medcomks11aa if origks11aa==. & ks11aa==.
(0 real changes made)

->  replace ks11ab=medcomks11ab if origks11ab==. & ks11ab==.
(0 real changes made)

->  replace ks12aa=medcomks12aa if origks12aa==. & ks12aa==.
(0 real changes made)

->  replace ks12ab=medcomks12ab if origks12ab==. & ks12ab==.
(0 real changes made)

->  replace ks12bb=medcomks12bb if origks12bb==. & ks12bb==.
(0 real changes made)

. for var ks07a* ks10* ks1*: replace X=. if _outlierks0==1  ;

->  replace ks07a=. if _outlierks0==1
(0 real changes made)

->  replace ks10aa=. if _outlierks0==1
(0 real changes made)

->  replace ks10ab=. if _outlierks0==1
(0 real changes made)

->  replace ks10aa=. if _outlierks0==1
(0 real changes made)

->  replace ks10ab=. if _outlierks0==1
(0 real changes made)

->  replace ks11aa=. if _outlierks0==1
(0 real changes made)

->  replace ks11ab=. if _outlierks0==1
(0 real changes made)

->  replace ks12aa=. if _outlierks0==1
(0 real changes made)

->  replace ks12ab=. if _outlierks0==1
(0 real changes made)

->  replace ks12bb=. if _outlierks0==1
(0 real changes made)

. ********** *************  ;
. * VI.4 Generate variable containing information on missing values in this data file  ;
. ********************************************************************************  ;
. gen miss4b=1 if ks04b==.  ;
(12977 missing values generated)

. lab var miss4b "Household with missing ks04b"  ;

. mvencode miss4b, mv(0)  ;
      miss4b: 12977 missing values recoded

. tab miss4b  ;

  Household |
       with |
    missing |
      ks04b |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. gen miss7a=1 if ks07a==.  ;
(12976 missing values generated)

. lab var miss7a "Household with missing ks07a"  ;

. mvencode miss7a, mv(0)  ;
      miss7a: 12976 missing values recoded

. tab miss7a  ;

  Household |
       with |
    missing |
      ks07a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,976       99.99       99.99
          1 |          1        0.01      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. gen miss10aa=1 if ks10aa==.  ;
(12977 missing values generated)

. lab var miss10aa "Household with missing ks10aa"  ;

. mvencode miss10aa, mv(0)  ;
    miss10aa: 12977 missing values recoded

. tab miss10aa  ;

  Household |
       with |
    missing |
     ks10aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. gen miss10ab=1 if ks10ab==.  ;
(12977 missing values generated)

. lab var miss10ab "Household with missing ks10ab"  ;

. mvencode miss10ab, mv(0)  ;
    miss10ab: 12977 missing values recoded

. tab miss10ab  ;

  Household |
       with |
    missing |
     ks10ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. gen miss11aa=1 if ks11aa==.  ;
(12977 missing values generated)

. lab var miss11aa "Household with missing ks11aa"  ;

. mvencode miss11aa, mv(0)  ;
    miss11aa: 12977 missing values recoded

. tab miss11aa  ;

  Household |
       with |
    missing |
     ks11aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. gen miss11ab=1 if ks11ab==.  ;
(12977 missing values generated)

. lab var miss11ab "Household with missing ks11ab"  ;

. mvencode miss11ab, mv(0)  ;
    miss11ab: 12977 missing values recoded

. tab miss11ab  ;

  Household |
       with |
    missing |
     ks11ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. gen miss12aa=1 if ks12aa==.  ;
(12977 missing values generated)

. lab var miss12aa "Household with missing ks12aa"  ;

. mvencode miss12aa, mv(0)  ;
    miss12aa: 12977 missing values recoded

. tab miss12aa  ;

  Household |
       with |
    missing |
     ks12aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. gen miss12ab=1 if ks12ab==.  ;
(12977 missing values generated)

. lab var miss12ab "Household with missing ks12ab"  ;

. mvencode miss12ab, mv(0)  ;
    miss12ab: 12977 missing values recoded

. tab miss12ab  ;

  Household |
       with |
    missing |
     ks12ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. gen miss12bb=1 if ks12bb==.  ;
(12977 missing values generated)

. lab var miss12bb "Household with missing ks12bb"  ;

. mvencode miss12bb, mv(0)  ;
    miss12bb: 12977 missing values recoded

. tab miss12bb  ;

  Household |
       with |
    missing |
     ks12bb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. * VI.5 save the file  ;
. ************************************************************************************  ;
. capture drop  med* origk*  ;

. sort hhid07   ;

. compress   ;
_outlierks04b was float now byte
_outlierks07a was float now byte
_outlierks10aa was float now byte
_outlierks10ab was float now byte
_outlierks11aa was float now byte
_outlierks11ab was float now byte
_outlierks12aa was float now byte
_outlierks12ab was float now byte
_outlierks12bb was float now byte
provid07 was float now byte
origea07 was float now byte
rural was float now byte
miss4b was float now byte
miss7a was float now byte
miss10aa was float now byte
miss10ab was float now byte
miss11aa was float now byte
miss11ab was float now byte
miss12aa was float now byte
miss12ab was float now byte
miss12bb was float now byte
kabid07 was double now int
kecid07 was double now long

. label data "Shorter version of b1_ks0 created using pre_pce.do"  ;

. save $dir0\b1_ks007, replace  ;
file E:\PCE\temp\\b1_ks007.dta saved

. ************************************************************************************  ;
. * VII. MERGE ALL EXPENDITURE FILES  ;
. ************************************************************************************  ;
. use $dir0\b1_ks007, clear  ;
(Shorter version of b1_ks0 created using pre_pce.do)

. merge hhid07  using $dir0\b1_ks107  ;

. tab _merge  ;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. rename _merge _m1  ;

. sort hhid07   ;

. merge hhid07  using $dir0\b1_ks207  ;

. tab _merge  ;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. rename _merge _m2   ;

. sort hhid07   ;

. merge hhid07  using $dir0\b1_ks307  ;

. tab _merge  ;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     12,977      100.00      100.00
------------+-----------------------------------
      Total |     12,977      100.00

. rename _merge _m3  ;

. sort hhid07   ;

. merge hhid07  using $dir0\b2_kr07  ;

. tab _merge  ;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         21        0.16        0.16
          2 |         31        0.24        0.40
          3 |     12,956       99.60      100.00
------------+-----------------------------------
      Total |     13,008      100.00

. * _merge=1 hh in Book 1-KS but not in Book 2 - KR  ;
. * _merge=2 hh in Book 2-KR but not in Book 1 - KS  ;
. list hhid07  _merge if _merge~=3  ;

       +------------------+
       |  hhid07   _merge |
       |------------------|
   98. | 0040600        1 |
  127. | 0042200        1 |
  588. | 0150541        1 |
  941. | 0260500        1 |
 1371. | 0341142        1 |
       |------------------|
 2910. | 0690600        1 |
 2912. | 0700200        1 |
 3007. | 0731100        1 |
 3112. | 0761531        1 |
 3223. | 0801843        1 |
       |------------------|
 3261. | 0821000        1 |
 3268. | 0821400        1 |
 3480. | 0904131        1 |
 3481. | 0904141        1 |
 4134. | 1102300        1 |
       |------------------|
 6016. | 1560641        1 |
 6659. | 1700711        1 |
 7846. | 1990200        1 |
 7870. | 1991600        1 |
 7878. | 1992000        1 |
       |------------------|
12334. | 3051800        1 |
12978. | 0022800        2 |
12979. | 0032200        2 |
12980. | 0042900        2 |
12981. | 0111900        2 |
       |------------------|
12982. | 0141700        2 |
12983. | 0230700        2 |
12984. | 0260400        2 |
12985. | 0282141        2 |
12986. | 0551731        2 |
       |------------------|
12987. | 0680500        2 |
12988. | 0700342        2 |
12989. | 0701600        2 |
12990. | 0701641        2 |
12991. | 0760500        2 |
       |------------------|
12992. | 0761341        2 |
12993. | 0764200        2 |
12994. | 0771831        2 |
12995. | 0780742        2 |
12996. | 0830600        2 |
       |------------------|
12997. | 0870800        2 |
12998. | 0904142        2 |
12999. | 0921141        2 |
13000. | 0951341        2 |
13001. | 1062000        2 |
       |------------------|
13002. | 1240800        2 |
13003. | 1510400        2 |
13004. | 1920541        2 |
13005. | 1941941        2 |
13006. | 2131035        2 |
       |------------------|
13007. | 2131200        2 |
13008. | 2362000        2 |
       +------------------+

. *keep if _merge==3  ;
. rename _merge _mkr  ;

. gen z=missks02+missks03+missks06+miss4b+miss7a+missks08+missks09+misskr+miss10aa+miss10ab+miss11aa+miss11ab+miss12aa+miss12ab+miss12bb  ;
(52 missing values generated)

. gen missing=1 if z>0 & z~=. ;
(12710 missing values generated)

. replace missing=1 if z==.   ;
(52 real changes made)

. replace missing=0 if missing==. & z~=.  ;
(12658 real changes made)

. replace missing=1 if z==. ;
(0 real changes made)

. drop z   ;

. lab var missing "Household with at least 1 part of expenditure missing"  ;

. tab missing, m  ;

  Household |
    with at |
    least 1 |
    part of |
expenditure |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,658       97.31       97.31
          1 |        350        2.69      100.00
------------+-----------------------------------
      Total |     13,008      100.00

. lab data "Merged Book1/KS with missing value & outlier information. Wide version"  ;

. save $dir0\pre_pce07.dta, replace  ;
file E:\PCE\temp\\pre_pce07.dta saved

. ******************************************************************************  ;
. *VIII. PCE    ;
. ******************************************************************************  ;
. use $dir0\pre_pce07,clear  ;
(Merged Book1/KS with missing value & outlier information. Wide version)

. **FOOD (KS02, KS03, AND KS04B), MONTHLY  ;
. gen mrice=ks02A*52/12  ;
(165 missing values generated)

. gen mstaple=(ks02A+ks02B+ks02C+ks02D+ks02E)*52/12   ;
(165 missing values generated)

. gen mvege=(ks02F+ks02G+ks02H)*52/12  ;
(165 missing values generated)

. gen mdried=(ks02I+ks02J)*52/12           ;
(165 missing values generated)

. gen mmeat=(ks02K+ks02L+ks02OA+ks02OB)*52/12   ;
(165 missing values generated)

. gen mfish=(ks02M+ks02N)*52/12  ;
(165 missing values generated)

. gen mdairy=(ks02P+ks02Q)*52/12   ;
(165 missing values generated)

. gen mspices=(ks02R+ks02S+ks02T+ks02U+ks02V)*52/12  ;
(165 missing values generated)

. gen msugar=(ks02W+ks02AA)*52/12   ;
(165 missing values generated)

. gen moil=(ks02X+ks02Y)*52/12  ;
(165 missing values generated)

. gen mbeve=(ks02Z+ks02BA+ks02CA+ks02DA+ks02EA)*52/12   ;
(165 missing values generated)

. gen maltb=(ks02FA+ks02GA+ks02HA)*52/12   ;
(165 missing values generated)

. gen msnack=(ks02IA)*52/12  ;
(165 missing values generated)

. gen mfdout=(ks02IB)*52/12  ;
(165 missing values generated)

. gen irice=ks03A*52/12  ;
(120 missing values generated)

. gen istaple=(ks03A+ks03B+ks03C+ks03D+ks03E)*52/12   ;
(120 missing values generated)

. gen ivege=(ks03F+ks03G+ks03H)*52/12  ;
(120 missing values generated)

. gen idried=(ks03I+ks03J)*52/12   ;
(120 missing values generated)

. gen imeat=(ks03K+ks03L+ks03OA+ks03OB)*52/12   ;
(120 missing values generated)

. gen ifish=(ks03M+ks03N)*52/12  ;
(120 missing values generated)

. gen idairy=(ks03P+ks03Q)*52/12   ;
(120 missing values generated)

. gen ispices=(ks03R+ks03S+ks03T+ks03U+ks03V)*52/12  ;
(120 missing values generated)

. gen isugar=(ks03W+ks03AA)*52/12   ;
(120 missing values generated)

. gen ioil=(ks03X+ks03Y)*52/12  ;
(120 missing values generated)

. gen ibeve=(ks03Z+ks03BA+ks03CA+ks03DA+ks03EA)*52/12   ;
(120 missing values generated)

. gen ialtb=(ks03FA+ks03GA+ks03HA)*52/12   ;
(120 missing values generated)

. gen isnack=(ks03IA)*52/12  ;
(120 missing values generated)

. gen ifdout=(ks03IB)*52/12  ;
(120 missing values generated)

.  gen xrice=mrice+irice  ;
(221 missing values generated)

. gen xstaple=mstaple+istaple  ;
(221 missing values generated)

. gen xvege=mvege+ivege  ;
(221 missing values generated)

. gen xdried=mdried+idried  ;
(221 missing values generated)

. gen xmeat=mmeat+imeat  ;
(221 missing values generated)

. gen xfish=mfish+ifish  ;
(221 missing values generated)

. gen xdairy=mdairy+idairy ;
(221 missing values generated)

.  gen xspices=mspices+ispices ;
(221 missing values generated)

.   gen xsugar=msugar+isugar  ;
(221 missing values generated)

. gen xoil=moil+ioil  ;
(221 missing values generated)

. gen xbeve=mbeve+ibeve  ;
(221 missing values generated)

. gen xaltb=maltb+ialtb  ;
(221 missing values generated)

. gen xsnack=msnack+isnack ;
(221 missing values generated)

.  gen xfdout=mfdout+ifdout   ;
(221 missing values generated)

. *TOTAL MONTHLY  ;
. *mfood: total ks02  ;
. gen mfood =mstaple+mvege+mdried+mmeat+mfish+mdairy+mspices+msugar+moil+mbeve+maltb+msnack+mfdout  ;
(165 missing values generated)

. *ifood: total ks03  ;
. gen ifood =istaple+ivege+idried+imeat+ifish+idairy+ispices+isugar+ioil+ibeve+ialtb+isnack+ifdout  ;
(120 missing values generated)

. *xfdtout: Food transfer, ks04b  ;
. gen xfdtout=ks04b*52/12  ;
(31 missing values generated)

. lab var xfdtout "Monthly food transfer, ks04b"  ;

. ******************************************************************  ;
. *MONTHLY EXPENDITURE ON FOOD: KS02 AND KS03 (NOT INCLUDING KS04B) ;
. *****************************************************************  ;
. gen xfood =xstaple+xvege+xdried+xmeat+xfish+xdairy+xspices+xsugar+xoil+xbeve+xaltb+xsnack+xfdout  ;
(221 missing values generated)

. lab var xfood "Monthly food consumption, ks02 and ks03"  ;

. lab var mrice "Monthly food consumption ks02: rice"   ;

. lab var mstaple "Monthly food consumption ks02: staple" ;

.   lab var mvege "Monthly food consumption ks02: vegetable, fruit"  ;

. lab var mdried "Monthly food consumption ks02: dried food"  ;

. lab var mmeat "Monthly food consumption ks02: meat"  ;

. lab var mfish "Monthly food consumption ks02: fish"  ;

. lab var mdairy "Monthly food consumption ks02: dairy"  ;

. lab var mspices "Monthly food consumption ks02: spices"  ;

. lab var msugar "Monthly food consumption ks02: sugar"  ;

. lab var moil "Monthly food consumption ks02: oil"   ;

. lab var mbeve "Monthly food consumption ks02: beverages" ;

.  lab var maltb "Monthly food consumption ks02: alcohol/tobacco" ;

.  lab var msnack "Monthly food consumption ks02: snacks"  ;

. lab var mfdout "Monthly food consumption ks02: food out of home"  ;

. lab var irice "Monthly food consumption ks03: rice"  ;

. lab var istaple "Monthly food consumption ks03: staple" ;

.   lab var ivege "Monthly food consumption ks03: vegetable, fruit" ;

.  lab var idried "Monthly food consumption ks03: dried food"  ;

. lab var imeat "Monthly food consumption ks03: meat"  ;

. lab var ifish "Monthly food consumption ks03: fish"  ;

. lab var idairy "Monthly food consumption ks03: dairy"  ;

. lab var ispices "Monthly food consumption ks03: spices"  ;

. lab var isugar "Monthly food consumption ks03: sugar"  ;

. lab var ioil "Monthly food consumption ks03: oil"   ;

. lab var ibeve "Monthly food consumption ks03: beverages"  ;

. lab var ialtb "Monthly food consumption ks03: alcohol/tobacco"  ;

. lab var isnack "Monthly food consumption ks03: snacks"  ;

. lab var ifdout "Monthly food consumption ks03: food out of home"  ;

. lab var xrice "Monthly food consumption ks02+ks03: rice"   ;

. lab var xstaple "Monthly food consumption ks02+ks03: staple" ;

.   lab var xvege "Monthly food consumption ks02+ks03: vegetable, fruit" ;

.  lab var xdried "Monthly food consumption ks02+ks03: dried food"  ;

. lab var xmeat "Monthly food consumption ks02+ks03: meat"  ;

. lab var xfish "Monthly food consumption ks02+ks03: fish"  ;

. lab var xdairy "Monthly food consumption ks02+ks03: dairy"  ;

. lab var xspices "Monthly food consumption ks02+ks03: spices"  ;

. lab var xsugar "Monthly food consumption ks02+ks03: sugar"  ;

. lab var xoil "Monthly food consumption ks02+ks03: oil"   ;

. lab var xbeve "Monthly food consumption ks02+ks03: beverages" ;

.  lab var xaltb "Monthly food consumption ks02+ks03: alcohol/tobacco"  ;

. lab var xsnack "Monthly food consumption ks02+ks03: snacks"  ;

. lab var xfdout "Monthly food consumption ks02+ks03: food out of home"  ;

. lab var mfood "Monthly food cons.,market purch. all ks02"  ;

. lab var ifood "Monthly food cons.,own-prod. all ks03"  ;

. *END OF FOOD  ;
. * NON-FOOD FROM KS2TYPE (KS06), MONTHLY  ;
. rename ks06A xutility  ;

. rename ks06B xpersonal  ;

. rename ks06C xhhgood  ;

. rename ks06C1 xdomest  ;

. rename ks06D xrecreat  ;

. rename ks06E xtransp  ;

. rename ks06F1 xlottery  ;

. rename ks06F2 xarisan  ;

. rename ks06G xtransf2  ;

. lab var xutility "Monthly expend. on utility ks06A"  ;

. lab var xpersonal "Monthly expend. on personal goods ks06B"  ;

. lab var xhhgood "Monthly expend. on hh goods ks06C"  ;

. lab var xdomest "Monthly expend. on domestic goods ks06C1"  ;

. lab var xrecreat "Monthly expend. on recreation ks06D"  ;

. lab var xtransp "Monthly expend. on transport. ks06E"  ;

. lab var xlottery "Monthly expend. on lottery ks06F1"  ;

. lab var xarisan "Monthly expend. on arisan ks06F2"  ;

. lab var xtransf2 "Monthly expend. on transfer ks06G"  ;

. rename ks07a inonfood  ;

. lab var inonfood "Monthly non-food own-produce (ks07a)"  ;

. *xnonfood2 IS ALL KS06 EXCLUDING TRANSFER AND ARISAN   ;
. gen xnonfood2=xutility+xpersonal+xhhgood+xdomest+xrecreat+xtransp+xlottery   ;
(139 missing values generated)

. *totks06 IS ALL KS06   ;
. gen totks06=xnonfood2+xtransf2+xarisan  ;
(139 missing values generated)

. lab var xnonfood2 "Monthly non-food expend. ks2type, transfer & arisan excl."  ;

. lab var totks06 "Monthly non-food expend. ks2type, transfer & arisan incl."  ;

. sort hhid07  ;

. *NON-FOOD FROM KS3TYPE (KS08, KS09A), CONVERTED TO MONTHLY FIGURES  ;
. gen mcloth=ks08A/12  ;
(65 missing values generated)

. gen mfurn=ks08B/12  ;
(65 missing values generated)

. gen mmedical=ks08C/12 ;
(65 missing values generated)

.  gen mcerem=ks08D/12  ;
(65 missing values generated)

. gen mtax=ks08E/12  ;
(66 missing values generated)

. gen mother=ks08F/12  ;
(65 missing values generated)

. gen mtransf3=ks08G/12  ;
(65 missing values generated)

. gen icloth=ks09aA/12  ;
(40 missing values generated)

. gen ifurn=ks09aB/12  ;
(40 missing values generated)

. gen imedical=ks09aC/12 ;
(41 missing values generated)

.  gen icerem=ks09aD/12  ;
(40 missing values generated)

. gen iother=ks09aF/12  ;
(40 missing values generated)

. gen xcloth=mcloth+icloth ;
(72 missing values generated)

.  gen xfurn=mfurn+ifurn  ;
(72 missing values generated)

. gen xmedical=mmedical+imedical ;
(73 missing values generated)

.  gen xcerem=mcerem+icerem ;
(72 missing values generated)

.  gen xtax=mtax  ;
(66 missing values generated)

. gen xother=mother+iother  ;
(72 missing values generated)

. gen xtransf3=mtransf3  ;
(65 missing values generated)

.         *xnonfood3 IS ALL KS08 and KS09a EXCLUDING TRANSFER   ;
. gen xnonfood3=xcloth+xfurn+xmedical+xcerem+xtax+xother   ;
(74 missing values generated)

. lab var mcloth "Monthly non-food expend: clothing,ks08A"  ;

. lab var mfurn "Monthly non-food expend: furniture,ks08B"  ;

. lab var mmedical "Monthly non-food expend: medical,ks08C"  ;

. lab var mcerem "Monthly non-food expend: ceremony,ks08D"  ;

. lab var mtax "Monthly non-food expend: tax,ks08E"  ;

. lab var mother "Monthly non-food expend: other,ks08F" ;

.  lab var mtransf3 "Monthly non-food expend: transfer,ks08G" ;

.  lab var icloth "Monthly non-food expend: clothing,ks09aA"  ;

. lab var ifurn "Monthly non-food expend: furniture,ks09aB"  ;

. lab var imedical "Monthly non-food expend: medical,ks09aC"  ;

. lab var icerem "Monthly non-food expend: ceremony,ks09aD" ;

.  lab var iother "Monthly non-food expend: other,ks09aF"  ;

. lab var xcloth "Monthly non-food expend: clothing,ks08A+ks09aA"  ;

. lab var xfurn "Monthly non-food expend: furniture,ks08B+ks09aB"  ;

. lab var xmedical "Monthly non-food expend: medical,ks08C+ks09aC"  ;

. lab var xcerem "Monthly non-food expend: ceremony,ks08D+ks09aD"  ;

. lab var xtax "Monthly non-food expend: tax,ks08E"  ;

. lab var xother "Monthly non-food expend: other,ks08F+ks09aF"  ;

. lab var xtransf3 "Monthly non-food expend: transfer,ks08G"  ;

. lab var xnonfood3 "Monthly non-food expend. ks3type(all ks08,ks09a excl. ks08G)"  ;

. **HOUSING  ;
. gen xhrent=kr04 if kr04ax~=. ;
(11546 missing values generated)

.  gen xhown=kr05 if kr05ax~=.  ;
(1497 missing values generated)

. gen xhouse=kr04 if kr04ax~=.  ;
(11546 missing values generated)

. replace xhouse=kr05 if kr05ax~=.  ;
(11511 real changes made)

. lab var xhrent "Monthly expend. on housing:rent (kr04)"  ;

. lab var xhown "Monthly expend. on housing:own  (kr05)"  ;

. lab var xhouse "Monthly expend. on housing (kr04/kr05)"   ;

. ********  ;
. *EDUCATIOn  ;
. gen xedutuit=ks10aa/12  ;
(31 missing values generated)

. gen xeduunif=ks11aa/12  ;
(31 missing values generated)

. gen xedutran=ks12aa/12  ;
(31 missing values generated)

. gen xeduc=xedutuit+xeduunif+xedutran  ;
(31 missing values generated)

. gen xedutuitout=ks10ab/12 ;
(31 missing values generated)

.  gen xeduunifout=ks11ab/12  ;
(31 missing values generated)

. gen xedutranout=ks12ab/12  ;
(31 missing values generated)

. gen xedubordout=ks12bb/12  ;
(31 missing values generated)

. gen xeducout=xedutuitout+xeduunifout+xedutranout+xedubordout  ;
(31 missing values generated)

. gen xeducall=xeduc+xeducout  ;
(31 missing values generated)

. lab var xedutuit "Monthly expend. on educ.:tuition, ks10aa"  ;

. lab var xeduunif "Monthly expend. on educ.:uniform, ks11aa"  ;

. lab var xedutran "Monthly expend. on educ.:transport, ks12aa"  ;

. lab var xedutuitout "Monthly expend. on educ. out of home:tuition, ks10ab"  ;

. lab var xeduunifout "Monthly expend. on educ. out of home:uniform, ks11ab"  ;

. lab var xedutranout "Monthly expend. on educ. out of home:transport, ks12ab"  ;

. lab var xedubordout "Monthly expend. on educ. out of home:boarding, ks12bb"  ;

. lab var xeduc "Monthly expend. on educ ks10aa-ks12aa"  ;

. lab var xeducout "Monthly expend. on educ, out of home ks10ab-ks12bb"  ;

. lab var xeducall "Monthly expend. on educ, all (ks10aa-ks12bb)"  ;

. *NOTE: FOR CALCULATING HH EXPENDITURE, USE XEDUC (EXPEND. ON KIDS INSIDE THE HOME)   ;
. *********************************  ;
. *MONTHLY EXPENDITURE CATEGORIES  ;
. ******************************  ;
. drop ks02* ks03*  ;

. ***************************************  ;
. * HOUSEHOLD EXPENDITURE: XFOOD + XNONFOOD  ;
. ***************************************  ;
. **FOOD : xfood: total of KS02 and KS03, already generated   ;
. **NONFOOD:xnonfood=xnonfood2+xnonfood3+xhousing+xeduc+inonfood,  ;
. *SO IT IS THE TOTAL OF KS06 WITHOUT ARISAN + TOTAL KS08,KS09 + HOUSING + EDUCATION FOR CHILDREN IN THE HOME ONLY + OWN-PRODUCED NON0-FOOD.
>   ;
. *ks06 w/o arisan, ks08, ks09a, ks10aa-ks12aa, ks07a). Generated below:  ;
. gen xnonfood=xnonfood2+xnonfood3+xhouse+xeduc+inonfood  ;
(212 missing values generated)

. lab var xnonfood "Monthly non-food expenditure"   ;

. ** HHEXP: MONTHLY HOUSEHOLD EXPENDITURE   ;
. gen hhexp=xfood+xnonfood  ;
(350 missing values generated)

. lab var hhexp "Monthly expenditure"  ;

. inspect hhexp  ;

hhexp:  Monthly expenditure                     Number of Observations
---------------------------                 ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #                         Positive       12658      4470       8188
|  #                                        -----     -----      -----
|  #                         Total          12658      4470       8188
|  #   .   .   .   .         Missing          350
+----------------------                     -----
70833.33       2.72e+07                     13008
(More than 99 unique values)

. **********************************  ;
. *OTHER CATEGORIES  ;
. **************************************  ;
. *MONTHLY FOOD CONSUMPTION: FROM KS02,KS03 AND TRANSFER OF FOOD OUT  ;
. gen hhfood=xfood+xfdtout  ;
(221 missing values generated)

. lab var hhfood "Monthly consumption on food (ks02,ks03 AND ks04b)"  ;

. *MONTHLY TRANSFER: FROM KS04B, KS06G, KS8G, AND EDUC FOR KID OUTSIDE THE HOME monthly  ;
. gen xtransfer=xfdtout+xtransf2+xtransf3+xeducout  ;
(172 missing values generated)

. lab var xtransfer "Monthly transfer (from ks04b,ks6G,ks08G,ks10ab-ks12bb)"  ;

. *MONTHLY EXPENDITURES ON HOUSEHOLD EXPENSES   ;
. gen xhhx=xutility+xhhgood+xdomest+xfurn  ;
(178 missing values generated)

. lab var xhhx "Monthly expend. on household expenses"  ;

. *MONTHLY EXPENDITURES ON TRANSPORTATION: xtransp (already generated)  ;
. *MONTHLY EXPENDITURES ON MEDICAL: xmedical (already generated)  ;
. *MONTHLY EXPENDITURES ON ENTERTAINMENT  ;
. gen xentn=xrecreat+xlottery+xcerem  ;
(178 missing values generated)

. lab var xentn "Monthly expend. on entertainment"  ;

. *MONTHLY EXPENDITURES ON DURABLES  ;
. gen xdura=xfurn+xother+xtransf3   ;
(72 missing values generated)

. lab var xdura "Monthly expend. on durables"  ;

. *MONTHLY EXPENDITURES ON CEREMONIES AND TAX  ;
. gen xritax=xcerem+xtax  ;
(73 missing values generated)

. lab var xritax "Monthly expend. on ritual and tax"  ;

. sort hhid07  ;

. drop ks0*   ;

. compress  ;
missing was float now byte

. save $dir0\pce07_wo_hhsize.dta, replace  ;
file E:\PCE\temp\\pce07_wo_hhsize.dta saved

. **************************************************************************************************** ;
. * IX. MERGE WITH HHSIZE.DTA,  DATA FROM AR WITH INFO ON HHSIZE (AR01==1 OR 5) ;
. *************************************************************************************************   ;
. use hhid07 ar00 ar01a if ar01a==1 | ar01a==2 | ar01a==5 | ar01a==11 using $dir7\bk_ar1, clear  ;

. bys hhid07 ar00: keep if _n==_N ;
(0 observations deleted)

. bys hhid07: gen hhsize=_N  ;

. bys hhid07: keep if _n==_N ;
(37073 observations deleted)

. lab var hhsize "HH size"  ;

. sort hhid07  ;

. save $dir0\hhsize07, replace  ;
file E:\PCE\temp\\hhsize07.dta saved

. merge hhid07  using $dir0\pce07_wo_hhsize.dta  ;

. lab var _merge "Expenditure available?"  ;

. lab val _merge _mexp ;

. lab define _mexp 1 "1.Roster only" 2 "2.Expend only" 3 "3.Yes"  ;

. tab _merge   ;

  Expenditure |
   available? |      Freq.     Percent        Cum.
--------------+-----------------------------------
1.Roster only |        499        3.69        3.69
        3.Yes |     13,008       96.31      100.00
--------------+-----------------------------------
        Total |     13,507      100.00

. *keep if _merge==3  ;
. tab missing _merge, m  ;

 Household |
   with at |
   least 1 |
   part of |      Expenditure
expenditur |      available?
 e missing | 1.Roster       3.Yes |     Total
-----------+----------------------+----------
         0 |         0     12,658 |    12,658 
         1 |         0        350 |       350 
         . |       499          0 |       499 
-----------+----------------------+----------
     Total |       499     13,008 |    13,507 


. tab _mkr _merge, m  ;

           |      Expenditure
           |      available?
      _mkr | 1.Roster       3.Yes |     Total
-----------+----------------------+----------
         1 |         0         21 |        21 
         2 |         0         31 |        31 
         3 |         0     12,956 |    12,956 
         . |       499          0 |       499 
-----------+----------------------+----------
     Total |       499     13,008 |    13,507 


. rename _merge _mexp ;

. inspect hhexp   ;

hhexp:  Monthly expenditure                     Number of Observations
---------------------------                 ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #                         Positive       12658      4470       8188
|  #                                        -----     -----      -----
|  #                         Total          12658      4470       8188
|  #   .   .   .   .         Missing          849
+----------------------                     -----
70833.33       2.72e+07                     13507
(More than 99 unique values)

. inspect hhsize  ;

hhsize:  HH size                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #                         Positive       13507     13507          -
|  #                                        -----     -----      -----
|  #                         Total          13507     13507          -
|  #   #   .   .   .         Missing            -
+----------------------                     -----
1                    22                     13507
  (15 unique values)

. *PER CAPITA EXPENDITURES: HHEXP/HHSIZE ;
. gen pce=hhexp/hhsize  ;
(849 missing values generated)

. lab var pce "Per capita expenditure"  ;

. inspect pce  ;

pce:  Per capita expenditure                    Number of Observations
----------------------------                ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #                         Positive       12658      2644      10014
|  #                                        -----     -----      -----
|  #                         Total          12658      2644      10014
|  #   .   .   .   .         Missing          849
+----------------------                     -----
27740          1.36e+07                     13507
(More than 99 unique values)

. sum pce, detail  ;

                   Per capita expenditure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     103023.8          27740
 5%       157850       49733.33
10%     193266.7       49890.48       Obs               12658
25%     278805.5          54125       Sum of Wgt.       12658

50%     438398.6                      Mean           623842.5
                        Largest       Std. Dev.      630132.1
75%     738466.7        9065834
90%      1229667        9337500       Variance       3.97e+11
95%      1693589       1.12e+07       Skewness       4.859061
99%      3148000       1.36e+07       Kurtosis       50.51058

. sum pce if missing==0 , detail  ;

                   Per capita expenditure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     103023.8          27740
 5%       157850       49733.33
10%     193266.7       49890.48       Obs               12658
25%     278805.5          54125       Sum of Wgt.       12658

50%     438398.6                      Mean           623842.5
                        Largest       Std. Dev.      630132.1
75%     738466.7        9065834
90%      1229667        9337500       Variance       3.97e+11
95%      1693589       1.12e+07       Skewness       4.859061
99%      3148000       1.36e+07       Kurtosis       50.51058

. gen lnpce=log(pce)  ;
(849 missing values generated)

. lab var lnpce "Log of per capita expenditure"  ;

. **EXPENDITURE SHARES:  EXPEND. x 100 / HHEXP  ;
. gen wrice=xrice*100/hhexp  ;
(849 missing values generated)

. gen wstaple=xstaple*100/hhexp  ;
(849 missing values generated)

. gen wvege=xvege*100/hhexp  ;
(849 missing values generated)

. gen wfood=xfood*100/hhexp  ;
(849 missing values generated)

. gen woil=xoil*100/hhexp   ;
(849 missing values generated)

. gen wmedical=xmedical*100/hhexp  ;
(849 missing values generated)

. gen wcloth=xcloth*100/hhexp  ;
(849 missing values generated)

. gen wdairy=xdairy*100/hhexp  ;
(849 missing values generated)

. gen weducall=xeducall*100/hhexp  ;
(849 missing values generated)

. gen whous=xhous*100/hhexp  ;
(849 missing values generated)

. gen wmtfs=(xmeat+xfish)*100/hhexp  ;
(849 missing values generated)

. gen wnonfood=xnonfood*100/hhexp  ;
(849 missing values generated)

. gen waltb=xaltb*100/hhexp  ;
(849 missing values generated)

. lab var wrice "Expend. share: rice"  ;

. lab var wstaple "Expend. share: staple food"  ;

. lab var wvege "Expend. share: vegetable"  ;

. lab var woil "Expend. share: oil"  ;

. lab var waltb "Expend. share: alcohol+tobacco"  ;

. lab var wfood "Expend. share: food"  ;

. lab var wmedical "Expend. share: medical cost"  ;

. lab var wcloth "Expend. share: clothing"  ;

. lab var wdairy "Expend. share: dairy"  ;

. lab var weducall "Expend. share: education (all)"  ;

. lab var whous "Expend. share: housing"  ;

. lab var wmtfs "Expend. share: meat+fish"  ;

. lab var wnonfood "Expend. share: nonfood excl.arisan"  ;

. compress  ;
hhsize was float now byte

. tab1 miss*, m ;

-> tabulation of miss4b  

  Household |
       with |
    missing |
      ks04b |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       96.08       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of miss7a  

  Household |
       with |
    missing |
      ks07a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,976       96.07       96.07
          1 |          1        0.01       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of miss10aa  

  Household |
       with |
    missing |
     ks10aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       96.08       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of miss10ab  

  Household |
       with |
    missing |
     ks10ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       96.08       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of miss11aa  

  Household |
       with |
    missing |
     ks11aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       96.08       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of miss11ab  

  Household |
       with |
    missing |
     ks11ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       96.08       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of miss12aa  

  Household |
       with |
    missing |
     ks12aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       96.08       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of miss12ab  

  Household |
       with |
    missing |
     ks12ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       96.08       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of miss12bb  

  Household |
       with |
    missing |
     ks12bb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       96.08       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of missks02  

  Household |
w/ at least |
     1 KS02 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,843       95.08       95.08
          1 |        134        0.99       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of missks03  

  Household |
w/ at least |
     1 KS03 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,888       95.42       95.42
          1 |         89        0.66       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of missks06  

  Household |
w/ at least |
     1 KS06 |
    missing |
 -excluding |
         F2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,869       95.28       95.28
          1 |        108        0.80       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of missks08  

  Household |
w/ at least |
     1 KS08 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,942       95.82       95.82
          1 |         35        0.26       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of missks09  

  Household |
w/ at least |
    1 KS09a |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,967       96.00       96.00
          1 |         10        0.07       96.08
          . |        530        3.92      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of misskr  

  Household |
with missng |
    kr04 or |
       kr05 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,973       96.05       96.05
          1 |         14        0.10       96.15
          . |        520        3.85      100.00
------------+-----------------------------------
      Total |     13,507      100.00

-> tabulation of missing  

  Household |
    with at |
    least 1 |
    part of |
expenditure |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,658       93.71       93.71
          1 |        350        2.59       96.31
          . |        499        3.69      100.00
------------+-----------------------------------
      Total |     13,507      100.00

. drop sc* commid* kabid kecid   origea ;

. sort hhid07 ;

. merge hhid07 using $dir0\sc07 ;
provid07 was byte now float
rural was byte now float

. rename _merge _msc ;

. capture drop origea provid07 ;

. gen provid07=sc010707 ;

. keep hhid07  prov* kabid kecid x* m* i* w* _out* hh* *pce hhsize owners  _mexp commid07 _msc sc05 result07  ;

. gen origea07=1 if (substr(commid07,3,1)=="0" | substr(commid07,3,1)=="1" | substr(commid07,3,1)=="2" | substr(commid07,3,1)=="3" |  substr
> (commid07,3,1)=="4" | /* ;
> */ substr(commid07,3,1)=="5"|  substr(commid07,3,1)=="6"|  substr(commid07,3,1)=="7"|  substr(commid07,3,1)=="8" |  substr(commid07,3,1)==
> "9" ) & /* ;
> */ (substr(commid07,4,1)=="0"|  substr(commid07,4,1)=="1"|  substr(commid07,4,1)=="2"|  substr(commid07,4,1)=="3" |  substr(commid07,4,1)=
> ="4" | /* ;
> */ substr(commid07,4,1)=="5"|  substr(commid07,4,1)=="6"|  substr(commid07,4,1)=="7"|  substr(commid07,4,1)=="8" |  substr(commid07,4,1)==
> "9")  ;
(5039 missing values generated)

. replace origea=0 if origea==. ;
(5039 real changes made)

. lab var origea "In IFLS  EA 07" ;

. *
> replace sc05=2 if commid07=="1314" | commid07=="6309" |commid07=="7310" ;
. replace sc05=1 if commid07=="1206" | commid07=="1604" | commid07=="1611" | commid07=="3231" | commid07=="5201"  | commid07=="7316" ;
(19 real changes made)

. gen rural=(sc05~=1) ;

. for var miss*: replace X=1 if X==. ;

->  replace miss4b=1 if miss4b==.
(559 real changes made)

->  replace miss7a=1 if miss7a==.
(559 real changes made)

->  replace miss10aa=1 if miss10aa==.
(559 real changes made)

->  replace miss10ab=1 if miss10ab==.
(559 real changes made)

->  replace miss11aa=1 if miss11aa==.
(559 real changes made)

->  replace miss11ab=1 if miss11ab==.
(559 real changes made)

->  replace miss12aa=1 if miss12aa==.
(559 real changes made)

->  replace miss12ab=1 if miss12ab==.
(559 real changes made)

->  replace miss12bb=1 if miss12bb==.
(559 real changes made)

->  replace missks02=1 if missks02==.
(559 real changes made)

->  replace missks03=1 if missks03==.
(559 real changes made)

->  replace missks06=1 if missks06==.
(559 real changes made)

->  replace missks08=1 if missks08==.
(559 real changes made)

->  replace missks09=1 if missks09==.
(559 real changes made)

->  replace misskr=1 if misskr==.
(549 real changes made)

->  replace missing=1 if missing==.
(528 real changes made)

. for var _outlier*: replace X=0 if X==. ;

->  replace _outlierks04b=0 if _outlierks04b==.
(559 real changes made)

->  replace _outlierks07a=0 if _outlierks07a==.
(559 real changes made)

->  replace _outlierks10aa=0 if _outlierks10aa==.
(559 real changes made)

->  replace _outlierks10ab=0 if _outlierks10ab==.
(559 real changes made)

->  replace _outlierks11aa=0 if _outlierks11aa==.
(559 real changes made)

->  replace _outlierks11ab=0 if _outlierks11ab==.
(559 real changes made)

->  replace _outlierks12aa=0 if _outlierks12aa==.
(559 real changes made)

->  replace _outlierks12ab=0 if _outlierks12ab==.
(559 real changes made)

->  replace _outlierks12bb=0 if _outlierks12bb==.
(559 real changes made)

->  replace _outlierks0=0 if _outlierks0==.
(559 real changes made)

->  replace _outlierks=0 if _outlierks==.
(559 real changes made)

->  replace _outlierks02=0 if _outlierks02==.
(559 real changes made)

->  replace _outlierks03=0 if _outlierks03==.
(559 real changes made)

->  replace _outlierks06=0 if _outlierks06==.
(559 real changes made)

->  replace _outlierks08=0 if _outlierks08==.
(559 real changes made)

->  replace _outlierks09=0 if _outlierks09==.
(559 real changes made)

->  replace _outlierkr04=0 if _outlierkr04==.
(549 real changes made)

->  replace _outlierkr05=0 if _outlierkr05==.
(549 real changes made)

->  replace _outlierkr=0 if _outlierkr==.
(549 real changes made)

. gen _outlierfood=1 if _outlierks02==1 | _outlierks03==1  ;
(13346 missing values generated)

. replace _outlierfood=0 if _outlierfood==. ;
(13346 real changes made)

. gen _outlier=1 if _outlierks==1 | _outlierkr==1 ;
(13335 missing values generated)

. replace _outlier=0 if _outlier==. ;
(13335 real changes made)

. lab var hhid07 "Household ID 2007" ;

. lab var _msc "SC vars" ;

. lab var result07 "Book K Result" ;

. lab var _outlierfood "Household w/ at least 1 outlier in food exp." ;

. lab var _outlier "Household w/ at least 1 outlier in exp." ;

. rename provid07 provid ;

. rename kabid07 kabid ;

. rename kecid07 kecid ;

. rename origea07 origea ;

. lab var provid "Province ID" ;

. lab var kabid "Kabupaten ID" ;

. lab var kecid "Kecamatan ID" ;

. lab var rural "Urban=0 Rural=1" ;

. compress ;
provid was float now byte
origea was float now byte
rural was float now byte
_outlierfood was float now byte
_outlier was float now byte
kabid was double now int
kecid was double now long

. tab1 miss*, m;

-> tabulation of miss4b  

  Household |
       with |
    missing |
      ks04b |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       95.87       95.87
          1 |        559        4.13      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of miss7a  

  Household |
       with |
    missing |
      ks07a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,976       95.86       95.86
          1 |        560        4.14      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of miss10aa  

  Household |
       with |
    missing |
     ks10aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       95.87       95.87
          1 |        559        4.13      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of miss10ab  

  Household |
       with |
    missing |
     ks10ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       95.87       95.87
          1 |        559        4.13      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of miss11aa  

  Household |
       with |
    missing |
     ks11aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       95.87       95.87
          1 |        559        4.13      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of miss11ab  

  Household |
       with |
    missing |
     ks11ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       95.87       95.87
          1 |        559        4.13      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of miss12aa  

  Household |
       with |
    missing |
     ks12aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       95.87       95.87
          1 |        559        4.13      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of miss12ab  

  Household |
       with |
    missing |
     ks12ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       95.87       95.87
          1 |        559        4.13      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of miss12bb  

  Household |
       with |
    missing |
     ks12bb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,977       95.87       95.87
          1 |        559        4.13      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of missks02  

  Household |
w/ at least |
     1 KS02 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,843       94.88       94.88
          1 |        693        5.12      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of missks03  

  Household |
w/ at least |
     1 KS03 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,888       95.21       95.21
          1 |        648        4.79      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of missks06  

  Household |
w/ at least |
     1 KS06 |
    missing |
 -excluding |
         F2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,869       95.07       95.07
          1 |        667        4.93      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of missks08  

  Household |
w/ at least |
     1 KS08 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,942       95.61       95.61
          1 |        594        4.39      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of missks09  

  Household |
w/ at least |
    1 KS09a |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,967       95.80       95.80
          1 |        569        4.20      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of misskr  

  Household |
with missng |
    kr04 or |
       kr05 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,973       95.84       95.84
          1 |        563        4.16      100.00
------------+-----------------------------------
      Total |     13,536      100.00

-> tabulation of missing  

  Household |
    with at |
    least 1 |
    part of |
expenditure |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,658       93.51       93.51
          1 |        878        6.49      100.00
------------+-----------------------------------
      Total |     13,536      100.00

. keep hhid07 commid07 prov kabid kecid orige x* m* i* w* _out* hh* *pce hhsize owners;

. drop miss*;

. lab data "Per Capita Expenditure 2007"  ;

. sort hhid07  ;

. save $dir09\pce07nom.dta, replace  ;
file E:\PCE\data\\pce07nom.dta saved

. use $dir09\pce07nom.dta, clear ;
(Per Capita Expenditure 2007)

. des  ;

Contains data from E:\PCE\data\\pce07nom.dta
  obs:        13,536                          Per Capita Expenditure 2007
 vars:           143                          25 Aug 2009 11:56
 size:     6,862,752 (79.5% of memory free)
--------------------------------------------------------------------------------------------------------------------------------------------
              storage  display     value
variable name   type   format      label      variable label
--------------------------------------------------------------------------------------------------------------------------------------------
hhid07          str7   %7s                    Household ID 2007
hhsize          byte   %9.0g                  HH size
inonfood        long   %12.0g                 Monthly non-food own-produce (ks07a)
_outlierks04b   byte   %9.0g                  Any outlier in ks04b
_outlierks07a   byte   %9.0g                  Any outlier in ks07a
_outlierks10aa  byte   %9.0g                  Any outlier in ks10aa
_outlierks10ab  byte   %9.0g                  Any outlier in ks10ab
_outlierks11aa  byte   %9.0g                  Any outlier in ks11aa
_outlierks11ab  byte   %9.0g                  Any outlier in ks11ab
_outlierks12aa  byte   %9.0g                  Any outlier in ks12aa
_outlierks12ab  byte   %9.0g                  Any outlier in ks12ab
_outlierks12bb  byte   %9.0g                  Any outlier in ks12bb
hhid07_9        str9   %9s                    2007 household id
_outlierks0     byte   %8.0g                  Any outlier in ks0.dta
_outlierks      byte   %9.0g                  Any outlier in ks
_outlierks02    byte   %9.0g                  Any outlier in ks02
_outlierks03    byte   %9.0g                  Any outlier in ks03
xpersonal       long   %16.0f                 Monthly expend. on personal goods ks06B
xhhgood         long   %16.0f                 Monthly expend. on hh goods ks06C
xdomest         long   %16.0f                 Monthly expend. on domestic goods ks06C1
xrecreat        long   %16.0f                 Monthly expend. on recreation ks06D
xtransp         long   %16.0f                 Monthly expend. on transport. ks06E
xlottery        long   %16.0f                 Monthly expend. on lottery ks06F1
xarisan         long   %16.0f                 Monthly expend. on arisan ks06F2
xtransf2        long   %16.0f                 Monthly expend. on transfer ks06G
_outlierks06    byte   %9.0g                  Any outlier in ks06
xutility        float  %9.0g                  Monthly expend. on utility ks06A
_outlierks08    byte   %9.0g                  Any outlier in ks08
_outlierks09    byte   %9.0g                  Any outlier in ks09
_outlierkr04    byte   %9.0g                  Any outlier in kr04
_outlierkr05    byte   %9.0g                  Any outlier in kr05
owners          byte   %9.0g       owners     Owners or renters?
_outlierkr      byte   %9.0g                  Any outlier in kr
mrice           float  %9.0g                  Monthly food consumption ks02: rice
mstaple         float  %9.0g                  Monthly food consumption ks02: staple
mvege           float  %9.0g                  Monthly food consumption ks02: vegetable, fruit
mdried          float  %9.0g                  Monthly food consumption ks02: dried food
mmeat           float  %9.0g                  Monthly food consumption ks02: meat
mfish           float  %9.0g                  Monthly food consumption ks02: fish
mdairy          float  %9.0g                  Monthly food consumption ks02: dairy
mspices         float  %9.0g                  Monthly food consumption ks02: spices
msugar          float  %9.0g                  Monthly food consumption ks02: sugar
moil            float  %9.0g                  Monthly food consumption ks02: oil
mbeve           float  %9.0g                  Monthly food consumption ks02: beverages
maltb           float  %9.0g                  Monthly food consumption ks02: alcohol/tobacco
msnack          float  %9.0g                  Monthly food consumption ks02: snacks
mfdout          float  %9.0g                  Monthly food consumption ks02: food out of home
irice           float  %9.0g                  Monthly food consumption ks03: rice
istaple         float  %9.0g                  Monthly food consumption ks03: staple
ivege           float  %9.0g                  Monthly food consumption ks03: vegetable, fruit
idried          float  %9.0g                  Monthly food consumption ks03: dried food
imeat           float  %9.0g                  Monthly food consumption ks03: meat
ifish           float  %9.0g                  Monthly food consumption ks03: fish
idairy          float  %9.0g                  Monthly food consumption ks03: dairy
ispices         float  %9.0g                  Monthly food consumption ks03: spices
isugar          float  %9.0g                  Monthly food consumption ks03: sugar
ioil            float  %9.0g                  Monthly food consumption ks03: oil
ibeve           float  %9.0g                  Monthly food consumption ks03: beverages
ialtb           float  %9.0g                  Monthly food consumption ks03: alcohol/tobacco
isnack          float  %9.0g                  Monthly food consumption ks03: snacks
ifdout          float  %9.0g                  Monthly food consumption ks03: food out of home
xrice           float  %9.0g                  Monthly food consumption ks02+ks03: rice
xstaple         float  %9.0g                  Monthly food consumption ks02+ks03: staple
xvege           float  %9.0g                  Monthly food consumption ks02+ks03: vegetable, fruit
xdried          float  %9.0g                  Monthly food consumption ks02+ks03: dried food
xmeat           float  %9.0g                  Monthly food consumption ks02+ks03: meat
xfish           float  %9.0g                  Monthly food consumption ks02+ks03: fish
xdairy          float  %9.0g                  Monthly food consumption ks02+ks03: dairy
xspices         float  %9.0g                  Monthly food consumption ks02+ks03: spices
xsugar          float  %9.0g                  Monthly food consumption ks02+ks03: sugar
xoil            float  %9.0g                  Monthly food consumption ks02+ks03: oil
xbeve           float  %9.0g                  Monthly food consumption ks02+ks03: beverages
xaltb           float  %9.0g                  Monthly food consumption ks02+ks03: alcohol/tobacco
xsnack          float  %9.0g                  Monthly food consumption ks02+ks03: snacks
xfdout          float  %9.0g                  Monthly food consumption ks02+ks03: food out of home
mfood           float  %9.0g                  Monthly food cons.,market purch. all ks02
ifood           float  %9.0g                  Monthly food cons.,own-prod. all ks03
xfdtout         float  %9.0g                  Monthly food transfer, ks04b
xfood           float  %9.0g                  Monthly food consumption, ks02 and ks03
xnonfood2       float  %9.0g                  Monthly non-food expend. ks2type, transfer & arisan excl.
mcloth          float  %9.0g                  Monthly non-food expend: clothing,ks08A
mfurn           float  %9.0g                  Monthly non-food expend: furniture,ks08B
mmedical        float  %9.0g                  Monthly non-food expend: medical,ks08C
mcerem          float  %9.0g                  Monthly non-food expend: ceremony,ks08D
mtax            float  %9.0g                  Monthly non-food expend: tax,ks08E
mother          float  %9.0g                  Monthly non-food expend: other,ks08F
mtransf3        float  %9.0g                  Monthly non-food expend: transfer,ks08G
icloth          float  %9.0g                  Monthly non-food expend: clothing,ks09aA
ifurn           float  %9.0g                  Monthly non-food expend: furniture,ks09aB
imedical        float  %9.0g                  Monthly non-food expend: medical,ks09aC
icerem          float  %9.0g                  Monthly non-food expend: ceremony,ks09aD
iother          float  %9.0g                  Monthly non-food expend: other,ks09aF
xcloth          float  %9.0g                  Monthly non-food expend: clothing,ks08A+ks09aA
xfurn           float  %9.0g                  Monthly non-food expend: furniture,ks08B+ks09aB
xmedical        float  %9.0g                  Monthly non-food expend: medical,ks08C+ks09aC
xcerem          float  %9.0g                  Monthly non-food expend: ceremony,ks08D+ks09aD
xtax            float  %9.0g                  Monthly non-food expend: tax,ks08E
xother          float  %9.0g                  Monthly non-food expend: other,ks08F+ks09aF
xtransf3        float  %9.0g                  Monthly non-food expend: transfer,ks08G
xnonfood3       float  %9.0g                  Monthly non-food expend. ks3type(all ks08,ks09a excl. ks08G)
xhrent          float  %9.0g                  Monthly expend. on housing:rent (kr04)
xhown           float  %9.0g                  Monthly expend. on housing:own (kr05)
xhouse          float  %9.0g                  Monthly expend. on housing (kr04/kr05)
xedutuit        float  %9.0g                  Monthly expend. on educ.:tuition, ks10aa
xeduunif        float  %9.0g                  Monthly expend. on educ.:uniform, ks11aa
xedutran        float  %9.0g                  Monthly expend. on educ.:transport, ks12aa
xeduc           float  %9.0g                  Monthly expend. on educ ks10aa-ks12aa
xedutuitout     float  %9.0g                  Monthly expend. on educ. out of home:tuition, ks10ab
xeduunifout     float  %9.0g                  Monthly expend. on educ. out of home:uniform, ks11ab
xedutranout     float  %9.0g                  Monthly expend. on educ. out of home:transport, ks12ab
xedubordout     float  %9.0g                  Monthly expend. on educ. out of home:boarding, ks12bb
xeducout        float  %9.0g                  Monthly expend. on educ, out of home ks10ab-ks12bb
xeducall        float  %9.0g                  Monthly expend. on educ, all (ks10aa-ks12bb)
xnonfood        float  %9.0g                  Monthly non-food expenditure
hhexp           float  %9.0g                  Monthly expenditure
hhfood          float  %9.0g                  Monthly consumption on food (ks02,ks03 AND ks04b)
xtransfer       float  %9.0g                  Monthly transfer (from ks04b,ks6G,ks08G,ks10ab-ks12bb)
xhhx            float  %9.0g                  Monthly expend. on household expenses
xentn           float  %9.0g                  Monthly expend. on entertainment
xdura           float  %9.0g                  Monthly expend. on durables
xritax          float  %9.0g                  Monthly expend. on ritual and tax
pce             float  %9.0g                  Per capita expenditure
lnpce           float  %9.0g                  Log of per capita expenditure
wrice           float  %9.0g                  Expend. share: rice
wstaple         float  %9.0g                  Expend. share: staple food
wvege           float  %9.0g                  Expend. share: vegetable
wfood           float  %9.0g                  Expend. share: food
woil            float  %9.0g                  Expend. share: oil
wmedical        float  %9.0g                  Expend. share: medical cost
wcloth          float  %9.0g                  Expend. share: clothing
wdairy          float  %9.0g                  Expend. share: dairy
weducall        float  %9.0g                  Expend. share: education (all)
whous           float  %9.0g                  Expend. share: housing
wmtfs           float  %9.0g                  Expend. share: meat+fish
wnonfood        float  %9.0g                  Expend. share: nonfood excl.arisan
waltb           float  %9.0g                  Expend. share: alcohol+tobacco
kabid           int    %10.0g                 Kabupaten ID
kecid           long   %10.0g                 Kecamatan ID
commid07        str4   %4s                    community id 2007
provid          byte   %9.0g                  Province ID
origea          byte   %9.0g                  In IFLS EA 07
_outlierfood    byte   %9.0g                  Household w/ at least 1 outlier in food exp.
_outlier        byte   %9.0g                  Household w/ at least 1 outlier in exp.
--------------------------------------------------------------------------------------------------------------------------------------------
Sorted by:  hhid07

. sum  ;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      hhid07 |         0
      hhsize |     13507    3.744725    1.856064          1         22
    inonfood |     12976    17748.43    181908.4          0   1.50e+07
_outlier~04b |     13536           0           0          0          0
_outlier~07a |     13536    .0024379    .0493171          0          1
-------------+--------------------------------------------------------
_outlier~0aa |     13536    .0033245    .0575644          0          1
_outlier~0ab |     13536    .0020686     .045436          0          1
_outlier~1aa |     13536    .0037677    .0612684          0          1
_outlier~1ab |     13536    .0018469    .0429378          0          1
_outlier~2aa |     13536           0           0          0          0
-------------+--------------------------------------------------------
_outlier~2ab |     13536    .0013298    .0364433          0          1
_outlierk~bb |     13536     .001182    .0343617          0          1
    hhid07_9 |         0
 _outlierks0 |     13536           0           0          0          0
  _outlierks |     13536    .0140366    .1176462          0          1
-------------+--------------------------------------------------------
_outlierks02 |     13536    .0098995    .0990063          0          1
_outlierks03 |     13536    .0065751    .0808227          0          1
   xpersonal |     12869    31180.23    53150.36          0    2000000
     xhhgood |     12869    23461.14    36553.17          0    2250000
     xdomest |     12869    26795.48    216705.2          0    9025000
-------------+--------------------------------------------------------
    xrecreat |     12869    24595.17    179045.6          0    6045000
     xtransp |     12869    108979.5    229002.5          0    5820000
    xlottery |     12869    1338.643     31943.4          0    3000000
     xarisan |     12869    50430.99    176822.8          0    6645000
    xtransf2 |     12869    92692.58    410200.9          0   1.20e+07
-------------+--------------------------------------------------------
_outlierks06 |     13536    .0079787    .0889699          0          1
    xutility |     12869    163175.5      219382          0    5350000
_outlierks08 |     13536    .0025118    .0500569          0          1
_outlierks09 |     13536    .0006649    .0257779          0          1
_outlierkr04 |     13536           0           0          0          0
-------------+--------------------------------------------------------
_outlierkr05 |     13536    .0008126    .0284964          0          1
      owners |     12987    .8874259    .3160837          0          1
  _outlierkr |     13536    .0008126    .0284964          0          1
       mrice |     12843    124241.7    180647.7          0    3900000
     mstaple |     12843    143349.2    190584.1          0    3986667
-------------+--------------------------------------------------------
       mvege |     12843    73163.61    95736.81          0    1824333
      mdried |     12843    68604.03    102897.5          0    4376667
       mmeat |     12843    80807.47    145510.9          0    4255334
       mfish |     12843    57360.22    92997.02          0    1820000
      mdairy |     12843    70514.12    156756.1          0    3960667
-------------+--------------------------------------------------------
     mspices |     12843    53911.48    69205.34          0    2632500
      msugar |     12843    29613.51    47163.13          0    1664000
        moil |     12843    41703.51    73338.85          0    3284667
       mbeve |     12843    35749.08    70085.66          0    3250000
       maltb |     12843    98266.43    155891.2          0    5026667
-------------+--------------------------------------------------------
      msnack |     12843    72492.93    151269.1          0    2903333
      mfdout |     12843    49982.72    154283.6          0    3250000
       irice |     12888    35857.32    85269.96          0    1993333
     istaple |     12888    40610.08    88813.08          0    1993333
       ivege |     12888    17174.75    36419.39          0   736666.7
-------------+--------------------------------------------------------
      idried |     12888    8512.102    35248.19          0    1109333
       imeat |     12888    14606.94    64651.87          0    1408333
       ifish |     12888    7658.519    44916.34          0    2166667
      idairy |     12888    4898.734    27314.91          0    1300000
     ispices |     12888    3619.725    15618.54          0   719333.3
-------------+--------------------------------------------------------
      isugar |     12888    2626.487    20143.74          0    1759333
        ioil |     12888    2462.045    19952.58          0    1668333
       ibeve |     12888    4082.551    20605.55          0   667333.3
       ialtb |     12888    4151.255     34872.8          0    1911000
      isnack |     12888    15657.38     85548.2          0    2517667
-------------+--------------------------------------------------------
      ifdout |     12888    7367.037     63600.1          0    1950000
       xrice |     12787    159918.4    179155.3          0    3900000
     xstaple |     12787    183812.7    191687.3          0    4077667
       xvege |     12787    90429.45    102286.7          0    1945667
      xdried |     12787    77260.38    109673.9          0    4376667
-------------+--------------------------------------------------------
       xmeat |     12787    95525.21    161797.5          0    4580334
       xfish |     12787    64995.41    101795.6          0    2383334
      xdairy |     12787    75465.77    158926.6          0    3960667
     xspices |     12787    57549.67     70567.7          0    2632500
      xsugar |     12787    32289.29    51507.24          0    1806133
-------------+--------------------------------------------------------
        xoil |     12787    44081.01    75860.65          0    3284667
       xbeve |     12787    39838.35    73296.59          0    3280333
       xaltb |     12787    102377.4    160011.1          0    5026667
      xsnack |     12787    87778.13    172763.3          0    2903333
      xfdout |     12787    57400.13    171148.9          0    3250000
-------------+--------------------------------------------------------
       mfood |     12843    875518.3    750931.1          0   1.35e+07
       ifood |     12888    133427.6    229447.5          0    6798784
     xfdtout |     12977    32778.44    154446.5          0    4268334
       xfood |     12787     1008803    790726.5          0   1.46e+07
   xnonfood2 |     12869    379525.6    603997.9          0   1.60e+07
-------------+--------------------------------------------------------
      mcloth |     12943    45392.85    62394.86          0    1000000
       mfurn |     12943    11071.56    49392.09          0    1125000
    mmedical |     12943    39131.56    129586.3          0    2500000
      mcerem |     12943    52941.73    177689.9          0    3359583
        mtax |     12942    11254.68    34088.22          0   858333.3
-------------+--------------------------------------------------------
      mother |     12943    68809.46    346935.3          0    6708334
    mtransf3 |     12943     6720.76    42844.77          0    1416667
      icloth |     12968    5274.047    15221.73          0   416666.7
       ifurn |     12968    757.1972    7352.537          0   263333.3
    imedical |     12967     6412.21    68097.54          0    2500000
-------------+--------------------------------------------------------
      icerem |     12968    7020.408    70017.93          0    1666667
      iother |     12968    2517.392    36172.15          0    1695833
      xcloth |     12936    50618.32    64798.05          0    1000000
       xfurn |     12936    11774.46    50106.77          0    1125000
    xmedical |     12935     45556.3      154165          0    3333333
-------------+--------------------------------------------------------
      xcerem |     12936    59583.08    211444.8          0    4583333
        xtax |     12942    11254.68    34088.22          0   858333.3
      xother |     12936    71299.45    348647.5          0    6708334
    xtransf3 |     12943     6720.76    42844.77          0    1416667
   xnonfood3 |     12934    250054.3    504360.4          0    7791667
-------------+--------------------------------------------------------
      xhrent |      1462    209950.3    250687.3   208.3333    4000000
       xhown |     11511    240672.9      658353          0   2.00e+07
      xhouse |     12973    237210.6    625900.7          0   2.00e+07
    xedutuit |     12977    35510.94    128836.2          0    3500000
    xeduunif |     12977    16186.69     45117.4          0    2166667
-------------+--------------------------------------------------------
    xedutran |     12977    60331.85      128808          0    2500000
       xeduc |     12977    112029.5    238483.7          0    3716667
 xedutuitout |     12977    10875.41    102673.2          0    4416667
 xeduunifout |     12977    3287.456    38402.46          0    2500000
 xedutranout |     12977    11850.56    106991.5          0    4166667
-------------+--------------------------------------------------------
 xedubordout |     12977    6629.896    65784.49          0    3200000
    xeducout |     12977    32643.32      242923          0   1.16e+07
    xeducall |     12977    144672.8    349012.2          0   1.26e+07
    xnonfood |     12796    980910.9     1285364      15500   2.32e+07
       hhexp |     12658     1978169     1802611   70833.33   2.72e+07
-------------+--------------------------------------------------------
      hhfood |     12787     1040991    840116.5          0   1.46e+07
   xtransfer |     12836    162461.9    523355.2          0   1.22e+07
        xhhx |     12830    222715.7    362169.6          0    9574000
       xentn |     12830    84916.23      286435          0    6416667
       xdura |     12936    89762.87    365269.6          0    6750000
-------------+--------------------------------------------------------
      xritax |     12935    70818.14    218430.5          0    4604167
         pce |     12658    623842.5    630132.1      27740   1.36e+07
       lnpce |     12658     13.0499    .7280498   10.23063   16.42661
       wrice |     12658    10.69514     10.0201          0   71.62481
     wstaple |     12658    12.12584    10.49263          0   72.97736
-------------+--------------------------------------------------------
       wvege |     12658    5.049958    3.916797          0    52.9743
       wfood |     12658    56.15555    16.37716          0    98.2906
        woil |     12658    2.588344    2.427803          0   49.38242
    wmedical |     12658    1.959367    4.926451          0   78.28503
      wcloth |     12658    2.602724    2.141188          0   37.07253
-------------+--------------------------------------------------------
      wdairy |     12658    3.341475    4.173204          0   57.43941
    weducall |     12658    6.359104    11.33818          0   166.9409
       whous |     12658    11.13703    10.48087          0   95.70141
       wmtfs |     12658    8.295035    6.548334          0   74.96072
    wnonfood |     12658    43.84445    16.37716   1.709402        100
-------------+--------------------------------------------------------
       waltb |     12658    5.676951    7.047694          0   90.99502
       kabid |     13536    3494.665    1514.958       1106       7605
       kecid |     13536     3494745     1514954    1106031    7605030
    commid07 |         0
      provid |     13536    34.66681    15.19945         11         76
-------------+--------------------------------------------------------
      origea |     13536    .6277335    .4834268          0          1
_outlierfood |     13536    .0140366    .1176462          0          1
    _outlier |     13536    .0148493     .120954          0          1

. log close  ;
       log:  E:\PCE\logfile\pce07.log
  log type:  text
 closed on:  25 Aug 2009, 11:56:07
--------------------------------------------------------------------------------------------------------------------------------------------
