--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
       log:  C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\logfile\\pce97.log
  log type:  text
 opened on:  25 Jul 2007, 16:27:39

. ****************************************************************************;
. * I. Create a file with kecamatan ID, kabupaten ID, etc;
. ****************************************************************************;
. use commid93 result93 if result93==1 using $dir2\htrack, clear;
(HH-level tracking across waves )

. bys commid93: keep if _n==_N;
(6912 observations deleted)

. gen str4 commid=commid93;

. sort commid;

. save $dir0\origea93, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\origea93.dta saved

. use sc01_97 sc02_97 sc03_97 sc05_97 commid97 hhid97 mover97 result97 if result97==1 using $dir2\htrack.dta, clear;
(HH-level tracking across waves )

. gen kecid=(sc01_97*100000)+(sc02_97*1000)+(sc03_97);

. gen kabid=(sc01_97*100)+(sc02_97);

. rename sc01_97 provid;

. keep if mover97~=.;
(0 observations deleted)

. gen str4 commid=commid97;

. sort commid;

. merge commid using $dir0\origea93;
variable commid does not uniquely identify observations in the master data

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        905       11.88       11.88
          2 |          1        0.01       11.89
          3 |      6,714       88.11      100.00
------------+-----------------------------------
      Total |      7,620      100.00

. drop if _merge==2;
(1 observation deleted)

. gen byte origea=(_merge==3);

. lab var origea "Original IFLS EA";

. lab var kabid "Kabupaten ID";

. lab var kecid "Kecamatan ID";

. drop _merge commid;

. sort hhid;

. compress;
kabid was float now int

. save $dir0\hhlist1997, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\hhlist1997.dta saved

. ****************************************************************************;
. * II. Housing Expenditures, Book KR (B2_KR.DTA);
. ****************************************************************************;
. #delimit ;
delimiter now ;
. * II.1 Identify outliers;
. ****************************************************************************;
. use hhid kr03 kr04* kr05* using  $dir2\b2_kr, clear;
(Bk 2 Housing characs )

. format kr04 kr05 %12.0f;

. tab1 kr04 kr05;

-> tabulation of kr04  

    Monthly |
   rent, Rp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3        0.56        0.56
        150 |          1        0.19        0.75
        250 |          1        0.19        0.93
        400 |          1        0.19        1.12
        454 |          1        0.19        1.31
        750 |          1        0.19        1.50
       1500 |          1        0.19        1.68
       1700 |          1        0.19        1.87
       2000 |          3        0.56        2.43
       2500 |          2        0.37        2.80
       2916 |          1        0.19        2.99
       3000 |          2        0.37        3.36
       3500 |          2        0.37        3.74
       3750 |          1        0.19        3.93
       4000 |          2        0.37        4.30
       5000 |          8        1.50        5.79
       6000 |          3        0.56        6.36
       6250 |          3        0.56        6.92
       7000 |          2        0.37        7.29
       7500 |          4        0.75        8.04
       8000 |          5        0.93        8.97
       8300 |          2        0.37        9.35
       8333 |          2        0.37        9.72
       8350 |          1        0.19        9.91
       8400 |          1        0.19       10.09
       9000 |          2        0.37       10.47
       9600 |          1        0.19       10.65
      10000 |         11        2.06       12.71
      11000 |          2        0.37       13.08
      12000 |          2        0.37       13.46
      12500 |         10        1.87       15.33
      13000 |          2        0.37       15.70
      14583 |          1        0.19       15.89
      15000 |         19        3.55       19.44
      16000 |          1        0.19       19.63
      16500 |          2        0.37       20.00
      16600 |          2        0.37       20.37
      16666 |          1        0.19       20.56
      16700 |          2        0.37       20.93
      17000 |          6        1.12       22.06
      17500 |          1        0.19       22.24
      18000 |          1        0.19       22.43
      18300 |          1        0.19       22.62
      20000 |         20        3.74       26.36
      20800 |          2        0.37       26.73
      20850 |          1        0.19       26.92
      21000 |          7        1.31       28.22
      22500 |          1        0.19       28.41
      22916 |          1        0.19       28.60
      23000 |          1        0.19       28.79
      25000 |         40        7.48       36.26
      27000 |          2        0.37       36.64
      27500 |          1        0.19       36.82
      28000 |          1        0.19       37.01
      29000 |          6        1.12       38.13
      29100 |          2        0.37       38.50
      30000 |         32        5.98       44.49
      32000 |          1        0.19       44.67
      32500 |          1        0.19       44.86
      33000 |          1        0.19       45.05
      33300 |          3        0.56       45.61
      33333 |          1        0.19       45.79
      33500 |          2        0.37       46.17
      35000 |         18        3.36       49.53
      36000 |          1        0.19       49.72
      37500 |          5        0.93       50.65
      40000 |         23        4.30       54.95
      41000 |          3        0.56       55.51
      41600 |          1        0.19       55.70
      41666 |          1        0.19       55.89
      41667 |          1        0.19       56.07
      42000 |          6        1.12       57.20
      42500 |          1        0.19       57.38
      45000 |         12        2.24       59.63
      50000 |         37        6.92       66.54
      53000 |          1        0.19       66.73
      54200 |          1        0.19       66.92
      55000 |          3        0.56       67.48
      58000 |          3        0.56       68.04
      58350 |          1        0.19       68.22
      58500 |          1        0.19       68.41
      60000 |         27        5.05       73.46
      62500 |          5        0.93       74.39
      65000 |          6        1.12       75.51
      66000 |          2        0.37       75.89
      66500 |          1        0.19       76.07
      66700 |          2        0.37       76.45
      67000 |          2        0.37       76.82
      70000 |         10        1.87       78.69
      70800 |          1        0.19       78.88
      71000 |          1        0.19       79.07
      75000 |         10        1.87       80.93
      78333 |          1        0.19       81.12
      80000 |         13        2.43       83.55
      83000 |          3        0.56       84.11
      83300 |          3        0.56       84.67
      83333 |          2        0.37       85.05
      85000 |          3        0.56       85.61
      90000 |          4        0.75       86.36
      95000 |          1        0.19       86.54
     100000 |         16        2.99       89.53
     105000 |          1        0.19       89.72
     110000 |          2        0.37       90.09
     115000 |          1        0.19       90.28
     117500 |          1        0.19       90.47
     120000 |          1        0.19       90.65
     125000 |          9        1.68       92.34
     130000 |          1        0.19       92.52
     140000 |          1        0.19       92.71
     150000 |          3        0.56       93.27
     154000 |          1        0.19       93.46
     166000 |          2        0.37       93.83
     167000 |          2        0.37       94.21
     170000 |          2        0.37       94.58
     200000 |          9        1.68       96.26
     225000 |          2        0.37       96.64
     250000 |          5        0.93       97.57
     280000 |          1        0.19       97.76
     291600 |          1        0.19       97.94
     333000 |          1        0.19       98.13
     333300 |          2        0.37       98.50
     333333 |          1        0.19       98.69
     400000 |          1        0.19       98.88
     500000 |          1        0.19       99.07
     583333 |          1        0.19       99.25
     600000 |          2        0.37       99.63
    1666666 |          1        0.19       99.81
    3000000 |          1        0.19      100.00
------------+-----------------------------------
      Total |        535      100.00

-> tabulation of kr05  

 Rent would |
        pay |
monthly, Rp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         43        0.77        0.77
          5 |          1        0.02        0.79
        250 |          1        0.02        0.81
        350 |          1        0.02        0.82
       1000 |          8        0.14        0.97
       1500 |          5        0.09        1.06
       2000 |         26        0.47        1.52
       2100 |          2        0.04        1.56
       2430 |          1        0.02        1.57
       2500 |         13        0.23        1.81
       3000 |         15        0.27        2.08
       3500 |          2        0.04        2.11
       4000 |         18        0.32        2.43
       4100 |          1        0.02        2.45
       4150 |          1        0.02        2.47
       4200 |          1        0.02        2.49
       4500 |          4        0.07        2.56
       5000 |        237        4.24        6.80
       5800 |          1        0.02        6.82
       6000 |         17        0.30        7.12
       6250 |          3        0.05        7.17
       6500 |          2        0.04        7.21
       7000 |         15        0.27        7.48
       7500 |         12        0.21        7.69
       8000 |         21        0.38        8.07
       8300 |          4        0.07        8.14
       8350 |          2        0.04        8.18
       8500 |         12        0.21        8.39
       9000 |          4        0.07        8.46
       9500 |          1        0.02        8.48
      10000 |        551        9.86       18.34
      10500 |          1        0.02       18.36
      11000 |          1        0.02       18.38
      12000 |          7        0.13       18.50
      12500 |         54        0.97       19.47
      14000 |          1        0.02       19.48
      15000 |        385        6.89       26.37
      16000 |         11        0.20       26.57
      16500 |          1        0.02       26.59
      16600 |         11        0.20       26.78
      16667 |          1        0.02       26.80
      16700 |          6        0.11       26.91
      17000 |         34        0.61       27.52
      17500 |          2        0.04       27.55
      18000 |          1        0.02       27.57
      20000 |        436        7.80       35.37
      20500 |          1        0.02       35.39
      20800 |          5        0.09       35.48
      20850 |          1        0.02       35.50
      21000 |         14        0.25       35.75
      22900 |          1        0.02       35.77
      23000 |          1        0.02       35.78
      23500 |          1        0.02       35.80
      25000 |        530        9.48       45.29
      26000 |          2        0.04       45.32
      28000 |          1        0.02       45.34
      29000 |          6        0.11       45.45
      29200 |          2        0.04       45.48
      30000 |        421        7.53       53.01
      33000 |         14        0.25       53.27
      33300 |          3        0.05       53.32
      33500 |          3        0.05       53.37
      35000 |         52        0.93       54.30
      37450 |          1        0.02       54.32
      37500 |         10        0.18       54.50
      40000 |        160        2.86       57.36
      41000 |          8        0.14       57.51
      41500 |          4        0.07       57.58
      41600 |         12        0.21       57.79
      41670 |          1        0.02       57.81
      41700 |          3        0.05       57.86
      42000 |         25        0.45       58.31
      45000 |         23        0.41       58.72
      45800 |          1        0.02       58.74
      50000 |        660       11.81       70.55
      54170 |          1        0.02       70.57
      55000 |          3        0.05       70.62
      58000 |         12        0.21       70.84
      58333 |          3        0.05       70.89
      58500 |          2        0.04       70.93
      59000 |          1        0.02       70.94
      60000 |         91        1.63       72.57
      62500 |         15        0.27       72.84
      65000 |          3        0.05       72.89
      66000 |          5        0.09       72.98
      66500 |          1        0.02       73.00
      67000 |          2        0.04       73.04
      70000 |         30        0.54       73.57
      75000 |        119        2.13       75.70
      80000 |         41        0.73       76.44
      83000 |         14        0.25       76.69
      83300 |          5        0.09       76.78
      83333 |          2        0.04       76.81
      83500 |          1        0.02       76.83
      84000 |          3        0.05       76.88
      85000 |         20        0.36       77.24
      90000 |          7        0.13       77.37
      95000 |          2        0.04       77.40
     100000 |        356        6.37       83.77
     120000 |         21        0.38       84.15
     125000 |         68        1.22       85.36
     130000 |          4        0.07       85.44
     140000 |          1        0.02       85.45
     150000 |        145        2.59       88.05
     160000 |          6        0.11       88.16
     165000 |          4        0.07       88.23
     166000 |          5        0.09       88.32
     166600 |          1        0.02       88.33
     166660 |          1        0.02       88.35
     166700 |          1        0.02       88.37
     167000 |          8        0.14       88.51
     170000 |          8        0.14       88.66
     175000 |          3        0.05       88.71
     180000 |          5        0.09       88.80
     200000 |        154        2.76       91.55
     208000 |          6        0.11       91.66
     208333 |          1        0.02       91.68
     210000 |          3        0.05       91.73
     225000 |          3        0.05       91.79
     240000 |          2        0.04       91.82
     250000 |         70        1.25       93.08
     300000 |         83        1.49       94.56
     330000 |          3        0.05       94.61
     333000 |          2        0.04       94.65
     333333 |          1        0.02       94.67
     340000 |          1        0.02       94.69
     350000 |         10        0.18       94.86
     360000 |          3        0.05       94.92
     400000 |         25        0.45       95.37
     417000 |          3        0.05       95.42
     420000 |          2        0.04       95.46
     425000 |          1        0.02       95.47
     450000 |          2        0.04       95.51
     500000 |         76        1.36       96.87
     550000 |          1        0.02       96.89
     600000 |         15        0.27       97.16
     625000 |          4        0.07       97.23
     667000 |          1        0.02       97.24
     700000 |          6        0.11       97.35
     750000 |          4        0.07       97.42
     800000 |          6        0.11       97.53
     850000 |          3        0.05       97.58
     900000 |          2        0.04       97.62
    1000000 |         37        0.66       98.28
    1200000 |          1        0.02       98.30
    1250000 |          2        0.04       98.34
    1350000 |          1        0.02       98.35
    1500000 |         13        0.23       98.59
    1600000 |          1        0.02       98.60
    1680000 |          1        0.02       98.62
    1700000 |          2        0.04       98.66
    1800000 |          1        0.02       98.68
    2000000 |         19        0.34       99.02
    2400000 |          1        0.02       99.03
    2500000 |          6        0.11       99.14
    3000000 |          6        0.11       99.25
    3500000 |          1        0.02       99.27
    3600000 |          1        0.02       99.28
    4000000 |          2        0.04       99.32
    4200000 |          1        0.02       99.34
    5000000 |          8        0.14       99.48
    5700000 |          1        0.02       99.50
    6000000 |          2        0.04       99.53
    7000000 |          2        0.04       99.57
    8000000 |          1        0.02       99.59
   10000000 |          6        0.11       99.70
   15000000 |          7        0.13       99.82
   20000000 |          2        0.04       99.86
   30000000 |          1        0.02       99.87
   33600000 |          1        0.02       99.89
   50000000 |          2        0.04       99.93
   60000000 |          1        0.02       99.95
   85000000 |          1        0.02       99.96
  100000000 |          1        0.02       99.98
  200000000 |          1        0.02      100.00
------------+-----------------------------------
      Total |      5,589      100.00

. sort hhid;

. gen _outlierkr04=1 if kr04>1666666 & kr04~=.;
(7598 missing values generated)

. gen _outlierkr05=1 if kr05>100000000 & kr05~=.;
(7598 missing values generated)

. replace kr04=. if _outlierkr04==1;
(1 real change made, 1 to missing)

. replace kr05=. if _outlierkr05==1;
(1 real change made, 1 to missing)

. mvencode _outlierkr04, mv(0);
_outlierkr04: 7598 missing values recoded

. mvencode _outlierkr05, mv(0);
_outlierkr05: 7598 missing values recoded

. list hhid kr04 kr05 if _outlierkr04==1 | _outlierkr05==1;

      +-----------------------+
      |  hhid97   kr04   kr05 |
      |-----------------------|
2205. | 1030200      .      . |
5938. | 2551600      .      . |
      +-----------------------+

. sort hhid;

. save $dir0\tempkr97, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\tempkr97.dta saved

. * II.2 Merge with kecid, kabid, information;
. ****************************************************************************;
. use hhid sc05_97 commid97 kecid kabid provid origea using $dir0\hhlist1997, clear;
(HH-level tracking across waves )

. sort hhid;

. merge hhid using $dir0\tempkr97;

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         20        0.26        0.26
          3 |      7,599       99.74      100.00
------------+-----------------------------------
      Total |      7,619      100.00

. *Only keep HHs who answered Book 2;
. keep if _merge==3;
(20 observations deleted)

. drop _merge;

. tab kr04x;

    Monthly |
 rent (able |
       ans) |      Freq.     Percent        Cum.
------------+-----------------------------------
    1.Given |        535       98.35       98.35
       8.DK |          9        1.65      100.00
------------+-----------------------------------
      Total |        544      100.00

. tab kr05x;

 Rent would |
pay monthly |
   (able an |      Freq.     Percent        Cum.
------------+-----------------------------------
    1.Given |      5,589       79.22       79.22
       8.DK |      1,466       20.78      100.00
------------+-----------------------------------
      Total |      7,055      100.00

. * II.3 Generate median variables ;
. ****************************************************************************;
. egen medcom05=median(kr05), by(commid97);
(227 missing values generated)

. egen medkec05=median(kr05), by(kecid);
(169 missing values generated)

. egen medkab05=median(kr05), by(kabid);
(12 missing values generated)

. egen medcom04=median(kr04), by(commid97);
(5079 missing values generated)

. egen medkec04=median(kr04), by(kecid);
(4470 missing values generated)

. egen medkab04=median(kr04), by(kabid);
(2003 missing values generated)

. compress;
_outlierkr04 was float now byte
_outlierkr05 was float now byte

. * II.4. Imputation;
.  ****************************************************************************;
. rename kr04 origkr04;

. rename kr05 origkr05;

. gen kr04=origkr04 if kr04x~=. & origkr04~=.;
(7065 missing values generated)

. replace kr04=medcom04 if origea==1 & kr04x~=. & origkr04==.;
(7 real changes made)

. replace kr04=medkec04 if kr04x~=. & kr04==.;
(2 real changes made)

. replace kr04=medkab04 if kr04x~=. & kr04==.;
(0 real changes made)

. gen kr05=origkr05 if kr05x~=. & origkr05~=.;
(2011 missing values generated)

. replace kr05=medcom05 if origea==1 & kr05x~=. & origkr05==.;
(1317 real changes made)

. replace kr05=medkec05 if kr05x~=. & kr05==.;
(74 real changes made)

. replace kr05=medkab05 if kr05x~=. & kr05==.;
(69 real changes made)

. ********************* START OF "MANUAL" IMPUTATION  OF KR04 AND KR05 ********************************************************;
. replace kr04=medkab04 if origkr04==. & kr04x~=1 & comm=="3129";
(13 real changes made)

. replace kr04=medkab04 if origkr04==. & kr04x~=1 & comm=="3134";
(23 real changes made)

. replace kr04=medkab04 if origkr04==. & kr04x~=1 & comm=="3248";
(11 real changes made)

. replace kr04=medkab04 if origkr04==. & kr04x~=1 & comm=="3249";
(6 real changes made)

. replace kr04=medkab04 if origkr04==. & kr04x~=1 & comm=="3543";
(12 real changes made)

. replace kr04=medkab04 if origkr04==. & kr04x~=1 & comm=="31AH";
(3 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="1610";
(7 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3117";
(6 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3243";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3250";
(1 real change made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3336";
(9 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3401";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3404";
(12 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3405";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3407";
(11 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3504";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="3538";
(9 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="12EG";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="13AJ";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="13B4";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="13BV";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="16A6";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="16AJ";
(1 real change made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="16BO";
(1 real change made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="16DA";
(1 real change made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="31AW";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="31AX";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="32AN";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="32GI";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="32I1";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="32K3";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="32K6";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="32LC";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="32LJ";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="32NI";
(1 real change made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="33NE";
(1 real change made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="35A3";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="35BS";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="35C5";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="35FX";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="35KL";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="35N0";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="35N8";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="51AY";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="51BI";
(1 real change made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="52A6";
(1 real change made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="52BX";
(2 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="63C1";
(1 real change made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="63C3";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="73AG";
(0 real changes made)

. replace kr05=medkec05 if origkr05==. & kr05x~=1 & comm=="73CV";
(0 real changes made)

. replace kr05=medcom05 if origkr05==. & kr05x~=1 & comm=="5115";
(3 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="1201";
(14 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="1202";
(4 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="1210";
(20 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="1212";
(10 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3112";
(9 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3122";
(12 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3127";
(9 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3207";
(3 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3237";
(4 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3239";
(9 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3249";
(4 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3418";
(3 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3543";
(7 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3544";
(2 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="3545";
(6 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="5204";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="12AT";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="12CH";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="12D4";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="12E1";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="12EK";
(2 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="12EX";
(2 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="12EY";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="12FC";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="12GY";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="13B7";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="13DA";
(3 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="16AI";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="16AL";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="16AR";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="16BA";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="16C2";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="18AD";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="18AJ";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="18AT";
(2 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="18AV";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="18CI";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="31AD";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="31AR";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="31BD";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32AM";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32B1";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32CK";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32D9";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32EG";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32F9";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32FO";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32GJ";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32G2";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32GP";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32GS";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32IK";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32JR";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32K2";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32KV";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32L4";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32LE";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32M5";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32MZ";
(2 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32N1";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32NL";
(2 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32NS";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="32OY";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="33B7";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="33E8";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="33IL";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="33K7";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="33N0";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="33N6";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="33OJ";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="33OL";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="33OR";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="34AA";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="34AS";
(2 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="34B2";
(2 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="34BS";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="34BX";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35A7";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35AU";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35BT";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35C9";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35EV";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35F4";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35FQ";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35FY";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35G7";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35GW";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35HM";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35IS";
(2 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35IU";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35KM";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35LK";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35LO";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35MJ";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35N7";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35OH";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="35RA";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="63AA";
(0 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="63AE";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="63CM";
(3 real changes made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="73CW";
(1 real change made)

. replace kr05=medkab05 if origkr05==. & kr05x~=1 & comm=="73EM";
(0 real changes made)

. ********************* END OF "MANUAL" IMPUTATION  OF KR04 AND KR05 ********************************************************;
. gen  owners=(kr05x~=.);

. lab define owners 1 "Owners" 0 "Renters";

. lab value owners owners;

. lab var owners "Owner or Renter?";

. replace kr04=. if _outlierkr04==1;
(1 real change made, 1 to missing)

. replace kr05=. if _outlierkr05==1;
(1 real change made, 1 to missing)

. gen _outlierkr=(_outlierkr04==1 | _outlierkr05==1);

. lab var _outlierkr04 "Any outlier in kr04";

. lab var _outlierkr05 "Any outlier in kr05";

. lab var _outlierkr "Any outlier in kr";

. * II.5 Generate variable containing information on missing values in this data file ;
. ****************************************************************************;
. gen misskr=1 if kr04==. & kr04x~=.;
(7597 missing values generated)

. replace misskr=1 if kr05==. & kr05x~=.;
(8 real changes made)

. replace misskr=0 if misskr==.;
(7589 real changes made)

. lab var misskr "Household w/ missing kr04/kr05";

.  tab misskr, m;

  Household |
 w/ missing |
  kr04/kr05 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,589       99.87       99.87
          1 |         10        0.13      100.00
------------+-----------------------------------
      Total |      7,599      100.00

. * II.6 Label, compress, sort, and save the data;
. ****************************************************************************;
. lab data "KR with imputed values";

. compress;
owners was float now byte
_outlierkr was float now byte
misskr was float now byte

. sort hhid ;

. drop med* origk*;

. save $dir0\b2_kr97, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\b2_kr97.dta saved

. ****************************************************************************;
. * III. Book 1 - KS  Food Consumption: KS02, KS03;
. ****************************************************************************;
. * III.1 Identify outliers;
. ****************************************************************************;
. use hhid ks02 ks03 ks1type using $dir2\b1_ks1, clear;
(Bk 1 Consumption (2)-Food )

. format ks02 ks03 %12.0f;

. compress;

. gen byte y=1 if ks1type=="J" & ks02>70000 & ks02~=. ;
(279904 missing values generated)

. replace y=1  if ks1type=="N" & ks02>75000 & ks02~=. ;
(1 real change made)

. replace y=1 if ks1type=="V" & ks02>211300 & ks02~=. ;
(1 real change made)

. list hhid ks1type ks02 if y==1;

        +----------------------------+
        |  hhid97   ks1type     ks02 |
        |----------------------------|
 98477. | 1240511         J   606000 |
 98481. | 1240511         N   551000 |
 98490. | 1240511         V   863850 |
        +----------------------------+

. replace ks02=. if y==1;
(3 real changes made, 3 to missing)

. gen byte z=1 if ks1type=="E" & ks03>14000 & ks03~=.;
(279904 missing values generated)

. replace z=1 if ks1type=="G" & ks03>28000 & ks03~=.;
(1 real change made)

. replace z=1 if ks1type=="J" & ks03>100000 & ks03~=.;
(1 real change made)

. replace z=1 if ks1type=="L" & ks03>48000 & ks03~=.;
(2 real changes made)

. list hhid ks1type ks03 if z==1;

        +----------------------------+
        |  hhid97   ks1type     ks03 |
        |----------------------------|
 41869. | 0480111         L   195000 |
 42017. | 0480600         L   722000 |
 66176. | 0800912         J   500000 |
 98466. | 1240511         E   120250 |
176466. | 2091300         G    64000 |
        +----------------------------+

. replace ks03=. if z==1;
(5 real changes made, 5 to missing)

. bys hhid: egen _outlierks02=max(y);
(279868 missing values generated)

. bys hhid: egen _outlierks03=max(z);
(279720 missing values generated)

. mvencode _outlierks02, mv(0);
_outlierks02: 279868 missing values recoded

. mvencode _outlierks03, mv(0);
_outlierks03: 279720 missing values recoded

. lab var _outlierks02 "Any outlier in ks02";

. lab var _outlierks03 "Any outlier in ks03";

. tab1 _outlierks02 _outlierks03;

-> tabulation of _outlierks02  

Any outlier |
    in ks02 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    279,868       99.99       99.99
          1 |         37        0.01      100.00
------------+-----------------------------------
      Total |    279,905      100.00

-> tabulation of _outlierks03  

Any outlier |
    in ks03 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    279,720       99.93       99.93
          1 |        185        0.07      100.00
------------+-----------------------------------
      Total |    279,905      100.00

. drop y  z ;

. sort hhid;

. * III.2. Reshape b1_ks1.dta from long to wide;
. ****************************************************************************;
. reshape wide ks02 ks03, i(hhid) j(ks1type) string;
(note: j = A AA B BA C CA D DA E EA F FA G GA H HA I IA IB J K L M N OA OB P Q R S T U V W X Y Z)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   279905   ->    7565
Number of variables                   6   ->      77
j variable (37 values)          ks1type   ->   (dropped)
xij variables:
                                   ks02   ->   ks02A ks02AA ... ks02Z
                                   ks03   ->   ks03A ks03AA ... ks03Z
-----------------------------------------------------------------------------

. gen _outlierks=(_outlierks02==1 | _outlierks03==1);

. lab var _outlierks02 "Any outlier in ks02";

. lab var _outlierks03 "Any outlier in ks03";

. lab var _outlierks "Any outlier in ks";

. aorder;

. sort hhid;

. save $dir0\b1_ks197wide, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\b1_ks197wide.dta saved

. compress;
_outlierks was float now byte
_outlierks02 was float now byte
_outlierks03 was float now byte
ks02B was long now int
ks02GA was long now int
ks02OA was long now int
ks02T was long now int
ks02U was long now int
ks03B was long now int
ks03C was long now int
ks03CA was long now int
ks03DA was long now int
ks03E was long now int
ks03EA was long now int
ks03FA was long now int
ks03G was long now int
ks03GA was long now int
ks03I was long now int
ks03N was long now int
ks03OA was long now int
ks03OB was long now int
ks03P was long now int
ks03R was long now int
ks03S was long now int
ks03T was long now int
ks03U was long now int
ks03V was long now int
ks03W was long now int
ks03X was long now int
ks03Y was long now int
ks03Z was long now int

. * III.3. Merge with kecamatan ID, etc;
. ****************************************************************************;
. use hhid commid97 kecid kabid origea provid using $dir0\hhlist1997, clear;
(HH-level tracking across waves )

. sort hhid;

. merge hhid using $dir0\b1_ks197wide;

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         54        0.71        0.71
          3 |      7,565       99.29      100.00
------------+-----------------------------------
      Total |      7,619      100.00

. keep if _merge==3;
(54 observations deleted)

. drop _merge;

. * III.4. Generate median variables;
. ****************************************************************************;
. for var ks*: egen medcomX=median(X), by(commid97);

->  egen medcomks02A=median(ks02A), by(commid97)

->  egen medcomks02AA=median(ks02AA), by(commid97)

->  egen medcomks02B=median(ks02B), by(commid97)

->  egen medcomks02BA=median(ks02BA), by(commid97)

->  egen medcomks02C=median(ks02C), by(commid97)

->  egen medcomks02CA=median(ks02CA), by(commid97)
(1 missing value generated)

->  egen medcomks02D=median(ks02D), by(commid97)

->  egen medcomks02DA=median(ks02DA), by(commid97)

->  egen medcomks02E=median(ks02E), by(commid97)
(1 missing value generated)

->  egen medcomks02EA=median(ks02EA), by(commid97)
(1 missing value generated)

->  egen medcomks02F=median(ks02F), by(commid97)
(1 missing value generated)

->  egen medcomks02FA=median(ks02FA), by(commid97)

->  egen medcomks02G=median(ks02G), by(commid97)
(1 missing value generated)

->  egen medcomks02GA=median(ks02GA), by(commid97)

->  egen medcomks02H=median(ks02H), by(commid97)

->  egen medcomks02HA=median(ks02HA), by(commid97)
(4 missing values generated)

->  egen medcomks02I=median(ks02I), by(commid97)

->  egen medcomks02IA=median(ks02IA), by(commid97)
(3 missing values generated)

->  egen medcomks02IB=median(ks02IB), by(commid97)
(4 missing values generated)

->  egen medcomks02J=median(ks02J), by(commid97)
(1 missing value generated)

->  egen medcomks02K=median(ks02K), by(commid97)

->  egen medcomks02L=median(ks02L), by(commid97)

->  egen medcomks02M=median(ks02M), by(commid97)

->  egen medcomks02N=median(ks02N), by(commid97)

->  egen medcomks02OA=median(ks02OA), by(commid97)

->  egen medcomks02OB=median(ks02OB), by(commid97)

->  egen medcomks02P=median(ks02P), by(commid97)

->  egen medcomks02Q=median(ks02Q), by(commid97)

->  egen medcomks02R=median(ks02R), by(commid97)

->  egen medcomks02S=median(ks02S), by(commid97)

->  egen medcomks02T=median(ks02T), by(commid97)

->  egen medcomks02U=median(ks02U), by(commid97)
(2 missing values generated)

->  egen medcomks02V=median(ks02V), by(commid97)

->  egen medcomks02W=median(ks02W), by(commid97)

->  egen medcomks02X=median(ks02X), by(commid97)

->  egen medcomks02Y=median(ks02Y), by(commid97)
(2 missing values generated)

->  egen medcomks02Z=median(ks02Z), by(commid97)

->  egen medcomks03A=median(ks03A), by(commid97)

->  egen medcomks03AA=median(ks03AA), by(commid97)

->  egen medcomks03B=median(ks03B), by(commid97)
(2 missing values generated)

->  egen medcomks03BA=median(ks03BA), by(commid97)

->  egen medcomks03C=median(ks03C), by(commid97)
(1 missing value generated)

->  egen medcomks03CA=median(ks03CA), by(commid97)

->  egen medcomks03D=median(ks03D), by(commid97)
(2 missing values generated)

->  egen medcomks03DA=median(ks03DA), by(commid97)

->  egen medcomks03E=median(ks03E), by(commid97)
(1 missing value generated)

->  egen medcomks03EA=median(ks03EA), by(commid97)
(1 missing value generated)

->  egen medcomks03F=median(ks03F), by(commid97)
(2 missing values generated)

->  egen medcomks03FA=median(ks03FA), by(commid97)

->  egen medcomks03G=median(ks03G), by(commid97)
(1 missing value generated)

->  egen medcomks03GA=median(ks03GA), by(commid97)

->  egen medcomks03H=median(ks03H), by(commid97)
(1 missing value generated)

->  egen medcomks03HA=median(ks03HA), by(commid97)

->  egen medcomks03I=median(ks03I), by(commid97)

->  egen medcomks03IA=median(ks03IA), by(commid97)
(2 missing values generated)

->  egen medcomks03IB=median(ks03IB), by(commid97)

->  egen medcomks03J=median(ks03J), by(commid97)

->  egen medcomks03K=median(ks03K), by(commid97)

->  egen medcomks03L=median(ks03L), by(commid97)

->  egen medcomks03M=median(ks03M), by(commid97)
(1 missing value generated)

->  egen medcomks03N=median(ks03N), by(commid97)

->  egen medcomks03OA=median(ks03OA), by(commid97)

->  egen medcomks03OB=median(ks03OB), by(commid97)

->  egen medcomks03P=median(ks03P), by(commid97)

->  egen medcomks03Q=median(ks03Q), by(commid97)

->  egen medcomks03R=median(ks03R), by(commid97)

->  egen medcomks03S=median(ks03S), by(commid97)

->  egen medcomks03T=median(ks03T), by(commid97)

->  egen medcomks03U=median(ks03U), by(commid97)
(1 missing value generated)

->  egen medcomks03V=median(ks03V), by(commid97)
(1 missing value generated)

->  egen medcomks03W=median(ks03W), by(commid97)

->  egen medcomks03X=median(ks03X), by(commid97)

->  egen medcomks03Y=median(ks03Y), by(commid97)

->  egen medcomks03Z=median(ks03Z), by(commid97)
(1 missing value generated)

. for var ks*: egen medkecX=median(X), by(kecid);

->  egen medkecks02A=median(ks02A), by(kecid)

->  egen medkecks02AA=median(ks02AA), by(kecid)

->  egen medkecks02B=median(ks02B), by(kecid)

->  egen medkecks02BA=median(ks02BA), by(kecid)

->  egen medkecks02C=median(ks02C), by(kecid)

->  egen medkecks02CA=median(ks02CA), by(kecid)
(1 missing value generated)

->  egen medkecks02D=median(ks02D), by(kecid)

->  egen medkecks02DA=median(ks02DA), by(kecid)

->  egen medkecks02E=median(ks02E), by(kecid)

->  egen medkecks02EA=median(ks02EA), by(kecid)

->  egen medkecks02F=median(ks02F), by(kecid)

->  egen medkecks02FA=median(ks02FA), by(kecid)

->  egen medkecks02G=median(ks02G), by(kecid)
(1 missing value generated)

->  egen medkecks02GA=median(ks02GA), by(kecid)

->  egen medkecks02H=median(ks02H), by(kecid)

->  egen medkecks02HA=median(ks02HA), by(kecid)
(3 missing values generated)

->  egen medkecks02I=median(ks02I), by(kecid)

->  egen medkecks02IA=median(ks02IA), by(kecid)
(2 missing values generated)

->  egen medkecks02IB=median(ks02IB), by(kecid)
(3 missing values generated)

->  egen medkecks02J=median(ks02J), by(kecid)

->  egen medkecks02K=median(ks02K), by(kecid)

->  egen medkecks02L=median(ks02L), by(kecid)

->  egen medkecks02M=median(ks02M), by(kecid)

->  egen medkecks02N=median(ks02N), by(kecid)

->  egen medkecks02OA=median(ks02OA), by(kecid)

->  egen medkecks02OB=median(ks02OB), by(kecid)

->  egen medkecks02P=median(ks02P), by(kecid)

->  egen medkecks02Q=median(ks02Q), by(kecid)

->  egen medkecks02R=median(ks02R), by(kecid)

->  egen medkecks02S=median(ks02S), by(kecid)

->  egen medkecks02T=median(ks02T), by(kecid)

->  egen medkecks02U=median(ks02U), by(kecid)
(1 missing value generated)

->  egen medkecks02V=median(ks02V), by(kecid)

->  egen medkecks02W=median(ks02W), by(kecid)

->  egen medkecks02X=median(ks02X), by(kecid)

->  egen medkecks02Y=median(ks02Y), by(kecid)
(2 missing values generated)

->  egen medkecks02Z=median(ks02Z), by(kecid)

->  egen medkecks03A=median(ks03A), by(kecid)

->  egen medkecks03AA=median(ks03AA), by(kecid)

->  egen medkecks03B=median(ks03B), by(kecid)
(2 missing values generated)

->  egen medkecks03BA=median(ks03BA), by(kecid)

->  egen medkecks03C=median(ks03C), by(kecid)
(1 missing value generated)

->  egen medkecks03CA=median(ks03CA), by(kecid)

->  egen medkecks03D=median(ks03D), by(kecid)
(2 missing values generated)

->  egen medkecks03DA=median(ks03DA), by(kecid)

->  egen medkecks03E=median(ks03E), by(kecid)
(1 missing value generated)

->  egen medkecks03EA=median(ks03EA), by(kecid)
(1 missing value generated)

->  egen medkecks03F=median(ks03F), by(kecid)
(1 missing value generated)

->  egen medkecks03FA=median(ks03FA), by(kecid)

->  egen medkecks03G=median(ks03G), by(kecid)
(1 missing value generated)

->  egen medkecks03GA=median(ks03GA), by(kecid)

->  egen medkecks03H=median(ks03H), by(kecid)
(1 missing value generated)

->  egen medkecks03HA=median(ks03HA), by(kecid)

->  egen medkecks03I=median(ks03I), by(kecid)

->  egen medkecks03IA=median(ks03IA), by(kecid)
(2 missing values generated)

->  egen medkecks03IB=median(ks03IB), by(kecid)

->  egen medkecks03J=median(ks03J), by(kecid)

->  egen medkecks03K=median(ks03K), by(kecid)

->  egen medkecks03L=median(ks03L), by(kecid)

->  egen medkecks03M=median(ks03M), by(kecid)

->  egen medkecks03N=median(ks03N), by(kecid)

->  egen medkecks03OA=median(ks03OA), by(kecid)

->  egen medkecks03OB=median(ks03OB), by(kecid)

->  egen medkecks03P=median(ks03P), by(kecid)

->  egen medkecks03Q=median(ks03Q), by(kecid)

->  egen medkecks03R=median(ks03R), by(kecid)

->  egen medkecks03S=median(ks03S), by(kecid)

->  egen medkecks03T=median(ks03T), by(kecid)

->  egen medkecks03U=median(ks03U), by(kecid)
(1 missing value generated)

->  egen medkecks03V=median(ks03V), by(kecid)
(1 missing value generated)

->  egen medkecks03W=median(ks03W), by(kecid)

->  egen medkecks03X=median(ks03X), by(kecid)

->  egen medkecks03Y=median(ks03Y), by(kecid)

->  egen medkecks03Z=median(ks03Z), by(kecid)
(1 missing value generated)

. for var ks*: egen medkabX=median(X), by(kabid);

->  egen medkabks02A=median(ks02A), by(kabid)

->  egen medkabks02AA=median(ks02AA), by(kabid)

->  egen medkabks02B=median(ks02B), by(kabid)

->  egen medkabks02BA=median(ks02BA), by(kabid)

->  egen medkabks02C=median(ks02C), by(kabid)

->  egen medkabks02CA=median(ks02CA), by(kabid)

->  egen medkabks02D=median(ks02D), by(kabid)

->  egen medkabks02DA=median(ks02DA), by(kabid)

->  egen medkabks02E=median(ks02E), by(kabid)

->  egen medkabks02EA=median(ks02EA), by(kabid)

->  egen medkabks02F=median(ks02F), by(kabid)

->  egen medkabks02FA=median(ks02FA), by(kabid)

->  egen medkabks02G=median(ks02G), by(kabid)

->  egen medkabks02GA=median(ks02GA), by(kabid)

->  egen medkabks02H=median(ks02H), by(kabid)

->  egen medkabks02HA=median(ks02HA), by(kabid)

->  egen medkabks02I=median(ks02I), by(kabid)

->  egen medkabks02IA=median(ks02IA), by(kabid)

->  egen medkabks02IB=median(ks02IB), by(kabid)

->  egen medkabks02J=median(ks02J), by(kabid)

->  egen medkabks02K=median(ks02K), by(kabid)

->  egen medkabks02L=median(ks02L), by(kabid)

->  egen medkabks02M=median(ks02M), by(kabid)

->  egen medkabks02N=median(ks02N), by(kabid)

->  egen medkabks02OA=median(ks02OA), by(kabid)

->  egen medkabks02OB=median(ks02OB), by(kabid)

->  egen medkabks02P=median(ks02P), by(kabid)

->  egen medkabks02Q=median(ks02Q), by(kabid)

->  egen medkabks02R=median(ks02R), by(kabid)

->  egen medkabks02S=median(ks02S), by(kabid)

->  egen medkabks02T=median(ks02T), by(kabid)

->  egen medkabks02U=median(ks02U), by(kabid)

->  egen medkabks02V=median(ks02V), by(kabid)

->  egen medkabks02W=median(ks02W), by(kabid)

->  egen medkabks02X=median(ks02X), by(kabid)

->  egen medkabks02Y=median(ks02Y), by(kabid)

->  egen medkabks02Z=median(ks02Z), by(kabid)

->  egen medkabks03A=median(ks03A), by(kabid)

->  egen medkabks03AA=median(ks03AA), by(kabid)

->  egen medkabks03B=median(ks03B), by(kabid)

->  egen medkabks03BA=median(ks03BA), by(kabid)

->  egen medkabks03C=median(ks03C), by(kabid)

->  egen medkabks03CA=median(ks03CA), by(kabid)

->  egen medkabks03D=median(ks03D), by(kabid)

->  egen medkabks03DA=median(ks03DA), by(kabid)

->  egen medkabks03E=median(ks03E), by(kabid)

->  egen medkabks03EA=median(ks03EA), by(kabid)

->  egen medkabks03F=median(ks03F), by(kabid)

->  egen medkabks03FA=median(ks03FA), by(kabid)

->  egen medkabks03G=median(ks03G), by(kabid)

->  egen medkabks03GA=median(ks03GA), by(kabid)

->  egen medkabks03H=median(ks03H), by(kabid)

->  egen medkabks03HA=median(ks03HA), by(kabid)

->  egen medkabks03I=median(ks03I), by(kabid)

->  egen medkabks03IA=median(ks03IA), by(kabid)

->  egen medkabks03IB=median(ks03IB), by(kabid)

->  egen medkabks03J=median(ks03J), by(kabid)

->  egen medkabks03K=median(ks03K), by(kabid)

->  egen medkabks03L=median(ks03L), by(kabid)

->  egen medkabks03M=median(ks03M), by(kabid)

->  egen medkabks03N=median(ks03N), by(kabid)

->  egen medkabks03OA=median(ks03OA), by(kabid)

->  egen medkabks03OB=median(ks03OB), by(kabid)

->  egen medkabks03P=median(ks03P), by(kabid)

->  egen medkabks03Q=median(ks03Q), by(kabid)

->  egen medkabks03R=median(ks03R), by(kabid)

->  egen medkabks03S=median(ks03S), by(kabid)

->  egen medkabks03T=median(ks03T), by(kabid)

->  egen medkabks03U=median(ks03U), by(kabid)

->  egen medkabks03V=median(ks03V), by(kabid)

->  egen medkabks03W=median(ks03W), by(kabid)

->  egen medkabks03X=median(ks03X), by(kabid)

->  egen medkabks03Y=median(ks03Y), by(kabid)

->  egen medkabks03Z=median(ks03Z), by(kabid)

. * III.5. Imputation;
. ****************************************************************************;
. for var ks*: gen origX=X;

->  gen origks02A=ks02A
(9 missing values generated)

->  gen origks02AA=ks02AA
(6 missing values generated)

->  gen origks02B=ks02B
(7 missing values generated)

->  gen origks02BA=ks02BA
(8 missing values generated)

->  gen origks02C=ks02C
(11 missing values generated)

->  gen origks02CA=ks02CA
(16 missing values generated)

->  gen origks02D=ks02D
(9 missing values generated)

->  gen origks02DA=ks02DA
(8 missing values generated)

->  gen origks02E=ks02E
(15 missing values generated)

->  gen origks02EA=ks02EA
(15 missing values generated)

->  gen origks02F=ks02F
(12 missing values generated)

->  gen origks02FA=ks02FA
(7 missing values generated)

->  gen origks02G=ks02G
(11 missing values generated)

->  gen origks02GA=ks02GA
(8 missing values generated)

->  gen origks02H=ks02H
(9 missing values generated)

->  gen origks02HA=ks02HA
(71 missing values generated)

->  gen origks02I=ks02I
(11 missing values generated)

->  gen origks02IA=ks02IA
(36 missing values generated)

->  gen origks02IB=ks02IB
(43 missing values generated)

->  gen origks02J=ks02J
(13 missing values generated)

->  gen origks02K=ks02K
(11 missing values generated)

->  gen origks02L=ks02L
(9 missing values generated)

->  gen origks02M=ks02M
(6 missing values generated)

->  gen origks02N=ks02N
(9 missing values generated)

->  gen origks02OA=ks02OA
(9 missing values generated)

->  gen origks02OB=ks02OB
(9 missing values generated)

->  gen origks02P=ks02P
(9 missing values generated)

->  gen origks02Q=ks02Q
(12 missing values generated)

->  gen origks02R=ks02R
(9 missing values generated)

->  gen origks02S=ks02S
(9 missing values generated)

->  gen origks02T=ks02T
(7 missing values generated)

->  gen origks02U=ks02U
(15 missing values generated)

->  gen origks02V=ks02V
(13 missing values generated)

->  gen origks02W=ks02W
(12 missing values generated)

->  gen origks02X=ks02X
(11 missing values generated)

->  gen origks02Y=ks02Y
(14 missing values generated)

->  gen origks02Z=ks02Z
(7 missing values generated)

->  gen origks03A=ks03A
(11 missing values generated)

->  gen origks03AA=ks03AA
(12 missing values generated)

->  gen origks03B=ks03B
(11 missing values generated)

->  gen origks03BA=ks03BA
(18 missing values generated)

->  gen origks03C=ks03C
(10 missing values generated)

->  gen origks03CA=ks03CA
(12 missing values generated)

->  gen origks03D=ks03D
(15 missing values generated)

->  gen origks03DA=ks03DA
(8 missing values generated)

->  gen origks03E=ks03E
(15 missing values generated)

->  gen origks03EA=ks03EA
(10 missing values generated)

->  gen origks03F=ks03F
(12 missing values generated)

->  gen origks03FA=ks03FA
(9 missing values generated)

->  gen origks03G=ks03G
(12 missing values generated)

->  gen origks03GA=ks03GA
(9 missing values generated)

->  gen origks03H=ks03H
(12 missing values generated)

->  gen origks03HA=ks03HA
(10 missing values generated)

->  gen origks03I=ks03I
(13 missing values generated)

->  gen origks03IA=ks03IA
(35 missing values generated)

->  gen origks03IB=ks03IB
(16 missing values generated)

->  gen origks03J=ks03J
(14 missing values generated)

->  gen origks03K=ks03K
(11 missing values generated)

->  gen origks03L=ks03L
(14 missing values generated)

->  gen origks03M=ks03M
(11 missing values generated)

->  gen origks03N=ks03N
(13 missing values generated)

->  gen origks03OA=ks03OA
(13 missing values generated)

->  gen origks03OB=ks03OB
(11 missing values generated)

->  gen origks03P=ks03P
(11 missing values generated)

->  gen origks03Q=ks03Q
(11 missing values generated)

->  gen origks03R=ks03R
(9 missing values generated)

->  gen origks03S=ks03S
(10 missing values generated)

->  gen origks03T=ks03T
(11 missing values generated)

->  gen origks03U=ks03U
(12 missing values generated)

->  gen origks03V=ks03V
(13 missing values generated)

->  gen origks03W=ks03W
(13 missing values generated)

->  gen origks03X=ks03X
(12 missing values generated)

->  gen origks03Y=ks03Y
(8 missing values generated)

->  gen origks03Z=ks03Z
(7 missing values generated)

. for var ks*: replace X=origX if origX~=.;

->  replace ks02A=origks02A if origks02A~=.
(0 real changes made)

->  replace ks02AA=origks02AA if origks02AA~=.
(0 real changes made)

->  replace ks02B=origks02B if origks02B~=.
(0 real changes made)

->  replace ks02BA=origks02BA if origks02BA~=.
(0 real changes made)

->  replace ks02C=origks02C if origks02C~=.
(0 real changes made)

->  replace ks02CA=origks02CA if origks02CA~=.
(0 real changes made)

->  replace ks02D=origks02D if origks02D~=.
(0 real changes made)

->  replace ks02DA=origks02DA if origks02DA~=.
(0 real changes made)

->  replace ks02E=origks02E if origks02E~=.
(0 real changes made)

->  replace ks02EA=origks02EA if origks02EA~=.
(0 real changes made)

->  replace ks02F=origks02F if origks02F~=.
(0 real changes made)

->  replace ks02FA=origks02FA if origks02FA~=.
(0 real changes made)

->  replace ks02G=origks02G if origks02G~=.
(0 real changes made)

->  replace ks02GA=origks02GA if origks02GA~=.
(0 real changes made)

->  replace ks02H=origks02H if origks02H~=.
(0 real changes made)

->  replace ks02HA=origks02HA if origks02HA~=.
(0 real changes made)

->  replace ks02I=origks02I if origks02I~=.
(0 real changes made)

->  replace ks02IA=origks02IA if origks02IA~=.
(0 real changes made)

->  replace ks02IB=origks02IB if origks02IB~=.
(0 real changes made)

->  replace ks02J=origks02J if origks02J~=.
(0 real changes made)

->  replace ks02K=origks02K if origks02K~=.
(0 real changes made)

->  replace ks02L=origks02L if origks02L~=.
(0 real changes made)

->  replace ks02M=origks02M if origks02M~=.
(0 real changes made)

->  replace ks02N=origks02N if origks02N~=.
(0 real changes made)

->  replace ks02OA=origks02OA if origks02OA~=.
(0 real changes made)

->  replace ks02OB=origks02OB if origks02OB~=.
(0 real changes made)

->  replace ks02P=origks02P if origks02P~=.
(0 real changes made)

->  replace ks02Q=origks02Q if origks02Q~=.
(0 real changes made)

->  replace ks02R=origks02R if origks02R~=.
(0 real changes made)

->  replace ks02S=origks02S if origks02S~=.
(0 real changes made)

->  replace ks02T=origks02T if origks02T~=.
(0 real changes made)

->  replace ks02U=origks02U if origks02U~=.
(0 real changes made)

->  replace ks02V=origks02V if origks02V~=.
(0 real changes made)

->  replace ks02W=origks02W if origks02W~=.
(0 real changes made)

->  replace ks02X=origks02X if origks02X~=.
(0 real changes made)

->  replace ks02Y=origks02Y if origks02Y~=.
(0 real changes made)

->  replace ks02Z=origks02Z if origks02Z~=.
(0 real changes made)

->  replace ks03A=origks03A if origks03A~=.
(0 real changes made)

->  replace ks03AA=origks03AA if origks03AA~=.
(0 real changes made)

->  replace ks03B=origks03B if origks03B~=.
(0 real changes made)

->  replace ks03BA=origks03BA if origks03BA~=.
(0 real changes made)

->  replace ks03C=origks03C if origks03C~=.
(0 real changes made)

->  replace ks03CA=origks03CA if origks03CA~=.
(0 real changes made)

->  replace ks03D=origks03D if origks03D~=.
(0 real changes made)

->  replace ks03DA=origks03DA if origks03DA~=.
(0 real changes made)

->  replace ks03E=origks03E if origks03E~=.
(0 real changes made)

->  replace ks03EA=origks03EA if origks03EA~=.
(0 real changes made)

->  replace ks03F=origks03F if origks03F~=.
(0 real changes made)

->  replace ks03FA=origks03FA if origks03FA~=.
(0 real changes made)

->  replace ks03G=origks03G if origks03G~=.
(0 real changes made)

->  replace ks03GA=origks03GA if origks03GA~=.
(0 real changes made)

->  replace ks03H=origks03H if origks03H~=.
(0 real changes made)

->  replace ks03HA=origks03HA if origks03HA~=.
(0 real changes made)

->  replace ks03I=origks03I if origks03I~=.
(0 real changes made)

->  replace ks03IA=origks03IA if origks03IA~=.
(0 real changes made)

->  replace ks03IB=origks03IB if origks03IB~=.
(0 real changes made)

->  replace ks03J=origks03J if origks03J~=.
(0 real changes made)

->  replace ks03K=origks03K if origks03K~=.
(0 real changes made)

->  replace ks03L=origks03L if origks03L~=.
(0 real changes made)

->  replace ks03M=origks03M if origks03M~=.
(0 real changes made)

->  replace ks03N=origks03N if origks03N~=.
(0 real changes made)

->  replace ks03OA=origks03OA if origks03OA~=.
(0 real changes made)

->  replace ks03OB=origks03OB if origks03OB~=.
(0 real changes made)

->  replace ks03P=origks03P if origks03P~=.
(0 real changes made)

->  replace ks03Q=origks03Q if origks03Q~=.
(0 real changes made)

->  replace ks03R=origks03R if origks03R~=.
(0 real changes made)

->  replace ks03S=origks03S if origks03S~=.
(0 real changes made)

->  replace ks03T=origks03T if origks03T~=.
(0 real changes made)

->  replace ks03U=origks03U if origks03U~=.
(0 real changes made)

->  replace ks03V=origks03V if origks03V~=.
(0 real changes made)

->  replace ks03W=origks03W if origks03W~=.
(0 real changes made)

->  replace ks03X=origks03X if origks03X~=.
(0 real changes made)

->  replace ks03Y=origks03Y if origks03Y~=.
(0 real changes made)

->  replace ks03Z=origks03Z if origks03Z~=.
(0 real changes made)

. for var ks02*: replace X=medcomX if X==. & origea==1 & _outlierks02~=1;

->  replace ks02A=medcomks02A if ks02A==. & origea==1 & _outlierks02~=1
(7 real changes made)

->  replace ks02AA=medcomks02AA if ks02AA==. & origea==1 & _outlierks02~=1
(4 real changes made)

->  replace ks02B=medcomks02B if ks02B==. & origea==1 & _outlierks02~=1
(6 real changes made)

->  replace ks02BA=medcomks02BA if ks02BA==. & origea==1 & _outlierks02~=1
(6 real changes made)

->  replace ks02C=medcomks02C if ks02C==. & origea==1 & _outlierks02~=1
(9 real changes made)

->  replace ks02CA=medcomks02CA if ks02CA==. & origea==1 & _outlierks02~=1
(13 real changes made)

->  replace ks02D=medcomks02D if ks02D==. & origea==1 & _outlierks02~=1
(8 real changes made)

->  replace ks02DA=medcomks02DA if ks02DA==. & origea==1 & _outlierks02~=1
(7 real changes made)

->  replace ks02E=medcomks02E if ks02E==. & origea==1 & _outlierks02~=1
(11 real changes made)

->  replace ks02EA=medcomks02EA if ks02EA==. & origea==1 & _outlierks02~=1
(12 real changes made)

->  replace ks02F=medcomks02F if ks02F==. & origea==1 & _outlierks02~=1
(9 real changes made)

->  replace ks02FA=medcomks02FA if ks02FA==. & origea==1 & _outlierks02~=1
(6 real changes made)

->  replace ks02G=medcomks02G if ks02G==. & origea==1 & _outlierks02~=1
(9 real changes made)

->  replace ks02GA=medcomks02GA if ks02GA==. & origea==1 & _outlierks02~=1
(7 real changes made)

->  replace ks02H=medcomks02H if ks02H==. & origea==1 & _outlierks02~=1
(6 real changes made)

->  replace ks02HA=medcomks02HA if ks02HA==. & origea==1 & _outlierks02~=1
(61 real changes made)

->  replace ks02I=medcomks02I if ks02I==. & origea==1 & _outlierks02~=1
(10 real changes made)

->  replace ks02IA=medcomks02IA if ks02IA==. & origea==1 & _outlierks02~=1
(29 real changes made)

->  replace ks02IB=medcomks02IB if ks02IB==. & origea==1 & _outlierks02~=1
(33 real changes made)

->  replace ks02J=medcomks02J if ks02J==. & origea==1 & _outlierks02~=1
(9 real changes made)

->  replace ks02K=medcomks02K if ks02K==. & origea==1 & _outlierks02~=1
(9 real changes made)

->  replace ks02L=medcomks02L if ks02L==. & origea==1 & _outlierks02~=1
(7 real changes made)

->  replace ks02M=medcomks02M if ks02M==. & origea==1 & _outlierks02~=1
(4 real changes made)

->  replace ks02N=medcomks02N if ks02N==. & origea==1 & _outlierks02~=1
(6 real changes made)

->  replace ks02OA=medcomks02OA if ks02OA==. & origea==1 & _outlierks02~=1
(8 real changes made)

->  replace ks02OB=medcomks02OB if ks02OB==. & origea==1 & _outlierks02~=1
(8 real changes made)

->  replace ks02P=medcomks02P if ks02P==. & origea==1 & _outlierks02~=1
(8 real changes made)

->  replace ks02Q=medcomks02Q if ks02Q==. & origea==1 & _outlierks02~=1
(11 real changes made)

->  replace ks02R=medcomks02R if ks02R==. & origea==1 & _outlierks02~=1
(8 real changes made)

->  replace ks02S=medcomks02S if ks02S==. & origea==1 & _outlierks02~=1
(7 real changes made)

->  replace ks02T=medcomks02T if ks02T==. & origea==1 & _outlierks02~=1
(6 real changes made)

->  replace ks02U=medcomks02U if ks02U==. & origea==1 & _outlierks02~=1
(11 real changes made)

->  replace ks02V=medcomks02V if ks02V==. & origea==1 & _outlierks02~=1
ks02V was long now double
(9 real changes made)

->  replace ks02W=medcomks02W if ks02W==. & origea==1 & _outlierks02~=1
(10 real changes made)

->  replace ks02X=medcomks02X if ks02X==. & origea==1 & _outlierks02~=1
(9 real changes made)

->  replace ks02Y=medcomks02Y if ks02Y==. & origea==1 & _outlierks02~=1
(10 real changes made)

->  replace ks02Z=medcomks02Z if ks02Z==. & origea==1 & _outlierks02~=1
(4 real changes made)

. for var ks02*: replace X=medkecX if X==. & _outlierks02~=1;

->  replace ks02A=medkecks02A if ks02A==. & _outlierks02~=1
(2 real changes made)

->  replace ks02AA=medkecks02AA if ks02AA==. & _outlierks02~=1
(2 real changes made)

->  replace ks02B=medkecks02B if ks02B==. & _outlierks02~=1
(1 real change made)

->  replace ks02BA=medkecks02BA if ks02BA==. & _outlierks02~=1
(2 real changes made)

->  replace ks02C=medkecks02C if ks02C==. & _outlierks02~=1
(2 real changes made)

->  replace ks02CA=medkecks02CA if ks02CA==. & _outlierks02~=1
(2 real changes made)

->  replace ks02D=medkecks02D if ks02D==. & _outlierks02~=1
(1 real change made)

->  replace ks02DA=medkecks02DA if ks02DA==. & _outlierks02~=1
(1 real change made)

->  replace ks02E=medkecks02E if ks02E==. & _outlierks02~=1
(4 real changes made)

->  replace ks02EA=medkecks02EA if ks02EA==. & _outlierks02~=1
(3 real changes made)

->  replace ks02F=medkecks02F if ks02F==. & _outlierks02~=1
(3 real changes made)

->  replace ks02FA=medkecks02FA if ks02FA==. & _outlierks02~=1
(1 real change made)

->  replace ks02G=medkecks02G if ks02G==. & _outlierks02~=1
(1 real change made)

->  replace ks02GA=medkecks02GA if ks02GA==. & _outlierks02~=1
(1 real change made)

->  replace ks02H=medkecks02H if ks02H==. & _outlierks02~=1
(3 real changes made)

->  replace ks02HA=medkecks02HA if ks02HA==. & _outlierks02~=1
(7 real changes made)

->  replace ks02I=medkecks02I if ks02I==. & _outlierks02~=1
(1 real change made)

->  replace ks02IA=medkecks02IA if ks02IA==. & _outlierks02~=1
(5 real changes made)

->  replace ks02IB=medkecks02IB if ks02IB==. & _outlierks02~=1
(7 real changes made)

->  replace ks02J=medkecks02J if ks02J==. & _outlierks02~=1
(3 real changes made)

->  replace ks02K=medkecks02K if ks02K==. & _outlierks02~=1
(2 real changes made)

->  replace ks02L=medkecks02L if ks02L==. & _outlierks02~=1
(2 real changes made)

->  replace ks02M=medkecks02M if ks02M==. & _outlierks02~=1
(2 real changes made)

->  replace ks02N=medkecks02N if ks02N==. & _outlierks02~=1
(2 real changes made)

->  replace ks02OA=medkecks02OA if ks02OA==. & _outlierks02~=1
(1 real change made)

->  replace ks02OB=medkecks02OB if ks02OB==. & _outlierks02~=1
(1 real change made)

->  replace ks02P=medkecks02P if ks02P==. & _outlierks02~=1
(1 real change made)

->  replace ks02Q=medkecks02Q if ks02Q==. & _outlierks02~=1
(1 real change made)

->  replace ks02R=medkecks02R if ks02R==. & _outlierks02~=1
(1 real change made)

->  replace ks02S=medkecks02S if ks02S==. & _outlierks02~=1
(2 real changes made)

->  replace ks02T=medkecks02T if ks02T==. & _outlierks02~=1
(1 real change made)

->  replace ks02U=medkecks02U if ks02U==. & _outlierks02~=1
(3 real changes made)

->  replace ks02V=medkecks02V if ks02V==. & _outlierks02~=1
(3 real changes made)

->  replace ks02W=medkecks02W if ks02W==. & _outlierks02~=1
(2 real changes made)

->  replace ks02X=medkecks02X if ks02X==. & _outlierks02~=1
(2 real changes made)

->  replace ks02Y=medkecks02Y if ks02Y==. & _outlierks02~=1
(2 real changes made)

->  replace ks02Z=medkecks02Z if ks02Z==. & _outlierks02~=1
(2 real changes made)

. for var ks02*: replace X=medkabX if X==. & _outlierks02~=1;

->  replace ks02A=medkabks02A if ks02A==. & _outlierks02~=1
(0 real changes made)

->  replace ks02AA=medkabks02AA if ks02AA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02B=medkabks02B if ks02B==. & _outlierks02~=1
(0 real changes made)

->  replace ks02BA=medkabks02BA if ks02BA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02C=medkabks02C if ks02C==. & _outlierks02~=1
(0 real changes made)

->  replace ks02CA=medkabks02CA if ks02CA==. & _outlierks02~=1
(1 real change made)

->  replace ks02D=medkabks02D if ks02D==. & _outlierks02~=1
(0 real changes made)

->  replace ks02DA=medkabks02DA if ks02DA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02E=medkabks02E if ks02E==. & _outlierks02~=1
(0 real changes made)

->  replace ks02EA=medkabks02EA if ks02EA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02F=medkabks02F if ks02F==. & _outlierks02~=1
(0 real changes made)

->  replace ks02FA=medkabks02FA if ks02FA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02G=medkabks02G if ks02G==. & _outlierks02~=1
(1 real change made)

->  replace ks02GA=medkabks02GA if ks02GA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02H=medkabks02H if ks02H==. & _outlierks02~=1
(0 real changes made)

->  replace ks02HA=medkabks02HA if ks02HA==. & _outlierks02~=1
(3 real changes made)

->  replace ks02I=medkabks02I if ks02I==. & _outlierks02~=1
(0 real changes made)

->  replace ks02IA=medkabks02IA if ks02IA==. & _outlierks02~=1
(2 real changes made)

->  replace ks02IB=medkabks02IB if ks02IB==. & _outlierks02~=1
(3 real changes made)

->  replace ks02J=medkabks02J if ks02J==. & _outlierks02~=1
(0 real changes made)

->  replace ks02K=medkabks02K if ks02K==. & _outlierks02~=1
(0 real changes made)

->  replace ks02L=medkabks02L if ks02L==. & _outlierks02~=1
(0 real changes made)

->  replace ks02M=medkabks02M if ks02M==. & _outlierks02~=1
(0 real changes made)

->  replace ks02N=medkabks02N if ks02N==. & _outlierks02~=1
(0 real changes made)

->  replace ks02OA=medkabks02OA if ks02OA==. & _outlierks02~=1
(0 real changes made)

->  replace ks02OB=medkabks02OB if ks02OB==. & _outlierks02~=1
(0 real changes made)

->  replace ks02P=medkabks02P if ks02P==. & _outlierks02~=1
(0 real changes made)

->  replace ks02Q=medkabks02Q if ks02Q==. & _outlierks02~=1
(0 real changes made)

->  replace ks02R=medkabks02R if ks02R==. & _outlierks02~=1
(0 real changes made)

->  replace ks02S=medkabks02S if ks02S==. & _outlierks02~=1
(0 real changes made)

->  replace ks02T=medkabks02T if ks02T==. & _outlierks02~=1
(0 real changes made)

->  replace ks02U=medkabks02U if ks02U==. & _outlierks02~=1
(1 real change made)

->  replace ks02V=medkabks02V if ks02V==. & _outlierks02~=1
(0 real changes made)

->  replace ks02W=medkabks02W if ks02W==. & _outlierks02~=1
(0 real changes made)

->  replace ks02X=medkabks02X if ks02X==. & _outlierks02~=1
(0 real changes made)

->  replace ks02Y=medkabks02Y if ks02Y==. & _outlierks02~=1
(2 real changes made)

->  replace ks02Z=medkabks02Z if ks02Z==. & _outlierks02~=1
(0 real changes made)

. for var ks03*: replace X=medcomX if X==. & origea==1 & _outlierks03~=1;

->  replace ks03A=medcomks03A if ks03A==. & origea==1 & _outlierks03~=1
(9 real changes made)

->  replace ks03AA=medcomks03AA if ks03AA==. & origea==1 & _outlierks03~=1
(10 real changes made)

->  replace ks03B=medcomks03B if ks03B==. & origea==1 & _outlierks03~=1
(8 real changes made)

->  replace ks03BA=medcomks03BA if ks03BA==. & origea==1 & _outlierks03~=1
(16 real changes made)

->  replace ks03C=medcomks03C if ks03C==. & origea==1 & _outlierks03~=1
(8 real changes made)

->  replace ks03CA=medcomks03CA if ks03CA==. & origea==1 & _outlierks03~=1
(11 real changes made)

->  replace ks03D=medcomks03D if ks03D==. & origea==1 & _outlierks03~=1
(12 real changes made)

->  replace ks03DA=medcomks03DA if ks03DA==. & origea==1 & _outlierks03~=1
(7 real changes made)

->  replace ks03E=medcomks03E if ks03E==. & origea==1 & _outlierks03~=1
(12 real changes made)

->  replace ks03EA=medcomks03EA if ks03EA==. & origea==1 & _outlierks03~=1
(8 real changes made)

->  replace ks03F=medcomks03F if ks03F==. & origea==1 & _outlierks03~=1
(8 real changes made)

->  replace ks03FA=medcomks03FA if ks03FA==. & origea==1 & _outlierks03~=1
(8 real changes made)

->  replace ks03G=medcomks03G if ks03G==. & origea==1 & _outlierks03~=1
(9 real changes made)

->  replace ks03GA=medcomks03GA if ks03GA==. & origea==1 & _outlierks03~=1
(8 real changes made)

->  replace ks03H=medcomks03H if ks03H==. & origea==1 & _outlierks03~=1
(10 real changes made)

->  replace ks03HA=medcomks03HA if ks03HA==. & origea==1 & _outlierks03~=1
(9 real changes made)

->  replace ks03I=medcomks03I if ks03I==. & origea==1 & _outlierks03~=1
(12 real changes made)

->  replace ks03IA=medcomks03IA if ks03IA==. & origea==1 & _outlierks03~=1
(29 real changes made)

->  replace ks03IB=medcomks03IB if ks03IB==. & origea==1 & _outlierks03~=1
(15 real changes made)

->  replace ks03J=medcomks03J if ks03J==. & origea==1 & _outlierks03~=1
(12 real changes made)

->  replace ks03K=medcomks03K if ks03K==. & origea==1 & _outlierks03~=1
(10 real changes made)

->  replace ks03L=medcomks03L if ks03L==. & origea==1 & _outlierks03~=1
(11 real changes made)

->  replace ks03M=medcomks03M if ks03M==. & origea==1 & _outlierks03~=1
(8 real changes made)

->  replace ks03N=medcomks03N if ks03N==. & origea==1 & _outlierks03~=1
(11 real changes made)

->  replace ks03OA=medcomks03OA if ks03OA==. & origea==1 & _outlierks03~=1
(11 real changes made)

->  replace ks03OB=medcomks03OB if ks03OB==. & origea==1 & _outlierks03~=1
(9 real changes made)

->  replace ks03P=medcomks03P if ks03P==. & origea==1 & _outlierks03~=1
(9 real changes made)

->  replace ks03Q=medcomks03Q if ks03Q==. & origea==1 & _outlierks03~=1
(10 real changes made)

->  replace ks03R=medcomks03R if ks03R==. & origea==1 & _outlierks03~=1
(8 real changes made)

->  replace ks03S=medcomks03S if ks03S==. & origea==1 & _outlierks03~=1
(9 real changes made)

->  replace ks03T=medcomks03T if ks03T==. & origea==1 & _outlierks03~=1
(10 real changes made)

->  replace ks03U=medcomks03U if ks03U==. & origea==1 & _outlierks03~=1
(10 real changes made)

->  replace ks03V=medcomks03V if ks03V==. & origea==1 & _outlierks03~=1
(10 real changes made)

->  replace ks03W=medcomks03W if ks03W==. & origea==1 & _outlierks03~=1
(12 real changes made)

->  replace ks03X=medcomks03X if ks03X==. & origea==1 & _outlierks03~=1
(10 real changes made)

->  replace ks03Y=medcomks03Y if ks03Y==. & origea==1 & _outlierks03~=1
(7 real changes made)

->  replace ks03Z=medcomks03Z if ks03Z==. & origea==1 & _outlierks03~=1
(4 real changes made)

. for var ks03*: replace X=medkecX if X==. & _outlierks03~=1;

->  replace ks03A=medkecks03A if ks03A==. & _outlierks03~=1
(2 real changes made)

->  replace ks03AA=medkecks03AA if ks03AA==. & _outlierks03~=1
(2 real changes made)

->  replace ks03B=medkecks03B if ks03B==. & _outlierks03~=1
(1 real change made)

->  replace ks03BA=medkecks03BA if ks03BA==. & _outlierks03~=1
(2 real changes made)

->  replace ks03C=medkecks03C if ks03C==. & _outlierks03~=1
(1 real change made)

->  replace ks03CA=medkecks03CA if ks03CA==. & _outlierks03~=1
(1 real change made)

->  replace ks03D=medkecks03D if ks03D==. & _outlierks03~=1
(1 real change made)

->  replace ks03DA=medkecks03DA if ks03DA==. & _outlierks03~=1
(1 real change made)

->  replace ks03E=medkecks03E if ks03E==. & _outlierks03~=1
(1 real change made)

->  replace ks03EA=medkecks03EA if ks03EA==. & _outlierks03~=1
(1 real change made)

->  replace ks03F=medkecks03F if ks03F==. & _outlierks03~=1
(3 real changes made)

->  replace ks03FA=medkecks03FA if ks03FA==. & _outlierks03~=1
(1 real change made)

->  replace ks03G=medkecks03G if ks03G==. & _outlierks03~=1
(1 real change made)

->  replace ks03GA=medkecks03GA if ks03GA==. & _outlierks03~=1
(1 real change made)

->  replace ks03H=medkecks03H if ks03H==. & _outlierks03~=1
(1 real change made)

->  replace ks03HA=medkecks03HA if ks03HA==. & _outlierks03~=1
(1 real change made)

->  replace ks03I=medkecks03I if ks03I==. & _outlierks03~=1
(1 real change made)

->  replace ks03IA=medkecks03IA if ks03IA==. & _outlierks03~=1
(4 real changes made)

->  replace ks03IB=medkecks03IB if ks03IB==. & _outlierks03~=1
(1 real change made)

->  replace ks03J=medkecks03J if ks03J==. & _outlierks03~=1
(1 real change made)

->  replace ks03K=medkecks03K if ks03K==. & _outlierks03~=1
(1 real change made)

->  replace ks03L=medkecks03L if ks03L==. & _outlierks03~=1
(1 real change made)

->  replace ks03M=medkecks03M if ks03M==. & _outlierks03~=1
(3 real changes made)

->  replace ks03N=medkecks03N if ks03N==. & _outlierks03~=1
(2 real changes made)

->  replace ks03OA=medkecks03OA if ks03OA==. & _outlierks03~=1
(2 real changes made)

->  replace ks03OB=medkecks03OB if ks03OB==. & _outlierks03~=1
(2 real changes made)

->  replace ks03P=medkecks03P if ks03P==. & _outlierks03~=1
(2 real changes made)

->  replace ks03Q=medkecks03Q if ks03Q==. & _outlierks03~=1
(1 real change made)

->  replace ks03R=medkecks03R if ks03R==. & _outlierks03~=1
(1 real change made)

->  replace ks03S=medkecks03S if ks03S==. & _outlierks03~=1
(1 real change made)

->  replace ks03T=medkecks03T if ks03T==. & _outlierks03~=1
(1 real change made)

->  replace ks03U=medkecks03U if ks03U==. & _outlierks03~=1
(1 real change made)

->  replace ks03V=medkecks03V if ks03V==. & _outlierks03~=1
(1 real change made)

->  replace ks03W=medkecks03W if ks03W==. & _outlierks03~=1
(1 real change made)

->  replace ks03X=medkecks03X if ks03X==. & _outlierks03~=1
(2 real changes made)

->  replace ks03Y=medkecks03Y if ks03Y==. & _outlierks03~=1
(1 real change made)

->  replace ks03Z=medkecks03Z if ks03Z==. & _outlierks03~=1
(2 real changes made)

. for var ks03*: replace X=medkabX if X==. & _outlierks03~=1;

->  replace ks03A=medkabks03A if ks03A==. & _outlierks03~=1
(0 real changes made)

->  replace ks03AA=medkabks03AA if ks03AA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03B=medkabks03B if ks03B==. & _outlierks03~=1
(2 real changes made)

->  replace ks03BA=medkabks03BA if ks03BA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03C=medkabks03C if ks03C==. & _outlierks03~=1
(1 real change made)

->  replace ks03CA=medkabks03CA if ks03CA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03D=medkabks03D if ks03D==. & _outlierks03~=1
(2 real changes made)

->  replace ks03DA=medkabks03DA if ks03DA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03E=medkabks03E if ks03E==. & _outlierks03~=1
(1 real change made)

->  replace ks03EA=medkabks03EA if ks03EA==. & _outlierks03~=1
(1 real change made)

->  replace ks03F=medkabks03F if ks03F==. & _outlierks03~=1
(1 real change made)

->  replace ks03FA=medkabks03FA if ks03FA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03G=medkabks03G if ks03G==. & _outlierks03~=1
(1 real change made)

->  replace ks03GA=medkabks03GA if ks03GA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03H=medkabks03H if ks03H==. & _outlierks03~=1
(1 real change made)

->  replace ks03HA=medkabks03HA if ks03HA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03I=medkabks03I if ks03I==. & _outlierks03~=1
(0 real changes made)

->  replace ks03IA=medkabks03IA if ks03IA==. & _outlierks03~=1
(2 real changes made)

->  replace ks03IB=medkabks03IB if ks03IB==. & _outlierks03~=1
(0 real changes made)

->  replace ks03J=medkabks03J if ks03J==. & _outlierks03~=1
(0 real changes made)

->  replace ks03K=medkabks03K if ks03K==. & _outlierks03~=1
(0 real changes made)

->  replace ks03L=medkabks03L if ks03L==. & _outlierks03~=1
(0 real changes made)

->  replace ks03M=medkabks03M if ks03M==. & _outlierks03~=1
(0 real changes made)

->  replace ks03N=medkabks03N if ks03N==. & _outlierks03~=1
(0 real changes made)

->  replace ks03OA=medkabks03OA if ks03OA==. & _outlierks03~=1
(0 real changes made)

->  replace ks03OB=medkabks03OB if ks03OB==. & _outlierks03~=1
(0 real changes made)

->  replace ks03P=medkabks03P if ks03P==. & _outlierks03~=1
(0 real changes made)

->  replace ks03Q=medkabks03Q if ks03Q==. & _outlierks03~=1
(0 real changes made)

->  replace ks03R=medkabks03R if ks03R==. & _outlierks03~=1
(0 real changes made)

->  replace ks03S=medkabks03S if ks03S==. & _outlierks03~=1
(0 real changes made)

->  replace ks03T=medkabks03T if ks03T==. & _outlierks03~=1
(0 real changes made)

->  replace ks03U=medkabks03U if ks03U==. & _outlierks03~=1
(1 real change made)

->  replace ks03V=medkabks03V if ks03V==. & _outlierks03~=1
(1 real change made)

->  replace ks03W=medkabks03W if ks03W==. & _outlierks03~=1
(0 real changes made)

->  replace ks03X=medkabks03X if ks03X==. & _outlierks03~=1
(0 real changes made)

->  replace ks03Y=medkabks03Y if ks03Y==. & _outlierks03~=1
(0 real changes made)

->  replace ks03Z=medkabks03Z if ks03Z==. & _outlierks03~=1
(1 real change made)

. ********************* START OF "MANUAL" IMPUTATION  OF KS02 AND KS03 ********************************************************;
. replace ks02A=medkabks02A if origks02A==. & commid=="32N1";
(1 real change made)

. replace ks02A=medkabks02A if origks02A==. & commid=="32NL";
(1 real change made)

. replace ks02AA=medkabks02AA if origks02AA==. & commid=="32N1";
(1 real change made)

. replace ks02AA=medkabks02AA if origks02AA==. & commid=="32NL";
(1 real change made)

. replace ks02B=medkabks02B if origks02B==. & commid=="32N1";
(0 real changes made)

. replace ks02BA=medkabks02BA if origks02BA==. & commid=="32N1";
(0 real changes made)

. replace ks02BA=medkabks02BA if origks02BA==. & commid=="32NL";
(1 real change made)

. replace ks02C=medkabks02C if ks02C==. & commid=="32N1";
(0 real changes made)

. replace ks02CA=medkabks02CA if origks02CA==. & commid=="32N1";
(0 real changes made)

. replace ks02CA=medkabks02CA if origks02CA==. & commid=="32NL";
(1 real change made)

. replace ks02CA=medkabks02CA if origks02CA==. & commid=="16CO";
(0 real changes made)

. replace ks02D=medkabks02D if origks02D==. & commid=="32N1";
(0 real changes made)

. replace ks02DA=medkabks02DA if origks02DA==. & commid=="32N1";
(0 real changes made)

. replace ks02E=medkabks02E if origks02E==. & commid=="13CU";
(1 real change made)

. replace ks02E=medkabks02E if origks02E==. & commid=="32N1";
(1 real change made)

. replace ks02E=medkabks02E if origks02E==. & commid=="35IS";
(1 real change made)

. replace ks02E=3 if origks02E==. & commid=="31AW";
(1 real change made)

. replace ks02EA=medkabks02EA if origks02EA==. & commid=="32N1";
(0 real changes made)

. replace ks02EA=medkabks02EA if origks02EA==. & commid=="32NL";
(0 real changes made)

.         replace ks02EA=medkabks02EA if origks02EA==. & commid=="3105";
(0 real changes made)

. replace ks02F=medkabks02F if origks02F==. & commid=="32N1";
(1 real change made)

. replace ks02F=medkecks02F if origks02F==. & commid=="12CN";
(0 real changes made)

. replace ks02FA=medkabks02FA if origks02FA==. & commid=="32N1";
(0 real changes made)

. replace ks02G=medkabks02G if origks02G==. & commid=="16BH";
(0 real changes made)

. replace ks02G=medkabks02G if origks02G==. & commid=="32N1";
(1 real change made)

. replace ks02GA=medkabks02GA if origks02GA==. & commid=="32N1";
(0 real changes made)

. replace ks02H=medkabks02H if origks02H==. & commid=="31AH";
(1 real change made)

. replace ks02H=medkabks02H if origks02H==. & commid=="32N1";
(1 real change made)

. replace ks02H=medkabks02H if origks02H==. & commid=="32NL";
(1 real change made)

. replace ks02HA=. if origks02HA==. & commid=="3106";
(1 real change made, 1 to missing)

. replace ks02HA=medkabks02HA if origks02HA==. & commid=="32BV";
(0 real changes made)

. replace ks02HA=medkabks02HA if origks02HA==. & commid=="32KV";
(0 real changes made)

. replace ks02HA=medkabks02HA if origks02HA==. & commid=="32LR";
(0 real changes made)

. replace ks02HA=medkabks02HA if origks02HA==. & commid=="32N1";
(0 real changes made)

. replace ks02HA=medkabks02HA if origks02HA==. & commid=="32NL";
(1 real change made)

. replace ks02HA=medkabks02HA if origks02HA==. & commid=="32OM";
(1 real change made)

. replace ks02HA=medkabks02HA if origks02HA==. & commid=="33K8";
(1 real change made)

. replace ks02HA=medkecks02HA if origks02HA==. & commid=="3105";
(0 real changes made)

. replace ks02HA=medkecks02HA if origks02HA==. & commid=="31AM";
(0 real changes made)

. replace ks02HA=medkecks02HA if origks02HA==. & commid=="32H6";
(0 real changes made)

. replace ks02I=medkabks02I if origks02I==. & commid=="32N1";
(1 real change made)

. replace ks02IA=medkabks02IA if origks02IA==. & commid=="32BR";
(0 real changes made)

. replace ks02IA=medkabks02IA if origks02IA==. & commid=="32BV";
(0 real changes made)

. replace ks02IA=medkabks02IA if origks02IA==. & commid=="32NL";
(1 real change made)

. replace ks02IA=medkabks02IA if origks02IA==. & commid=="32NQ";
(1 real change made)

. replace ks02IA=medkabks02IA if origks02IA==. & commid=="32OW";
(1 real change made)

. replace ks02IA=medkabks02IA if origks02IA==. & commid=="33OS";
(1 real change made)

. replace ks02IA=medkecks02IA  if origks02IA==. & commid=="32NP";
(0 real changes made)

. replace ks02IB=medkabks02IB if origks02IB==. & commid=="32BR";
(0 real changes made)

. replace ks02IB=medkabks02IB if origks02IB==. & commid=="32BV";
(0 real changes made)

. replace ks02IB=medkabks02IB if origks02IB==. & commid=="32LR";
(0 real changes made)

. replace ks02IB=medkabks02IB if origks02IB==. & commid=="32NL";
(0 real changes made)

. replace ks02IB=medkabks02IB if origks02IB==. & commid=="32NQ";
(0 real changes made)

. replace ks02IB=medkabks02IB if origks02IB==. & commid=="32OM";
(0 real changes made)

. replace ks02IB=medkabks02IB if origks02IB==. & commid=="33K8";
(1 real change made)

. replace ks02IB=medkabks02IB if origks02IB==. & commid=="33OS";
(1 real change made)

. replace ks02IB=medkecks02IB if origks02IB==. & commid=="32NP";
(0 real changes made)

. replace ks02J=medkabks02J if origks02J==. & commid=="32N1";
(1 real change made)

. replace ks02J=medkabks02J if origks02J==. & commid=="32NL";
(1 real change made)

. replace ks02J=medkabks02J if origks02J==. & commid=="33F5";
(1 real change made)

. replace ks02J=medkecks02J if origks02J==. & commid=="32NJ";
(0 real changes made)

. replace ks02K=medkabks02K if origks02K==. & commid=="51AM";
(0 real changes made)

. replace ks02L=medkabks02L if origks02L==. & commid=="32N1";
(1 real change made)

. replace ks02L=medkabks02L if origks02L==. & commid=="32NL";
(1 real change made)

. replace ks02M=medkabks02M if origks02M==. & commid=="32N1";
(1 real change made)

. replace ks02M=medkabks02M if origks02M==. & commid=="32NL";
(1 real change made)

. replace ks02N=medkabks02N if origks02N==. & commid=="32N1";
(0 real changes made)

. replace ks02N=medkabks02N if origks02N==. & commid=="33F5";
(1 real change made)

. replace ks02N=medkabks02N if origks02N==. & commid=="35IS";
(1 real change made)

. replace ks02OA=medkabks02OA if origks02OA==. & commid=="32N1";
(0 real changes made)

. replace ks02OB=medkabks02OB if origks02OB==. & commid=="32N1";
(1 real change made)

. replace ks02P=medkabks02P if origks02P==. & commid=="32N1";
(1 real change made)

. replace ks02Q=medkabks02Q if origks02Q==. & commid=="32N1";
(1 real change made)

. replace ks02R=medkabks02R if origks02R==. & commid=="32N1";
(0 real changes made)

. replace ks02S=medkabks02S if origks02S==. & commid=="32N1";
(0 real changes made)

. replace ks02S=medkabks02S if origks02S==. & commid=="32NL";
(1 real change made)

. replace ks02T=medkabks02T if origks02T==. & commid=="32N1";
(0 real changes made)

. replace ks02U=medkabks02U if origks02U==. & commid=="31AH";
(0 real changes made)

. replace ks02U=medkabks02U if origks02U==. & commid=="32N1";
(0 real changes made)

. replace ks02U=medkabks02U if origks02U==. & commid=="33FR";
(0 real changes made)

. replace ks02V=medkabks02V if origks02V==. & commid=="32N1";
(1 real change made)

. replace ks02V=medkabks02V if origks02V==. & commid=="32NL";
(1 real change made)

. replace ks02V=medkabks02V if origks02V==. & commid=="33F5";
(1 real change made)

. replace ks02V=medkabks02V if origks02V==. & commid=="35IS";
(1 real change made)

. replace ks02W=medkabks02W if origks02W==. & commid=="32N1";
(1 real change made)

. replace ks02W=medkabks02W if origks02W==. & commid=="32NL";
(1 real change made)

. replace ks02X=medkabks02X if origks02X==. & commid=="32N1";
(0 real changes made)

. replace ks02Y=medkabks02Y if origks02Y==. & commid=="32N1";
(0 real changes made)

. replace ks02Y=medkabks02Y if origks02Y==. & commid=="32NL";
(1 real change made)

. replace ks02Y=medkabks02Y if origks02Y==. & commid=="33K8";
(1 real change made)

. replace ks02Z=medkabks02Z if origks02Z==. & commid=="31AH";
(1 real change made)

. replace ks02Z=medkabks02Z if origks02Z==. & commid=="32N1";
(0 real changes made)

. replace ks02Z=medkabks02Z if origks02Z==. & commid=="33F5";
(1 real change made)

. **KS03
> replace ks03A=medkabks03A if origks03A==. & commid=="32N1";
. replace ks03A=medkabks03A if origks03A==. & commid=="63A7";
(1 real change made)

. replace ks03AA=medkabks03AA if origks03AA==. & commid=="32N1";
(0 real changes made)

. replace ks03AA=medkabks03AA if origks03AA==. & commid=="35IP";
(0 real changes made)

. replace ks03B=medkabks03B if origks03B==. & commid=="32BV";
(0 real changes made)

. replace ks03B=medkabks03B if origks03B==. & commid=="32N1";
(0 real changes made)

. replace ks03B=medkabks03B if origks03B==. & commid=="32M5";
(0 real changes made)

. replace ks03BA=medkabks03BA if origks03BA==. & commid=="32N1";
(0 real changes made)

. replace ks03BA=medkabks03BA if origks03BA==. & commid=="32OW";
(0 real changes made)

. replace ks03C=medkabks03C if origks03C==. & commid=="32M5";
(0 real changes made)

. replace ks03C=medkabks03C if origks03C==. & commid=="32N1";
(0 real changes made)

. replace ks03CA=medkabks03CA if origks03CA==. & commid=="32N1";
(0 real changes made)

. replace ks03D=medkabks03D if origks03D==. & commid=="32BV";
(0 real changes made)

. replace ks03D=medkabks03D if origks03D==. & commid=="32N1";
(1 real change made)

. replace ks03D=medkabks03D if origks03D==. & commid=="32M5";
(0 real changes made)

. replace ks03DA=medkabks03DA if origks03DA==. & commid=="32N1";
(0 real changes made)

. replace ks03E=medkabks03E if origks03E==. & commid=="32M5";
(0 real changes made)

. replace ks03E=medkabks03E if origks03E==. & commid=="32N1";
(0 real changes made)

. replace ks03E=medkabks03E if origks03E==. & commid=="33F5";
(1 real change made)

. replace ks03EA=medkabks03EA if origks03EA==. & commid=="32N1";
(0 real changes made)

. replace ks03F=medkabks03F if origks03F==. & commid=="32BI";
(0 real changes made)

. replace ks03F=medkabks03F if origks03F==. & commid=="32M5";
(0 real changes made)

. replace ks03F=medkabks03F if origks03F==. & commid=="32N1";
(0 real changes made)

. replace ks03FA=medkabks03FA if origks03FA==. & commid=="32N1";
(0 real changes made)

. replace ks03G=medkabks03G if origks03G==. & commid=="32M5";
(0 real changes made)

. replace ks03G=medkabks03G if origks03G==. & commid=="32N1";
(0 real changes made)

. replace ks03GA=medkabks03GA if origks03GA==. & commid=="32N1";
(0 real changes made)

. replace ks03H=medkabks03H if origks03H==. & commid=="32M5";
(0 real changes made)

. replace ks03H=medkabks03H if origks03H==. & commid=="32N1";
(0 real changes made)

. replace ks03HA=medkabks03HA if origks03HA==. & commid=="32N1";
(0 real changes made)

. replace ks03I=medkabks03I if origks03I==. & commid=="32N1";
(0 real changes made)

. replace ks03IA=medkabks03IA if origks03IA==. & commid=="31AD";
(1 real change made)

. replace ks03IA=medkabks03IA if origks03IA==. & commid=="32BR";
(0 real changes made)

. replace ks03IA=medkabks03IA if origks03IA==. & commid=="32BV";
(0 real changes made)

. replace ks03IA=medkabks03IA if origks03IA==. & commid=="32OM";
(0 real changes made)

. replace ks03IA=medkabks03IA if origks03IA==. & commid=="32OW";
(0 real changes made)

. replace ks03IA=medkecks03IA  if origks03IA==. & commid=="32OV";
(0 real changes made)

. replace ks03IB=medkabks03IB if origks03IB==. & commid=="32OM";
(0 real changes made)

. replace ks03J=medkabks03J if origks03J==. & commid=="31AH";
(1 real change made)

. replace ks03J=medkabks03J if origks03J==. & commid=="32N1";
(0 real changes made)

. replace ks03K=medkabks03K if origks03K==. & commid=="32N1";
(0 real changes made)

. replace ks03L=medkabks03L if origks03L==. & commid=="32N1";
(0 real changes made)

. replace ks03M=medkabks03M if origks03M==. & commid=="16AT";
(0 real changes made)

. replace ks03M=medkabks03M if origks03M==. & commid=="32N1";
(0 real changes made)

. replace ks03M=medkecks03M if origks03M==. & commid=="32NO";
(0 real changes made)

. replace ks03N=medkabks03N if origks03N==. & commid=="16AT";
(0 real changes made)

. replace ks03N=medkabks03N if origks03N==. & commid=="32N1";
(0 real changes made)

. replace ks03OA=medkabks03OA if origks03OA==. & commid=="16AT";
(0 real changes made)

. replace ks03OA=medkabks03OA if origks03OA==. & commid=="32N1";
(0 real changes made)

. replace ks03OB=medkabks03OB if origks03OB==. & commid=="16AT";
(0 real changes made)

. replace ks03OB=medkabks03OB if origks03OB==. & commid=="32N1";
(0 real changes made)

. replace ks03P=medkabks03P if origks03P==. & commid=="16AT";
(0 real changes made)

. replace ks03P=medkabks03P if origks03P==. & commid=="32N1";
(0 real changes made)

. replace ks03Q=medkabks03Q if origks03Q==. & commid=="32N1";
(0 real changes made)

. replace ks03R=medkabks03R if origks03R==. & commid=="32N1";
(0 real changes made)

. replace ks03S=medkabks03S if origks03S==. & commid=="32N1";
(0 real changes made)

. replace ks03T=medkabks03T if origks03T==. & commid=="32N1";
(0 real changes made)

. replace ks03U=medkabks03U if origks03U==. & commid=="32N1";
(0 real changes made)

. replace ks03U=medkabks03U if origks03U==. & commid=="33FR";
(0 real changes made)

. replace ks03V=medkabks03V if origks03V==. & commid=="32N1";
(0 real changes made)

. replace ks03V=medkabks03V if origks03V==. & commid=="35I5";
(0 real changes made)

. replace ks03W=medkabks03W if origks03W==. & commid=="32N1";
(0 real changes made)

. replace ks03X=medkabks03X if origks03X==. & commid=="32N1";
(0 real changes made)

. replace ks03Y=medkabks03Y if origks03Y==. & commid=="32N1";
(0 real changes made)

. replace ks03Z=medkabks03Z if origks03Z==. & commid=="31AH";
(0 real changes made)

. replace ks03Z=medkabks03Z if origks03Z==. & commid=="32N1";
(0 real changes made)

. replace ks03Z=medkabks03Z if origks03Z==. & commid=="35EV";
(0 real changes made)

. for var ks*: replace X=medcomX if origX==. & X==.;

->  replace ks02A=medcomks02A if origks02A==. & ks02A==.
(0 real changes made)

->  replace ks02AA=medcomks02AA if origks02AA==. & ks02AA==.
(0 real changes made)

->  replace ks02B=medcomks02B if origks02B==. & ks02B==.
(0 real changes made)

->  replace ks02BA=medcomks02BA if origks02BA==. & ks02BA==.
(0 real changes made)

->  replace ks02C=medcomks02C if origks02C==. & ks02C==.
(0 real changes made)

->  replace ks02CA=medcomks02CA if origks02CA==. & ks02CA==.
(0 real changes made)

->  replace ks02D=medcomks02D if origks02D==. & ks02D==.
(0 real changes made)

->  replace ks02DA=medcomks02DA if origks02DA==. & ks02DA==.
(0 real changes made)

->  replace ks02E=medcomks02E if origks02E==. & ks02E==.
(0 real changes made)

->  replace ks02EA=medcomks02EA if origks02EA==. & ks02EA==.
(0 real changes made)

->  replace ks02F=medcomks02F if origks02F==. & ks02F==.
(0 real changes made)

->  replace ks02FA=medcomks02FA if origks02FA==. & ks02FA==.
(0 real changes made)

->  replace ks02G=medcomks02G if origks02G==. & ks02G==.
(0 real changes made)

->  replace ks02GA=medcomks02GA if origks02GA==. & ks02GA==.
(0 real changes made)

->  replace ks02H=medcomks02H if origks02H==. & ks02H==.
(0 real changes made)

->  replace ks02HA=medcomks02HA if origks02HA==. & ks02HA==.
(1 real change made)

->  replace ks02I=medcomks02I if origks02I==. & ks02I==.
(0 real changes made)

->  replace ks02IA=medcomks02IA if origks02IA==. & ks02IA==.
(0 real changes made)

->  replace ks02IB=medcomks02IB if origks02IB==. & ks02IB==.
(0 real changes made)

->  replace ks02J=medcomks02J if origks02J==. & ks02J==.
(0 real changes made)

->  replace ks02K=medcomks02K if origks02K==. & ks02K==.
(0 real changes made)

->  replace ks02L=medcomks02L if origks02L==. & ks02L==.
(0 real changes made)

->  replace ks02M=medcomks02M if origks02M==. & ks02M==.
(0 real changes made)

->  replace ks02N=medcomks02N if origks02N==. & ks02N==.
(0 real changes made)

->  replace ks02OA=medcomks02OA if origks02OA==. & ks02OA==.
(0 real changes made)

->  replace ks02OB=medcomks02OB if origks02OB==. & ks02OB==.
(0 real changes made)

->  replace ks02P=medcomks02P if origks02P==. & ks02P==.
(0 real changes made)

->  replace ks02Q=medcomks02Q if origks02Q==. & ks02Q==.
(0 real changes made)

->  replace ks02R=medcomks02R if origks02R==. & ks02R==.
(0 real changes made)

->  replace ks02S=medcomks02S if origks02S==. & ks02S==.
(0 real changes made)

->  replace ks02T=medcomks02T if origks02T==. & ks02T==.
(0 real changes made)

->  replace ks02U=medcomks02U if origks02U==. & ks02U==.
(0 real changes made)

->  replace ks02V=medcomks02V if origks02V==. & ks02V==.
(0 real changes made)

->  replace ks02W=medcomks02W if origks02W==. & ks02W==.
(0 real changes made)

->  replace ks02X=medcomks02X if origks02X==. & ks02X==.
(0 real changes made)

->  replace ks02Y=medcomks02Y if origks02Y==. & ks02Y==.
(0 real changes made)

->  replace ks02Z=medcomks02Z if origks02Z==. & ks02Z==.
(0 real changes made)

->  replace ks03A=medcomks03A if origks03A==. & ks03A==.
(0 real changes made)

->  replace ks03AA=medcomks03AA if origks03AA==. & ks03AA==.
(0 real changes made)

->  replace ks03B=medcomks03B if origks03B==. & ks03B==.
(0 real changes made)

->  replace ks03BA=medcomks03BA if origks03BA==. & ks03BA==.
(0 real changes made)

->  replace ks03C=medcomks03C if origks03C==. & ks03C==.
(0 real changes made)

->  replace ks03CA=medcomks03CA if origks03CA==. & ks03CA==.
(0 real changes made)

->  replace ks03D=medcomks03D if origks03D==. & ks03D==.
(0 real changes made)

->  replace ks03DA=medcomks03DA if origks03DA==. & ks03DA==.
(0 real changes made)

->  replace ks03E=medcomks03E if origks03E==. & ks03E==.
(0 real changes made)

->  replace ks03EA=medcomks03EA if origks03EA==. & ks03EA==.
(0 real changes made)

->  replace ks03F=medcomks03F if origks03F==. & ks03F==.
(0 real changes made)

->  replace ks03FA=medcomks03FA if origks03FA==. & ks03FA==.
(0 real changes made)

->  replace ks03G=medcomks03G if origks03G==. & ks03G==.
(1 real change made)

->  replace ks03GA=medcomks03GA if origks03GA==. & ks03GA==.
(0 real changes made)

->  replace ks03H=medcomks03H if origks03H==. & ks03H==.
(0 real changes made)

->  replace ks03HA=medcomks03HA if origks03HA==. & ks03HA==.
(0 real changes made)

->  replace ks03I=medcomks03I if origks03I==. & ks03I==.
(0 real changes made)

->  replace ks03IA=medcomks03IA if origks03IA==. & ks03IA==.
(0 real changes made)

->  replace ks03IB=medcomks03IB if origks03IB==. & ks03IB==.
(0 real changes made)

->  replace ks03J=medcomks03J if origks03J==. & ks03J==.
(0 real changes made)

->  replace ks03K=medcomks03K if origks03K==. & ks03K==.
(0 real changes made)

->  replace ks03L=medcomks03L if origks03L==. & ks03L==.
(2 real changes made)

->  replace ks03M=medcomks03M if origks03M==. & ks03M==.
(0 real changes made)

->  replace ks03N=medcomks03N if origks03N==. & ks03N==.
(0 real changes made)

->  replace ks03OA=medcomks03OA if origks03OA==. & ks03OA==.
(0 real changes made)

->  replace ks03OB=medcomks03OB if origks03OB==. & ks03OB==.
(0 real changes made)

->  replace ks03P=medcomks03P if origks03P==. & ks03P==.
(0 real changes made)

->  replace ks03Q=medcomks03Q if origks03Q==. & ks03Q==.
(0 real changes made)

->  replace ks03R=medcomks03R if origks03R==. & ks03R==.
(0 real changes made)

->  replace ks03S=medcomks03S if origks03S==. & ks03S==.
(0 real changes made)

->  replace ks03T=medcomks03T if origks03T==. & ks03T==.
(0 real changes made)

->  replace ks03U=medcomks03U if origks03U==. & ks03U==.
(0 real changes made)

->  replace ks03V=medcomks03V if origks03V==. & ks03V==.
(1 real change made)

->  replace ks03W=medcomks03W if origks03W==. & ks03W==.
(0 real changes made)

->  replace ks03X=medcomks03X if origks03X==. & ks03X==.
(0 real changes made)

->  replace ks03Y=medcomks03Y if origks03Y==. & ks03Y==.
(0 real changes made)

->  replace ks03Z=medcomks03Z if origks03Z==. & ks03Z==.
(0 real changes made)

. for var ks02*: replace X=. if _outlierks02==1;

->  replace ks02A=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02AA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02B=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02BA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02C=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02CA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02D=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02DA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02E=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02EA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02F=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02FA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02G=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02GA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02H=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02HA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02I=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02IA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02IB=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02J=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02K=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02L=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02M=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02N=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02OA=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02OB=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02P=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02Q=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02R=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02S=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02T=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02U=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02V=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02W=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02X=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02Y=. if _outlierks02==1
(1 real change made, 1 to missing)

->  replace ks02Z=. if _outlierks02==1
(1 real change made, 1 to missing)

. for var ks03*: replace X=. if _outlierks03==1;

->  replace ks03A=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03AA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03B=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03BA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03C=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03CA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03D=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03DA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03E=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03EA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03F=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03FA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03G=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03GA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03H=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03HA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03I=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03IA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03IB=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03J=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03K=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03L=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03M=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03N=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03OA=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03OB=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03P=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03Q=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03R=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03S=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03T=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03U=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03V=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03W=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03X=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03Y=. if _outlierks03==1
(5 real changes made, 5 to missing)

->  replace ks03Z=. if _outlierks03==1
(5 real changes made, 5 to missing)

. ********************* END OF "MANUAL" IMPUTATION  OF KS02 AND KS03 ********************************************************;
. * III.6. Generate total;
. ****************************************************************************;
. gen sumks02=ks02A+ks02AA+ks02B+ks02BA+ks02C+ks02CA+ks02D+ks02DA+ks02E+ks02EA+ks02F+ks02FA+ks02G+ks02GA
> +ks02H+ ks02HA+ks02I+ks02IA+ks02IB+ ks02J+ks02K+ks02L+ks02M+ks02N+ks02OA+ks02OB+ks02P+ks02Q+ks02S
> +ks02R+ks02T+ks02U+ks02V+ks02W+ks02X+ks02Y+ks02Z;
(1 missing value generated)

. gen sumks03=ks03A+ks03AA+ks03B+ks03BA+ks03C+ks03CA+ks03D+ks03DA+ks03E+ks03EA+ks03F+ks03FA+ks03G+ks03GA  
> +ks03H+ ks03HA+ ks03I+ ks03IA+ks03IB+ ks03J+ks03K+ks03L+ks03M+ks03N+ks03OA+ks03OB+ks03P+ks03Q+ks03S 
> +ks03R+ks03T+ks03U+ks03V+ks03W+ks03X+ks03Y+ks03Z;
(5 missing values generated)

. * III.7 Generate variable containing information on missing values in this data file ;
. ****************************************************************************;
. capture drop missks02;

. capture drop missks03;

. gen missks02=(sumks02==.);

. gen missks03=(sumks03==.);

. lab var missks02 "Household w/ at least 1 KS02 missing";

. lab var missks03 "Household w/ at least 1 KS03 missing";

. tab1 miss*;

-> tabulation of missks02  

  Household |
w/ at least |
     1 KS02 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,564       99.99       99.99
          1 |          1        0.01      100.00
------------+-----------------------------------
      Total |      7,565      100.00

-> tabulation of missks03  

  Household |
w/ at least |
     1 KS03 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,560       99.93       99.93
          1 |          5        0.07      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. * III.8 Label, sort, save the data;
. ****************************************************************************;
. sort hhid ;

. drop med* origk* sum*;

. compress;
_outlierks was float now byte
_outlierks02 was float now byte
_outlierks03 was float now byte
ks02B was long now int
ks02GA was long now int
ks02OA was long now int
ks02R was long now int
ks02S was long now int
ks02T was long now int
ks02U was long now int
ks03AA was long now int
ks03B was long now int
ks03C was long now int
ks03CA was long now int
ks03DA was long now int
ks03E was long now int
ks03EA was long now int
ks03FA was long now int
ks03G was long now int
ks03GA was long now int
ks03I was long now int
ks03N was long now int
ks03OA was long now int
ks03OB was long now int
ks03P was long now int
ks03R was long now int
ks03S was long now int
ks03T was long now int
ks03U was long now int
ks03V was long now int
ks03W was long now int
ks03X was long now int
ks03Y was long now int
ks03Z was long now int
missks02 was float now byte
missks03 was float now byte

. label data "Wide version of b1_ks1, with imputation";

. save $dir0\b1_ks197, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\b1_ks197.dta saved

. ********************************************************************************;
. * IV. KS06 (B1KS2.DTA);
. ********************************************************************************;
. #delimit ;
delimiter now ;
. * IV.1 Identify outliers;
. ****************************************************************************;
. use hhid ks2type ks06 using $dir2\b1_ks2, clear;
(Bk 1 Consumption (3)-Non food mthly )

. gen byte z=1 if ks2type=="F1" & ks06>273000 & ks06~=.;
(68084 missing values generated)

. replace z=1 if ks2type=="B" & ks06>750000 & ks06~=.;
(1 real change made)

. replace z=1 if ks2type=="E" & ks06>1700000 & ks06~=.;
(1 real change made)

. ** The following case of outlier is not dropped because it's F2 (arisan);
. ** replace z=1 if ks2type=="F2" & ks06>1750000 & ks06~=.;
. list hhid ks06 ks2type if  z==1;

       +-----------------------------+
       |  hhid97      ks06   ks2type |
       |-----------------------------|
 6613. | 0331100    785000        F1 |
36983. | 1812411   4000000         B |
54681. | 2651000   4380000         E |
       +-----------------------------+

. replace ks06=. if z==1;
(3 real changes made, 3 to missing)

. sort hhid;

. bys hhid: egen _outlierks06=max(z);
(68058 missing values generated)

. lab var _outlierks06 "Any outlier in ks06";

. mvencode _outlierks06, mv(0);
_outlierks06: 68058 missing values recoded

. tab _outlierks06;

Any outlier |
    in ks06 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,058       99.96       99.96
          1 |         27        0.04      100.00
------------+-----------------------------------
      Total |     68,085      100.00

. sort hhid;

. drop z;

. compress;
_outlierks06 was float now byte

. * IV.2. Generate variable containing information on missing values in this data file ;
. ****************************************************************************;
. gen   x=1 if ks06==.;
(67811 missing values generated)

. replace x=0 if ks2type=="F2";
(7565 real changes made)

. replace x=0 if x==. ;
(60258 real changes made)

. egen   missks06=max(x), by(hhid);

. lab var missks06 "Household w/ at least 1 KS06 missing, excl. F2";

. compress;
x was float now byte
missks06 was float now byte

. drop x;

. * IV.3. Reshape b1_ks2.dta from long to wide;
. ****************************************************************************;
. reshape wide ks06, i(hhid ) j(ks2type) string;
(note: j = A B C C1 D E F1 F2 G)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    68085   ->    7565
Number of variables                   5   ->      12
j variable (9 values)           ks2type   ->   (dropped)
xij variables:
                                   ks06   ->   ks06A ks06B ... ks06G
-----------------------------------------------------------------------------

. tab missks06;

  Household |
w/ at least |
     1 KS06 |
   missing, |
   excl. F2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,396       97.77       97.77
          1 |        169        2.23      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. sort hhid ;

. compress;

. label data "Wide version of b1_ks2";

. save $dir0\b1_ks297_wide, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\b1_ks297_wide.dta saved

. * IV.4. Merge with commid, kecid, kabid info;
. ****************************************************************************;
. use hhid commid97 kecid kabid provid origea using $dir0\hhlist1997, clear;
(HH-level tracking across waves )

. sort hhid;

. merge hhid using $dir0\b1_ks297_wide;

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         54        0.71        0.71
          3 |      7,565       99.29      100.00
------------+-----------------------------------
      Total |      7,619      100.00

. *Only keep HHs which answered Book 2;
. keep if _merge==3;
(54 observations deleted)

. drop _merge;

. inspect ks06*;

ks06A:  A ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero             624       624          -
|  #                         Positive        6920      6920          -
|  #                                        -----     -----      -----
|  #                         Total           7544      7544          -
|  #   .   .   .   .         Missing           21
+----------------------                     -----
0               2034000                      7565
(More than 99 unique values)

ks06B:  B ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero             246       246          -
|  #                         Positive        7284      7284          -
|  #                                        -----     -----      -----
|  #                         Total           7530      7530          -
|  #   .   .   .   .         Missing           35
+----------------------                     -----
0                750000                      7565
(More than 99 unique values)

ks06C:  C ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero             262       262          -
|  #                         Positive        7272      7272          -
|  #                                        -----     -----      -----
|  #                         Total           7534      7534          -
|  #   .   .   .   .         Missing           31
+----------------------                     -----
0                434400                      7565
(More than 99 unique values)

ks06C1:  C1 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7099      7099          -
|  #                         Positive         459       459          -
|  #                                        -----     -----      -----
|  #                         Total           7558      7558          -
|  #   .   .   .   .         Missing            7
+----------------------                     -----
0               3180000                      7565
(More than 99 unique values)

ks06D:  D ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            6426      6426          -
|  #                         Positive        1101      1101          -
|  #                                        -----     -----      -----
|  #                         Total           7527      7527          -
|  #   .   .   .   .         Missing           38
+----------------------                     -----
0               1621000                      7565
(More than 99 unique values)

ks06E:  E ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            3666      3666          -
|  #                         Positive        3811      3811          -
|  #                                        -----     -----      -----
|  #                         Total           7477      7477          -
|  #   .   .   .   .         Missing           88
+----------------------                     -----
0               1700000                      7565
(More than 99 unique values)

ks06F1:  F1 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7471      7471          -
|  #                         Positive          80        80          -
|  #                                        -----     -----      -----
|  #                         Total           7551      7551          -
|  #   .   .   .   .         Missing           14
+----------------------                     -----
0                273000                      7565
  (48 unique values)

ks06F2:  F2 ks06                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            4306      4306          -
|  #                         Positive        3247      3247          -
|  #                                        -----     -----      -----
|  #                         Total           7553      7553          -
|  #   .   .   .   .         Missing           12
+----------------------                     -----
0              1.35e+07                      7565
(More than 99 unique values)

ks06G:  G ks06                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            6841      6841          -
|  #                         Positive         696       696          -
|  #                                        -----     -----      -----
|  #                         Total           7537      7537          -
|  #   .   .   .   .         Missing           28
+----------------------                     -----
0               1600000                      7565
  (86 unique values)

. * IV.5. Generate median variables;
. ****************************************************************************;
. for var ks*:  egen medcomX=median(X), by(commid97);

->  egen medcomks06A=median(ks06A), by(commid97)
(3 missing values generated)

->  egen medcomks06B=median(ks06B), by(commid97)
(4 missing values generated)

->  egen medcomks06C=median(ks06C), by(commid97)
(4 missing values generated)

->  egen medcomks06C1=median(ks06C1), by(commid97)
(1 missing value generated)

->  egen medcomks06D=median(ks06D), by(commid97)
(4 missing values generated)

->  egen medcomks06E=median(ks06E), by(commid97)
(9 missing values generated)

->  egen medcomks06F1=median(ks06F1), by(commid97)
(3 missing values generated)

->  egen medcomks06F2=median(ks06F2), by(commid97)
(2 missing values generated)

->  egen medcomks06G=median(ks06G), by(commid97)
(4 missing values generated)

. for var ks*:  egen medkecX=median(X), by(kecid);

->  egen medkecks06A=median(ks06A), by(kecid)
(3 missing values generated)

->  egen medkecks06B=median(ks06B), by(kecid)
(3 missing values generated)

->  egen medkecks06C=median(ks06C), by(kecid)
(3 missing values generated)

->  egen medkecks06C1=median(ks06C1), by(kecid)
(1 missing value generated)

->  egen medkecks06D=median(ks06D), by(kecid)
(4 missing values generated)

->  egen medkecks06E=median(ks06E), by(kecid)
(7 missing values generated)

->  egen medkecks06F1=median(ks06F1), by(kecid)
(3 missing values generated)

->  egen medkecks06F2=median(ks06F2), by(kecid)
(2 missing values generated)

->  egen medkecks06G=median(ks06G), by(kecid)
(4 missing values generated)

. for var ks*:  egen medkabX=median(X), by(kabid);

->  egen medkabks06A=median(ks06A), by(kabid)

->  egen medkabks06B=median(ks06B), by(kabid)

->  egen medkabks06C=median(ks06C), by(kabid)

->  egen medkabks06C1=median(ks06C1), by(kabid)

->  egen medkabks06D=median(ks06D), by(kabid)

->  egen medkabks06E=median(ks06E), by(kabid)

->  egen medkabks06F1=median(ks06F1), by(kabid)

->  egen medkabks06F2=median(ks06F2), by(kabid)

->  egen medkabks06G=median(ks06G), by(kabid)

. compress ;
medcomks06F1 was float now int
medkecks06F1 was float now int
medkabks06B was float now int
medkabks06D was float now int
medkabks06F1 was float now byte
medkabks06G was float now int

. * IV.6. Imputation;
. ****************************************************************************;
. for var ks*: gen origX=X;

->  gen origks06A=ks06A
(21 missing values generated)

->  gen origks06B=ks06B
(35 missing values generated)

->  gen origks06C=ks06C
(31 missing values generated)

->  gen origks06C1=ks06C1
(7 missing values generated)

->  gen origks06D=ks06D
(38 missing values generated)

->  gen origks06E=ks06E
(88 missing values generated)

->  gen origks06F1=ks06F1
(14 missing values generated)

->  gen origks06F2=ks06F2
(12 missing values generated)

->  gen origks06G=ks06G
(28 missing values generated)

. for var ks*: replace X=medcomX if X==. & origea==1  & _outlierks06~=1;

->  replace ks06A=medcomks06A if ks06A==. & origea==1 & _outlierks06~=1
(15 real changes made)

->  replace ks06B=medcomks06B if ks06B==. & origea==1 & _outlierks06~=1
(24 real changes made)

->  replace ks06C=medcomks06C if ks06C==. & origea==1 & _outlierks06~=1
(23 real changes made)

->  replace ks06C1=medcomks06C1 if ks06C1==. & origea==1 & _outlierks06~=1
(5 real changes made)

->  replace ks06D=medcomks06D if ks06D==. & origea==1 & _outlierks06~=1
(30 real changes made)

->  replace ks06E=medcomks06E if ks06E==. & origea==1 & _outlierks06~=1
(66 real changes made)

->  replace ks06F1=medcomks06F1 if ks06F1==. & origea==1 & _outlierks06~=1
(9 real changes made)

->  replace ks06F2=medcomks06F2 if ks06F2==. & origea==1 & _outlierks06~=1
(9 real changes made)

->  replace ks06G=medcomks06G if ks06G==. & origea==1 & _outlierks06~=1
(19 real changes made)

. for var ks*: replace X=medkecX if X==. & _outlierks06~=1;

->  replace ks06A=medkecks06A if ks06A==. & _outlierks06~=1
(3 real changes made)

->  replace ks06B=medkecks06B if ks06B==. & _outlierks06~=1
(7 real changes made)

->  replace ks06C=medkecks06C if ks06C==. & _outlierks06~=1
(5 real changes made)

->  replace ks06C1=medkecks06C1 if ks06C1==. & _outlierks06~=1
(1 real change made)

->  replace ks06D=medkecks06D if ks06D==. & _outlierks06~=1
(4 real changes made)

->  replace ks06E=medkecks06E if ks06E==. & _outlierks06~=1
(14 real changes made)

->  replace ks06F1=medkecks06F1 if ks06F1==. & _outlierks06~=1
(1 real change made)

->  replace ks06F2=medkecks06F2 if ks06F2==. & _outlierks06~=1
(1 real change made)

->  replace ks06G=medkecks06G if ks06G==. & _outlierks06~=1
(5 real changes made)

. for var ks*: replace X=medkabX if X==. & _outlierks06~=1;

->  replace ks06A=medkabks06A if ks06A==. & _outlierks06~=1
(3 real changes made)

->  replace ks06B=medkabks06B if ks06B==. & _outlierks06~=1
(3 real changes made)

->  replace ks06C=medkabks06C if ks06C==. & _outlierks06~=1
(3 real changes made)

->  replace ks06C1=medkabks06C1 if ks06C1==. & _outlierks06~=1
(1 real change made)

->  replace ks06D=medkabks06D if ks06D==. & _outlierks06~=1
(4 real changes made)

->  replace ks06E=medkabks06E if ks06E==. & _outlierks06~=1
(7 real changes made)

->  replace ks06F1=medkabks06F1 if ks06F1==. & _outlierks06~=1
(3 real changes made)

->  replace ks06F2=medkabks06F2 if ks06F2==. & _outlierks06~=1
(2 real changes made)

->  replace ks06G=medkabks06G if ks06G==. & _outlierks06~=1
(4 real changes made)

. ********************* START OF "MANUAL" IMPUTATION  OF KS06 ********************************************************;
. replace ks06A=medkabks06A if origks06A==. & commid=="32AR";
(0 real changes made)

. replace ks06A=medkabks06A if origks06A==. & commid=="32EG";
(0 real changes made)

. replace ks06A=medkabks06A if origks06A==. & commid=="33K8";
(1 real change made)

. replace ks06A=medkecks06A if origks06A==. & commid=="13C9";
(0 real changes made)

. replace ks06A=medkecks06A if origks06A==. & commid=="32KF" ;
(0 real changes made)

. replace ks06B=medkabks06B if origks06B==. & commid=="32EG";
(0 real changes made)

. replace ks06B=medkabks06B if origks06B==. & commid=="32KV";
(0 real changes made)

. replace ks06B=medkabks06B if origks06B==. & commid=="32NL";
(1 real change made)

. replace ks06B=medkabks06B if origks06B==. & commid=="32OM";
(1 real change made)

. replace ks06B=medkabks06B if origks06B==. & commid=="32OW";
(1 real change made)

. replace ks06B=medkabks06B if origks06B==. & commid=="34BZ";
(1 real change made)

. replace ks06B=medkabks06B if origks06B==. & commid=="52AC" ;
(0 real changes made)

. replace ks06B=medkecks06B if origks06B==. & commid=="32KF";
(0 real changes made)

. replace ks06B=medkecks06B if origks06B==. & commid=="32NP" ;
(0 real changes made)

. replace ks06C=medkabks06C if origks06C==. & commid=="32CK";
(0 real changes made)

. replace ks06C=medkabks06C if origks06C==. & commid=="32EG";
(0 real changes made)

. replace ks06C=medkabks06C if origks06C==. & commid=="32OM";
(1 real change made)

. replace ks06C=medkabks06C if origks06C==. & commid=="33K8";
(1 real change made)

. replace ks06C=medkabks06C if origks06C==. & commid=="52AC" ;
(0 real changes made)

. replace ks06C=medkecks06C if origks06C==. & commid=="32KF";
(0 real changes made)

. replace ks06C=medkecks06C if origks06C==. & commid=="32NP" ;
(0 real changes made)

. replace ks06C1=medkabks06C1 if origks06C1==. & commid=="52AC";
(0 real changes made)

. replace ks06C1=medkecks06C1 if origks06C1==. & commid=="32KF" ;
(0 real changes made)

. replace ks06D=medkabks06D if origks06D==. & commid=="31AH";
(0 real changes made)

. replace ks06D=medkabks06D if origks06D==. & commid=="32BR";
(0 real changes made)

. replace ks06D=medkabks06D if origks06D==. & commid=="32EG";
(0 real changes made)

. replace ks06D=medkabks06D if origks06D==. & commid=="32LR";
(0 real changes made)

. replace ks06D=medkabks06D if origks06D==. & commid=="32OM";
(0 real changes made)

. replace ks06D=medkabks06D if origks06D==. & commid=="33OS";
(1 real change made)

. replace ks06D=medkabks06D if origks06D==. & commid=="52AC";
(0 real changes made)

. replace ks06D=medkecks06D  if origks06D==. & commid=="3246";
(2 real changes made)

. replace ks06E=medkabks06E if origks06E==. & commid=="31AH";
(1 real change made)

. replace ks06E=medkabks06E if origks06E==. & commid=="32BV";
(0 real changes made)

. replace ks06E=medkabks06E if origks06E==. & commid=="32EG";
(0 real changes made)

. replace ks06E=medkabks06E if origks06E==. & commid=="32KV";
(0 real changes made)

. replace ks06E=medkabks06E if origks06E==. & commid=="32LR";
(0 real changes made)

. replace ks06E=medkabks06E if origks06E==. & commid=="32NL";
(1 real change made)

. replace ks06E=medkabks06E if origks06E==. & commid=="32OM";
(1 real change made)

. replace ks06E=medkabks06E if origks06E==. & commid=="32OW";
(1 real change made)

. replace ks06E=medkabks06E if origks06E==. & commid=="32E8";
(0 real changes made)

. replace ks06E=medkabks06E if origks06E==. & commid=="32K8";
(0 real changes made)

. replace ks06E=medkabks06E if origks06E==. & commid=="34BZ";
(1 real change made)

. replace ks06E=medkabks06E if origks06E==. & commid=="52AC";
(0 real changes made)

. replace ks06E=medkabks06E if origks06E==. & commid=="73CR";
(0 real changes made)

. replace ks06E=medkecks06E if origks06E==. & commid=="13B4";
(0 real changes made)

. replace ks06E=medkecks06E if origks06E==. & commid=="13CU";
(0 real changes made)

. replace ks06E=medkecks06E if origks06E==. & commid=="3106";
(2 real changes made)

. replace ks06E=medkecks06E if origks06E==. & commid=="31AS";
(0 real changes made)

. replace ks06E=medkecks06E if origks06E==. & commid=="31AW";
(0 real changes made)

. replace ks06E=medkecks06E if origks06E==. & commid=="32KF";
(0 real changes made)

. replace ks06E=medkecks06E if origks06E==. & commid=="32NP";
(0 real changes made)

. replace ks06E=medkecks06E if origks06E==. & commid=="34B4";
(0 real changes made)

. replace ks06E=medcomks06E if origks06E==. & commid=="35Q0";
(1 real change made)

. replace ks06F1=medkabks06F1 if origks06F1==. & commid=="32EG";
(0 real changes made)

. replace ks06F1=medkabks06F1 if origks06F1==. & commid=="33E8";
(0 real changes made)

. replace ks06F1=medkabks06F1 if origks06F1==. & commid=="52AC";
(0 real changes made)

. replace ks06F1=medkecks06F1 if origks06F1==. & commid=="32KF";
(0 real changes made)

. replace ks06F2=medkabks06F2 if origks06F2==. & commid=="32EG";
(0 real changes made)

. replace ks06F2=medkabks06F2 if origks06F2==. & commid=="52AC";
(0 real changes made)

. replace ks06F2=medkecks06F2  if origks06F2==. & commid=="32KF";
(0 real changes made)

. replace ks06G=medkabks06G if origks06G==. & commid=="32BV";
(0 real changes made)

. replace ks06G=medkabks06G if origks06G==. & commid=="32NQ";
(0 real changes made)

. replace ks06G=medkabks06G if origks06G==. & commid=="34BZ";
(0 real changes made)

. replace ks06G=medkabks06G if origks06G==. & commid=="52AC";
(0 real changes made)

. replace ks06G=medkecks06G if origks06G==. & commid=="32KF";
(0 real changes made)

. for var ks*: replace X=medcomX if origX==. & X==.;

->  replace ks06A=medcomks06A if origks06A==. & ks06A==.
(0 real changes made)

->  replace ks06B=medcomks06B if origks06B==. & ks06B==.
(1 real change made)

->  replace ks06C=medcomks06C if origks06C==. & ks06C==.
(0 real changes made)

->  replace ks06C1=medcomks06C1 if origks06C1==. & ks06C1==.
(0 real changes made)

->  replace ks06D=medcomks06D if origks06D==. & ks06D==.
(0 real changes made)

->  replace ks06E=medcomks06E if origks06E==. & ks06E==.
(1 real change made)

->  replace ks06F1=medcomks06F1 if origks06F1==. & ks06F1==.
(1 real change made)

->  replace ks06F2=medcomks06F2 if origks06F2==. & ks06F2==.
(0 real changes made)

->  replace ks06G=medcomks06G if origks06G==. & ks06G==.
(0 real changes made)

. for var ks06*: replace X=. if _outlierks06==1;

->  replace ks06A=. if _outlierks06==1
(3 real changes made, 3 to missing)

->  replace ks06B=. if _outlierks06==1
(3 real changes made, 3 to missing)

->  replace ks06C=. if _outlierks06==1
(3 real changes made, 3 to missing)

->  replace ks06C1=. if _outlierks06==1
(3 real changes made, 3 to missing)

->  replace ks06D=. if _outlierks06==1
(3 real changes made, 3 to missing)

->  replace ks06E=. if _outlierks06==1
(3 real changes made, 3 to missing)

->  replace ks06F1=. if _outlierks06==1
(3 real changes made, 3 to missing)

->  replace ks06F2=. if _outlierks06==1
(3 real changes made, 3 to missing)

->  replace ks06G=. if _outlierks06==1
(3 real changes made, 3 to missing)

. ********************* END OF "MANUAL" IMPUTATION  OF KS06 ********************************************************;
. * II.7 Generate variable containing information on missing values in this data file ;
. ****************************************************************************;
. capture drop missks06;

. gen sumks06=ks06A+ks06B+ks06C+ks06C1+ks06D+ks06E+ks06F1+ks06G;
(3 missing values generated)

. gen missks06=(sumks06==.);

. lab var missks06 "Household w/ at least 1 KS06 missing -excluding F2";

. tab missks06;

  Household |
w/ at least |
     1 KS06 |
    missing |
 -excluding |
         F2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,562       99.96       99.96
          1 |          3        0.04      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. * IV.8. Save the data
> ****************************************************************************;
. compress;
missks06 was float now byte

. drop origk* med* sumks;

. sort hhid;

. save $dir0\b1_ks297, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\b1_ks297.dta saved

. ********************************************************************************;
. * V. KS08, KS09a,  (B1_KS3.DTA);
. ********************************************************************************;
. #delimit ;
delimiter now ;
. * V.1. Identify outliers;
. ****************************************************************************;
. use ks08 ks09a ks3type hhid using $dir2\b1_ks3, clear;
(Bk 1 Consumption (4)-Non food ann )

. sort hhid ks3type;

. gen z=1 if ks3type=="A" & ks08>10000000 & ks08~=.;
(52954 missing values generated)

. list hhid ks08 ks3type if z==1;

       +------------------------------+
       |  hhid97       ks08   ks3type |
       |------------------------------|
11593. | 0721112   30000000         A |
       +------------------------------+

. replace ks08=. if z==1;
(1 real change made, 1 to missing)

. bys hhid: egen _outlierks08=max(z);
(52948 missing values generated)

. mvencode _outlierks08, mv(0);
_outlierks08: 52948 missing values recoded

. lab var _outlierks08 "Any outlier in ks08";

. sort hhid;

. drop z ;

. compress;
_outlierks08 was float now byte

. * THIS CASE HAS KS08=9999998, CHANGE INTO MISSING;
. replace ks08=. if ks3type=="C" & ks08==9999998;
(1 real change made, 1 to missing)

. *ks09 no outlier;
. gen _outlierks09=0;

. lab var _outlierks09 "Any outlier in ks09";

. *V.2. Reshape b1_ks3.dta from long to wide;
. ****************************************************************************;
. reshape wide ks08 ks09a, i(hhid ) j(ks3type) string;
(note: j = A B C D E F G)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    52955   ->    7565
Number of variables                   6   ->      17
j variable (7 values)           ks3type   ->   (dropped)
xij variables:
                                   ks08   ->   ks08A ks08B ... ks08G
                                  ks09a   ->   ks09aA ks09aB ... ks09aG
-----------------------------------------------------------------------------

. sort hhid;

.  compress;
ks09aE was long now byte
ks09aG was long now byte
_outlierks09 was float now byte

. label data "Wide version of b1_ks3 created pre_pce.do";

. save $dir0\b1_ks397wide, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\b1_ks397wide.dta saved

. *V.3 Merge with kecamatan ID information;
. ****************************************************************************;
. use $dir0\b1_ks397wide, clear;
(Wide version of b1_ks3 created pre_pce.do)

. sort hhid;

. save $dir0\tempks397, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\tempks397.dta saved

. use hhid commid97 kecid kabid provid origea using $dir0\hhlist1997, clear;
(HH-level tracking across waves )

. sort hhid;

. merge hhid using $dir0\tempks397;

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         54        0.71        0.71
          3 |      7,565       99.29      100.00
------------+-----------------------------------
      Total |      7,619      100.00

. *Only keep HHs which answered Book 2;
. keep if _merge==3;
(54 observations deleted)

. drop _merge;

. inspect ks*;

ks08A:  A ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero             861       861          -
|  #                         Positive        6615      6615          -
|  #                                        -----     -----      -----
|  #                         Total           7476      7476          -
|  #   .   .   .   .         Missing           89
+----------------------                     -----
0              1.00e+07                      7565
(More than 99 unique values)

ks09aA:  A ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            5574      5574          -
|  #                         Positive        1902      1902          -
|  #                                        -----     -----      -----
|  #                         Total           7476      7476          -
|  #   .   .   .   .         Missing           89
+----------------------                     -----
0               4500000                      7565
(More than 99 unique values)

ks08B:  B ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            4330      4330          -
|  #                         Positive        3210      3210          -
|  #                                        -----     -----      -----
|  #                         Total           7540      7540          -
|  #   .   .   .   .         Missing           25
+----------------------                     -----
0               8100000                      7565
(More than 99 unique values)

ks09aB:  B ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7231      7231          -
|  #                         Positive         311       311          -
|  #                                        -----     -----      -----
|  #                         Total           7542      7542          -
|  #   .   .   .   .         Missing           23
+----------------------                     -----
0               1500000                      7565
  (71 unique values)

ks08C:  C ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            2184      2184          -
|  #                         Positive        5297      5297          -
|  #                                        -----     -----      -----
|  #                         Total           7481      7481          -
|  #   .   .   .   .         Missing           84
+----------------------                     -----
0              1.30e+07                      7565
(More than 99 unique values)

ks09aC:  C ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7187      7187          -
|  #                         Positive         344       344          -
|  #                                        -----     -----      -----
|  #                         Total           7531      7531          -
|  #   .   .   .   .         Missing           34
+----------------------                     -----
0              1.00e+07                      7565
  (91 unique values)

ks08D:  D ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero             850       850          -
|  #                         Positive        6571      6571          -
|  #                                        -----     -----      -----
|  #                         Total           7421      7421          -
|  #   .   .   .   .         Missing          144
+----------------------                     -----
0              2.50e+07                      7565
(More than 99 unique values)

ks09aD:  D ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7098      7098          -
|  #                         Positive         444       444          -
|  #                                        -----     -----      -----
|  #                         Total           7542      7542          -
|  #   .   .   .   .         Missing           23
+----------------------                     -----
0              2.00e+07                      7565
(More than 99 unique values)

ks08E:  E ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            2370      2370          -
|  #                         Positive        5008      5008          -
|  #                                        -----     -----      -----
|  #                         Total           7378      7378          -
|  #   .   .   .   .         Missing          187
+----------------------                     -----
0               3000000                      7565
(More than 99 unique values)

ks09aE:  E ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|                            Negative           -         -          -
|                            Zero               -         -          -
|                            Positive           -         -          -
|                                           -----     -----      -----
|                            Total              -         -          -
|                            Missing         7565
+----------------------                     -----
.             -9.0e+307                      7565
   (0 unique value)

ks08F:  F ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            6251      6251          -
|  #                         Positive        1295      1295          -
|  #                                        -----     -----      -----
|  #                         Total           7546      7546          -
|  #   .   .   .   .         Missing           19
+----------------------                     -----
0              1.10e+08                      7565
(More than 99 unique values)

ks09aF:  F ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7445      7445          -
|  #                         Positive          92        92          -
|  #                                        -----     -----      -----
|  #                         Total           7537      7537          -
|  #   .   .   .   .         Missing           28
+----------------------                     -----
0               3600000                      7565
  (47 unique values)

ks08G:  G ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            6373      6373          -
|  #                         Positive        1134      1134          -
|  #                                        -----     -----      -----
|  #                         Total           7507      7507          -
|  #   .   .   .   .         Missing           58
+----------------------                     -----
0               7200000                      7565
(More than 99 unique values)

ks09aG:  G ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|                            Negative           -         -          -
|                            Zero               -         -          -
|                            Positive           -         -          -
|                                           -----     -----      -----
|                            Total              -         -          -
|                            Missing         7565
+----------------------                     -----
.             -9.0e+307                      7565
   (0 unique value)

. *V.4 Generate median variables;
. ****************************************************************************;
. for var ks*: egen medcomX=median(X), by(commid97);

->  egen medcomks08A=median(ks08A), by(commid97)
(7 missing values generated)

->  egen medcomks09aA=median(ks09aA), by(commid97)
(7 missing values generated)

->  egen medcomks08B=median(ks08B), by(commid97)
(2 missing values generated)

->  egen medcomks09aB=median(ks09aB), by(commid97)
(4 missing values generated)

->  egen medcomks08C=median(ks08C), by(commid97)
(10 missing values generated)

->  egen medcomks09aC=median(ks09aC), by(commid97)
(4 missing values generated)

->  egen medcomks08D=median(ks08D), by(commid97)
(13 missing values generated)

->  egen medcomks09aD=median(ks09aD), by(commid97)
(4 missing values generated)

->  egen medcomks08E=median(ks08E), by(commid97)
(21 missing values generated)

->  egen medcomks09aE=median(ks09aE), by(commid97)
(7565 missing values generated)

->  egen medcomks08F=median(ks08F), by(commid97)
(5 missing values generated)

->  egen medcomks09aF=median(ks09aF), by(commid97)
(4 missing values generated)

->  egen medcomks08G=median(ks08G), by(commid97)
(9 missing values generated)

->  egen medcomks09aG=median(ks09aG), by(commid97)
(7565 missing values generated)

. for var ks*: egen medkecX=median(X), by(kecid);

->  egen medkecks08A=median(ks08A), by(kecid)
(5 missing values generated)

->  egen medkecks09aA=median(ks09aA), by(kecid)
(5 missing values generated)

->  egen medkecks08B=median(ks08B), by(kecid)
(2 missing values generated)

->  egen medkecks09aB=median(ks09aB), by(kecid)
(4 missing values generated)

->  egen medkecks08C=median(ks08C), by(kecid)
(8 missing values generated)

->  egen medkecks09aC=median(ks09aC), by(kecid)
(4 missing values generated)

->  egen medkecks08D=median(ks08D), by(kecid)
(9 missing values generated)

->  egen medkecks09aD=median(ks09aD), by(kecid)
(4 missing values generated)

->  egen medkecks08E=median(ks08E), by(kecid)
(17 missing values generated)

->  egen medkecks09aE=median(ks09aE), by(kecid)
(7565 missing values generated)

->  egen medkecks08F=median(ks08F), by(kecid)
(4 missing values generated)

->  egen medkecks09aF=median(ks09aF), by(kecid)
(4 missing values generated)

->  egen medkecks08G=median(ks08G), by(kecid)
(7 missing values generated)

->  egen medkecks09aG=median(ks09aG), by(kecid)
(7565 missing values generated)

. for var ks*: egen medkabX=median(X), by(kabid);

->  egen medkabks08A=median(ks08A), by(kabid)

->  egen medkabks09aA=median(ks09aA), by(kabid)

->  egen medkabks08B=median(ks08B), by(kabid)

->  egen medkabks09aB=median(ks09aB), by(kabid)

->  egen medkabks08C=median(ks08C), by(kabid)

->  egen medkabks09aC=median(ks09aC), by(kabid)

->  egen medkabks08D=median(ks08D), by(kabid)
(1 missing value generated)

->  egen medkabks09aD=median(ks09aD), by(kabid)

->  egen medkabks08E=median(ks08E), by(kabid)

->  egen medkabks09aE=median(ks09aE), by(kabid)
(7565 missing values generated)

->  egen medkabks08F=median(ks08F), by(kabid)

->  egen medkabks09aF=median(ks09aF), by(kabid)

->  egen medkabks08G=median(ks08G), by(kabid)

->  egen medkabks09aG=median(ks09aG), by(kabid)
(7565 missing values generated)

. *V.5. Imputation;
. ****************************************************************************;
. for var ks*: gen origX=X;

->  gen origks08A=ks08A
(89 missing values generated)

->  gen origks09aA=ks09aA
(89 missing values generated)

->  gen origks08B=ks08B
(25 missing values generated)

->  gen origks09aB=ks09aB
(23 missing values generated)

->  gen origks08C=ks08C
(84 missing values generated)

->  gen origks09aC=ks09aC
(34 missing values generated)

->  gen origks08D=ks08D
(144 missing values generated)

->  gen origks09aD=ks09aD
(23 missing values generated)

->  gen origks08E=ks08E
(187 missing values generated)

->  gen origks09aE=ks09aE
(7565 missing values generated)

->  gen origks08F=ks08F
(19 missing values generated)

->  gen origks09aF=ks09aF
(28 missing values generated)

->  gen origks08G=ks08G
(58 missing values generated)

->  gen origks09aG=ks09aG
(7565 missing values generated)

. for var ks08*: replace X=medcomX if X==. & origea==1  & _outlierks08~=1;

->  replace ks08A=medcomks08A if ks08A==. & origea==1 & _outlierks08~=1
(69 real changes made)

->  replace ks08B=medcomks08B if ks08B==. & origea==1 & _outlierks08~=1
(20 real changes made)

->  replace ks08C=medcomks08C if ks08C==. & origea==1 & _outlierks08~=1
(64 real changes made)

->  replace ks08D=medcomks08D if ks08D==. & origea==1 & _outlierks08~=1
ks08D was long now double
(116 real changes made)

->  replace ks08E=medcomks08E if ks08E==. & origea==1 & _outlierks08~=1
ks08E was long now double
(148 real changes made)

->  replace ks08F=medcomks08F if ks08F==. & origea==1 & _outlierks08~=1
(12 real changes made)

->  replace ks08G=medcomks08G if ks08G==. & origea==1 & _outlierks08~=1
(41 real changes made)

. for var ks08*: replace X=medkecX if X==. & _outlierks08~=1;

->  replace ks08A=medkecks08A if ks08A==. & _outlierks08~=1
(14 real changes made)

->  replace ks08B=medkecks08B if ks08B==. & _outlierks08~=1
(3 real changes made)

->  replace ks08C=medkecks08C if ks08C==. & _outlierks08~=1
(12 real changes made)

->  replace ks08D=medkecks08D if ks08D==. & _outlierks08~=1
(19 real changes made)

->  replace ks08E=medkecks08E if ks08E==. & _outlierks08~=1
(22 real changes made)

->  replace ks08F=medkecks08F if ks08F==. & _outlierks08~=1
(3 real changes made)

->  replace ks08G=medkecks08G if ks08G==. & _outlierks08~=1
(10 real changes made)

. for var ks08*: replace X=medkabX if X==. & _outlierks08~=1;

->  replace ks08A=medkabks08A if ks08A==. & _outlierks08~=1
(5 real changes made)

->  replace ks08B=medkabks08B if ks08B==. & _outlierks08~=1
(2 real changes made)

->  replace ks08C=medkabks08C if ks08C==. & _outlierks08~=1
(8 real changes made)

->  replace ks08D=medkabks08D if ks08D==. & _outlierks08~=1
(8 real changes made)

->  replace ks08E=medkabks08E if ks08E==. & _outlierks08~=1
(17 real changes made)

->  replace ks08F=medkabks08F if ks08F==. & _outlierks08~=1
(4 real changes made)

->  replace ks08G=medkabks08G if ks08G==. & _outlierks08~=1
(7 real changes made)

. for var ks09*: replace X=medcomX if X==. & origea==1  & _outlierks09~=1;

->  replace ks09aA=medcomks09aA if ks09aA==. & origea==1 & _outlierks09~=1
(76 real changes made)

->  replace ks09aB=medcomks09aB if ks09aB==. & origea==1 & _outlierks09~=1
(18 real changes made)

->  replace ks09aC=medcomks09aC if ks09aC==. & origea==1 & _outlierks09~=1
(28 real changes made)

->  replace ks09aD=medcomks09aD if ks09aD==. & origea==1 & _outlierks09~=1
(18 real changes made)

->  replace ks09aE=medcomks09aE if ks09aE==. & origea==1 & _outlierks09~=1
(0 real changes made)

->  replace ks09aF=medcomks09aF if ks09aF==. & origea==1 & _outlierks09~=1
(23 real changes made)

->  replace ks09aG=medcomks09aG if ks09aG==. & origea==1 & _outlierks09~=1
(0 real changes made)

. for var ks09*: replace X=medkecX if X==. & _outlierks09~=1;

->  replace ks09aA=medkecks09aA if ks09aA==. & _outlierks09~=1
(8 real changes made)

->  replace ks09aB=medkecks09aB if ks09aB==. & _outlierks09~=1
(1 real change made)

->  replace ks09aC=medkecks09aC if ks09aC==. & _outlierks09~=1
(2 real changes made)

->  replace ks09aD=medkecks09aD if ks09aD==. & _outlierks09~=1
(1 real change made)

->  replace ks09aE=medkecks09aE if ks09aE==. & _outlierks09~=1
(0 real changes made)

->  replace ks09aF=medkecks09aF if ks09aF==. & _outlierks09~=1
(1 real change made)

->  replace ks09aG=medkecks09aG if ks09aG==. & _outlierks09~=1
(0 real changes made)

. for var ks09*: replace X=medkabX if X==. & _outlierks09~=1;

->  replace ks09aA=medkabks09aA if ks09aA==. & _outlierks09~=1
(5 real changes made)

->  replace ks09aB=medkabks09aB if ks09aB==. & _outlierks09~=1
(4 real changes made)

->  replace ks09aC=medkabks09aC if ks09aC==. & _outlierks09~=1
(4 real changes made)

->  replace ks09aD=medkabks09aD if ks09aD==. & _outlierks09~=1
(4 real changes made)

->  replace ks09aE=medkabks09aE if ks09aE==. & _outlierks09~=1
(0 real changes made)

->  replace ks09aF=medkabks09aF if ks09aF==. & _outlierks09~=1
(4 real changes made)

->  replace ks09aG=medkabks09aG if ks09aG==. & _outlierks09~=1
(0 real changes made)

. ********************* START OF "MANUAL" IMPUTATION  OF KS06 ********************************************************;
. replace ks08A=medkabks08A if origks08A==. & commid=="31AE";
(1 real change made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32BP";
(1 real change made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32BR";
(0 real changes made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32BV";
(0 real changes made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32EG";
(0 real changes made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32KV";
(0 real changes made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32NL";
(1 real change made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32OM";
(1 real change made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32OW";
(1 real change made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32K8";
(0 real changes made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32OS";
(0 real changes made)

. replace ks08A=medkabks08A if origks08A==. & commid=="32KV";
(0 real changes made)

. replace ks08A=medkabks08A if origks08A==. & commid=="52AC";
(0 real changes made)

. replace ks08A=medkecks08A if origks08A==. & commid=="13C9";
(0 real changes made)

. replace ks08A=medkecks08A if origks08A==. & commid=="3102";
(1 real change made)

. replace ks08A=medkecks08A if origks08A==. & commid=="3105";
(0 real changes made)

. replace ks08A=medkecks08A if origks08A==. & commid=="32KF";
(0 real changes made)

. replace ks08A=medkecks08A if origks08A==. & commid=="32NP";
(0 real changes made)

. replace ks08A=medkecks08A if origks08A==. & commid=="34B4";
(0 real changes made)

. replace ks08A=medkecks08A if origks08A==. & commid=="63AO";
(0 real changes made)

. replace ks08A=medkecks08A if origks08A==. & commid=="63CJ";
(0 real changes made)

. replace ks08B=medkabks08B if origks08B==. & commid=="32EG";
(0 real changes made)

. replace ks08B=medkabks08B if origks08B==. & commid=="34BZ";
(0 real changes made)

. replace ks08B=medkabks08B if origks08B==. & commid=="52AC";
(0 real changes made)

. replace ks08B=medkabks08B if origks08B==. & commid=="32KF";
(0 real changes made)

. replace ks08B=medkabks08B if origks08B==. & commid=="63CJ";
(0 real changes made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32BP";
(1 real change made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32BR";
(0 real changes made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32BV";
(0 real changes made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32EG";
(0 real changes made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32KV";
(0 real changes made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32LR";
(0 real changes made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32NL";
(1 real change made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32OM";
(1 real change made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32ON";
(1 real change made)

. replace ks08C=medkabks08C if origks08C==. & commid=="32OW";
(1 real change made)

. replace ks08C=medkabks08C if origks08C==. & commid=="33E8";
(0 real changes made)

. replace ks08C=medkabks08C if origks08C==. & commid=="33K5";
(0 real changes made)

. replace ks08C=medkabks08C if origks08C==. & commid=="33K8";
(1 real change made)

. replace ks08C=medkabks08C if origks08C==. & commid=="33OS";
(1 real change made)

. replace ks08C=medkabks08C if origks08C==. & commid=="52AC";
(0 real changes made)

. replace ks08C=medkecks08C if origks08C==. & commid=="32KF";
(0 real changes made)

. replace ks08C=medkecks08C if origks08C==. & commid=="32NJ";
(0 real changes made)

. replace ks08C=medkecks08C if origks08C==. & commid=="32NP";
(0 real changes made)

. replace ks08C=medkecks08C if origks08C==. & commid=="63AO";
(0 real changes made)

. replace ks08C=medkecks08C if origks08C==. & commid=="63CJ";
(0 real changes made)

. replace ks08D=medkabks08D if origks08D==. & commid=="31AH";
(2 real changes made)

. replace ks08D=medkabks08D if origks08D==. & commid=="32BI";
(1 real change made)

. replace ks08D=medkabks08D if origks08D==. & commid=="32BP";
(1 real change made)

. replace ks08D=medkabks08D if origks08D==. & commid=="32BV";
(0 real changes made)

. replace ks08D=medkabks08D if origks08D==. & commid=="32EG";
(0 real changes made)

. replace ks08D=medkabks08D if origks08D==. & commid=="32LR";
(0 real changes made)

. replace ks08D=medkabks08D if origks08D==. & commid=="32NL";
(0 real changes made)

. replace ks08D=medkabks08D if origks08D==. & commid=="32OM";
(1 real change made)

. replace ks08D=medkabks08D if origks08D==. & commid=="32OW";
(1 real change made)

. replace ks08D=medkabks08D if origks08D==. & commid=="33E8";
(0 real changes made)

. replace ks08D=medkabks08D if origks08D==. & commid=="34BZ";
(1 real change made)

. replace ks08D=medkabks08D if origks08D==. & commid=="34CC";
(1 real change made)

. replace ks08D=medkabks08D if origks08D==. & commid=="35QY";
(0 real changes made)

. replace ks08D=medkabks08D if origks08D==. & commid=="52AC";
(0 real changes made)

. replace ks08D=medkabks08D if origks08D==. & commid=="63DI";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="31AW";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="32C2";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="32KF";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="32LJ";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="32NJ";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="32NP";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="32OV";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="52BW";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="63AO";
(0 real changes made)

. replace ks08D=medkecks08D if origks08D==. & commid=="63CJ";
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="13B6";
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="16BH" ;
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="31AH" ;
(1 real change made)

. replace ks08E=medkabks08E if origks08E==. & commid=="32AR";
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="32BV";
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="32CK";
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="32EG" ;
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="32KV" ;
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="32LR";
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="32NL";
(1 real change made)

. replace ks08E=medkabks08E if origks08E==. & commid=="32OW";
(1 real change made)

. replace ks08E=medkabks08E if origks08E==. & commid=="33E8" ;
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="33G8" ;
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="33K8";
(1 real change made)

. replace ks08E=medkabks08E if origks08E==. & commid=="33KK";
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="33KL";
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="33NK" ;
(1 real change made)

. replace ks08E=medkabks08E if origks08E==. & commid=="33OS" ;
(1 real change made)

. replace ks08E=medkabks08E if origks08E==. & commid=="34BZ";
(1 real change made)

. replace ks08E=medkabks08E if origks08E==. & commid=="35IS";
(1 real change made)

. replace ks08E=medkabks08E if origks08E==. & commid=="35MO";
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="35QT" ;
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="35QX" ;
(0 real changes made)

. replace ks08E=medkabks08E if origks08E==. & commid=="35RC";
(1 real change made)

. replace ks08E=medkabks08E if origks08E==. & commid=="5206";
(1 real change made)

. replace ks08E=medkecks08E if origks08E==. & commid=="31AW";
(0 real changes made)

. replace ks08E=medkecks08E if origks08E==. & commid=="31AZ";
(0 real changes made)

. replace ks08E=medkecks08E if origks08E==. & commid=="31BC";
(0 real changes made)

. replace ks08E=medkecks08E if origks08E==. & commid=="32C2";
(0 real changes made)

. replace ks08E=medkecks08E if origks08E==. & commid=="32K3";
(0 real changes made)

. replace ks08E=medkecks08E if origks08E==. & commid=="32K4";
(0 real changes made)

. replace ks08E=medkecks08E if origks08E==. & commid=="32KF";
(0 real changes made)

. replace ks08E=medkecks08E if origks08E==. & commid=="32LF";
(0 real changes made)

. replace ks08E=medkecks08E if origks08E==. & commid=="32LJ";
(0 real changes made)

. replace ks08E=medkecks08E if origks08E==. & commid=="52BW";
(0 real changes made)

. replace ks08F=medkabks08F if origks08F==. & commid=="32D9";
(1 real change made)

. replace ks08F=medkabks08F if origks08F==. & commid=="32EG";
(0 real changes made)

. replace ks08F=medkabks08F if origks08F==. & commid=="33E8" ;
(0 real changes made)

. replace ks08F=medkabks08F if origks08F==. & commid=="52AC";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="31AK";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="31AN";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="32BI";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="32BV";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="32EG";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="32NL";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="32NQ";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="32ON";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="33E8";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="35QY";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="52AC";
(0 real changes made)

. replace ks08G=medkabks08G if origks08G==. & commid=="63CM";
(1 real change made)

. replace ks08G=medkecks08G if origks08G==. & commid=="13BV";
(0 real changes made)

. replace ks08G=medkecks08G if origks08G==. & commid=="31A9";
(0 real changes made)

. replace ks08G=medkecks08G if origks08G==. & commid=="32K3";
(0 real changes made)

. replace ks08G=medkecks08G if origks08G==. & commid=="32KF";
(0 real changes made)

. *ks09a
> replace ks09aA=medkabks09aA if origks09aA==. & commid=="32BV";
. replace ks09aA=medkabks09aA if origks09aA==. & commid=="32EG";
(0 real changes made)

. replace ks09aA=medkabks09aA if origks09aA==. & commid=="33K8";
(0 real changes made)

. replace ks09aA=medkabks09aA if origks09aA==. & commid=="34BE";
(0 real changes made)

. replace ks09aA=medkabks09aA if origks09aA==. & commid=="34CC";
(0 real changes made)

. replace ks09aA=medkabks09aA if origks09aA==. & commid=="35C9";
(0 real changes made)

. replace ks09aA=medkabks09aA if origks09aA==. & commid=="52AC";
(0 real changes made)

. replace ks09aA=medkabks09aA if origks09aA==. & commid=="63CM";
(1 real change made)

. replace ks09aA=medkecks09aA if origks09aA==. & commid=="16A4";
(0 real changes made)

. replace ks09aA=medkecks09aA if origks09aA==. & commid=="3105" ;
(0 real changes made)

. replace ks09aA=medkecks09aA if origks09aA==. & commid=="32KF" ;
(0 real changes made)

. replace ks09aA=medkecks09aA if origks09aA==. & commid=="35BS" ;
(0 real changes made)

. replace ks09aA=medkecks09aA if origks09aA==. & commid=="63AO";
(0 real changes made)

. replace ks09aB=medkabks09aB if origks09aB==. & commid=="32EG";
(0 real changes made)

. replace ks09aB=medkabks09aB if origks09aB==. & commid=="34BE";
(0 real changes made)

. replace ks09aB=medkabks09aB if origks09aB==. & commid=="52AC";
(0 real changes made)

. replace ks09aB=medkecks09aB if origks09aB==. & commid=="32KF";
(0 real changes made)

. replace ks09aC=medkabks09aC if origks09aC==. & commid=="32EG";
(0 real changes made)

. replace ks09aC=medkabks09aC if origks09aC==. & commid=="33E8";
(0 real changes made)

. replace ks09aC=medkabks09aC if origks09aC==. & commid=="33K8";
(0 real changes made)

. replace ks09aC=medkabks09aC if origks09aC==. & commid=="35QT";
(0 real changes made)

. replace ks09aC=medkabks09aC if origks09aC==. & commid=="52AC";
(0 real changes made)

. replace ks09aC=medkecks09aC if origks09aC==. & commid=="32KF";
(0 real changes made)

. replace ks09aD=medkabks09aD if origks09aD==. & commid=="32EG";
(0 real changes made)

. replace ks09aD=medkabks09aD if origks09aD==. & commid=="33E8";
(0 real changes made)

. replace ks09aD=medkabks09aD if origks09aD==. & commid=="52AC";
(0 real changes made)

. replace ks09aD=medkecks09aD if origks09aD==. & commid=="32KF";
(0 real changes made)

. replace ks09aF=medkabks09aF if origks09aF==. & commid=="32EG";
(0 real changes made)

. replace ks09aF=medkabks09aF if origks09aF==. & commid=="33E8";
(0 real changes made)

. replace ks09aF=medkabks09aF if origks09aF==. & commid=="52AC";
(0 real changes made)

. replace ks09aF=medkecks09aF if origks09aF==. & commid=="32KF";
(0 real changes made)

. for var ks*: replace X=medcomX if origX==. & X==.;

->  replace ks08A=medcomks08A if origks08A==. & ks08A==.
(0 real changes made)

->  replace ks09aA=medcomks09aA if origks09aA==. & ks09aA==.
(0 real changes made)

->  replace ks08B=medcomks08B if origks08B==. & ks08B==.
(0 real changes made)

->  replace ks09aB=medcomks09aB if origks09aB==. & ks09aB==.
(0 real changes made)

->  replace ks08C=medcomks08C if origks08C==. & ks08C==.
(0 real changes made)

->  replace ks09aC=medcomks09aC if origks09aC==. & ks09aC==.
(0 real changes made)

->  replace ks08D=medcomks08D if origks08D==. & ks08D==.
(0 real changes made)

->  replace ks09aD=medcomks09aD if origks09aD==. & ks09aD==.
(0 real changes made)

->  replace ks08E=medcomks08E if origks08E==. & ks08E==.
(0 real changes made)

->  replace ks09aE=medcomks09aE if origks09aE==. & ks09aE==.
(0 real changes made)

->  replace ks08F=medcomks08F if origks08F==. & ks08F==.
(0 real changes made)

->  replace ks09aF=medcomks09aF if origks09aF==. & ks09aF==.
(0 real changes made)

->  replace ks08G=medcomks08G if origks08G==. & ks08G==.
(0 real changes made)

->  replace ks09aG=medcomks09aG if origks09aG==. & ks09aG==.
(0 real changes made)

. for var ks08*: replace X=. if _outlierks08==1;

->  replace ks08A=. if _outlierks08==1
(1 real change made, 1 to missing)

->  replace ks08B=. if _outlierks08==1
(1 real change made, 1 to missing)

->  replace ks08C=. if _outlierks08==1
(1 real change made, 1 to missing)

->  replace ks08D=. if _outlierks08==1
(1 real change made, 1 to missing)

->  replace ks08E=. if _outlierks08==1
(1 real change made, 1 to missing)

->  replace ks08F=. if _outlierks08==1
(1 real change made, 1 to missing)

->  replace ks08G=. if _outlierks08==1
(1 real change made, 1 to missing)

. for var ks09*: replace X=. if _outlierks09==1;

->  replace ks09aA=. if _outlierks09==1
(0 real changes made)

->  replace ks09aB=. if _outlierks09==1
(0 real changes made)

->  replace ks09aC=. if _outlierks09==1
(0 real changes made)

->  replace ks09aD=. if _outlierks09==1
(0 real changes made)

->  replace ks09aE=. if _outlierks09==1
(0 real changes made)

->  replace ks09aF=. if _outlierks09==1
(0 real changes made)

->  replace ks09aG=. if _outlierks09==1
(0 real changes made)

. ********************* END OF "MANUAL" IMPUTATION  FOR KR08 AND KR09 ********************************************************;
. inspect ks*;

ks08A:  A ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero             861       861          -
|  #                         Positive        6703      6703          -
|  #                                        -----     -----      -----
|  #                         Total           7564      7564          -
|  #   .   .   .   .         Missing            1
+----------------------                     -----
0              1.00e+07                      7565
(More than 99 unique values)

ks09aA:  A ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            5655      5655          -
|  #                         Positive        1910      1910          -
|  #                                        -----     -----      -----
|  #                         Total           7565      7565          -
|  #   .   .   .   .         Missing            -
+----------------------                     -----
0               4500000                      7565
(More than 99 unique values)

ks08B:  B ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            4344      4344          -
|  #                         Positive        3220      3220          -
|  #                                        -----     -----      -----
|  #                         Total           7564      7564          -
|  #   .   .   .   .         Missing            1
+----------------------                     -----
0               8100000                      7565
(More than 99 unique values)

ks09aB:  B ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7254      7254          -
|  #                         Positive         311       311          -
|  #                                        -----     -----      -----
|  #                         Total           7565      7565          -
|  #   .   .   .   .         Missing            -
+----------------------                     -----
0               1500000                      7565
  (71 unique values)

ks08C:  C ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            2194      2194          -
|  #                         Positive        5370      5370          -
|  #                                        -----     -----      -----
|  #                         Total           7564      7564          -
|  #   .   .   .   .         Missing            1
+----------------------                     -----
0              1.30e+07                      7565
(More than 99 unique values)

ks09aC:  C ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7221      7221          -
|  #                         Positive         344       344          -
|  #                                        -----     -----      -----
|  #                         Total           7565      7565          -
|  #   .   .   .   .         Missing            -
+----------------------                     -----
0              1.00e+07                      7565
  (91 unique values)

ks08D:  D ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero             851       851          -
|  #                         Positive        6712      6710          2
|  #                                        -----     -----      -----
|  #                         Total           7563      7561          2
|  #   .   .   .   .         Missing            2
+----------------------                     -----
0              2.50e+07                      7565
(More than 99 unique values)

ks09aD:  D ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7121      7121          -
|  #                         Positive         444       444          -
|  #                                        -----     -----      -----
|  #                         Total           7565      7565          -
|  #   .   .   .   .         Missing            -
+----------------------                     -----
0              2.00e+07                      7565
(More than 99 unique values)

ks08E:  E ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            2399      2399          -
|  #                         Positive        5165      5161          4
|  #                                        -----     -----      -----
|  #                         Total           7564      7560          4
|  #   .   .   .   .         Missing            1
+----------------------                     -----
0               3000000                      7565
(More than 99 unique values)

ks09aE:  E ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|                            Negative           -         -          -
|                            Zero               -         -          -
|                            Positive           -         -          -
|                                           -----     -----      -----
|                            Total              -         -          -
|                            Missing         7565
+----------------------                     -----
.             -9.0e+307                      7565
   (0 unique value)

ks08F:  F ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            6269      6269          -
|  #                         Positive        1295      1295          -
|  #                                        -----     -----      -----
|  #                         Total           7564      7564          -
|  #   .   .   .   .         Missing            1
+----------------------                     -----
0              1.10e+08                      7565
(More than 99 unique values)

ks09aF:  F ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            7473      7473          -
|  #                         Positive          92        92          -
|  #                                        -----     -----      -----
|  #                         Total           7565      7565          -
|  #   .   .   .   .         Missing            -
+----------------------                     -----
0               3600000                      7565
  (47 unique values)

ks08G:  G ks08                                  Number of Observations
--------------                              ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero            6429      6429          -
|  #                         Positive        1135      1135          -
|  #                                        -----     -----      -----
|  #                         Total           7564      7564          -
|  #   .   .   .   .         Missing            1
+----------------------                     -----
0               7200000                      7565
(More than 99 unique values)

ks09aG:  G ks09a                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|                            Negative           -         -          -
|                            Zero               -         -          -
|                            Positive           -         -          -
|                                           -----     -----      -----
|                            Total              -         -          -
|                            Missing         7565
+----------------------                     -----
.             -9.0e+307                      7565
   (0 unique value)

. compress ;
medcomks09aE was float now byte
medcomks09aG was float now byte
medkecks09aE was float now byte
medkecks09aG was float now byte
medkabks09aB was float now int
medkabks09aE was float now byte
medkabks09aF was float now byte
medkabks09aG was float now byte
origks09aE was float now byte
origks09aG was float now byte

. sort hhid;

. * V.6. Generate variable containing information on missing values in this data file ;
. ****************************************************************************;
. gen sumks08=ks08A+ks08B+ks08C+ks08D+ks08E+ks08F+ks08G;
(2 missing values generated)

. capture drop missks08;

. gen missks08=(sumks08==.);

. gen sumks09=ks09aA+ks09aB+ks09aC+ks09aD+ks09aF;

. capture drop missks09;

. gen missks09=(sumks09==.);

. *V.7. Save the data;
. ****************************************************************************;
. lab var  missks08 "Household w/ at least 1 KS08 missing";

. lab var  missks09 "Household w/ at least 1 KS09a missing";

. tab1 miss*;

-> tabulation of missks08  

  Household |
w/ at least |
     1 KS08 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,563       99.97       99.97
          1 |          2        0.03      100.00
------------+-----------------------------------
      Total |      7,565      100.00

-> tabulation of missks09  

  Household |
w/ at least |
    1 KS09a |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,565      100.00      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. drop med* origk* sum*;

. compress;
missks08 was float now byte
missks09 was float now byte

. sort hhid;

. save $dir0\b1_ks397, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\b1_ks397.dta saved

. ********************************************************************************;
. * VI. B1_KS0;
. ********************************************************************************;
. #delimit ;
delimiter now ;
. use  hhid ks04b ks07a ks10aa ks10ab ks11aa ks11ab ks12aa ks12ab ks12bb using $dir2\b1_ks0, clear;
(Bk 1 Consumption (1)-Misc. )

. sort hhid;

. merge hhid using $dir0\hhlist1997;

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |         54        0.71        0.71
          3 |      7,565       99.29      100.00
------------+-----------------------------------
      Total |      7,619      100.00

. keep if _merge==3;
(54 observations deleted)

. drop _merge commid93;

. * VI.1 Identifying outliers;
. ****************************************************************************;
. gen _outlierks0=1 if ks04b>500000 & ks04b~=.;
(7563 missing values generated)

. list hhid ks04b  if ks04b>500000 & ks04b~=.;

      +-------------------+
      |  hhid97     ks04b |
      |-------------------|
1246. | 0541400   5000000 |
7437. | 3161800   3000000 |
      +-------------------+

. replace ks04b=. if ks04b>500000 & ks04b~=.;
(2 real changes made, 2 to missing)

. replace _outlierks0=1 if ks07a>3000000 & ks07a~=.;
(1 real change made)

.  list hhid ks07a if ks07a>3000000 & ks07a~=.;

      +-------------------+
      |  hhid97     ks07a |
      |-------------------|
3787. | 1701500   8000000 |
      +-------------------+

. replace ks07a=. if ks07a>3000000 & ks07a~=.;
(1 real change made, 1 to missing)

. replace _outlierks0=1 if ks11aa>2800000 & ks11aa~=.;
(1 real change made)

. list hhid ks11aa if ks11aa>2800000 & ks11aa~=.;

      +--------------------+
      |  hhid97     ks11aa |
      |--------------------|
1590. | 0671300   11500000 |
      +--------------------+

. replace ks11aa=. if ks11aa>2800000 & ks11aa~=.;
(1 real change made, 1 to missing)

. lab var _outlierks0 "Any outlier in ks0.dta";

. mvencode _outlierks0, mv(0);
 _outlierks0: 7561 missing values recoded

. tab _outlierks0;

Any outlier |
 in ks0.dta |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. * VI.2  Generate medians;
. ****************************************************************************;
. for var ks*: egen medcomX=median(X), by(commid97);

->  egen medcomks04b=median(ks04b), by(commid97)
(6 missing values generated)

->  egen medcomks07a=median(ks07a), by(commid97)
(10 missing values generated)

->  egen medcomks10aa=median(ks10aa), by(commid97)
(3 missing values generated)

->  egen medcomks10ab=median(ks10ab), by(commid97)
(1 missing value generated)

->  egen medcomks11aa=median(ks11aa), by(commid97)
(4 missing values generated)

->  egen medcomks11ab=median(ks11ab), by(commid97)
(2 missing values generated)

->  egen medcomks12aa=median(ks12aa), by(commid97)
(4 missing values generated)

->  egen medcomks12ab=median(ks12ab), by(commid97)
(2 missing values generated)

->  egen medcomks12bb=median(ks12bb), by(commid97)
(2 missing values generated)

. for var ks*: egen medkecX=median(X), by(kecid);

->  egen medkecks04b=median(ks04b), by(kecid)
(5 missing values generated)

->  egen medkecks07a=median(ks07a), by(kecid)
(8 missing values generated)

->  egen medkecks10aa=median(ks10aa), by(kecid)
(2 missing values generated)

->  egen medkecks10ab=median(ks10ab), by(kecid)
(1 missing value generated)

->  egen medkecks11aa=median(ks11aa), by(kecid)
(3 missing values generated)

->  egen medkecks11ab=median(ks11ab), by(kecid)
(2 missing values generated)

->  egen medkecks12aa=median(ks12aa), by(kecid)
(3 missing values generated)

->  egen medkecks12ab=median(ks12ab), by(kecid)
(2 missing values generated)

->  egen medkecks12bb=median(ks12bb), by(kecid)
(2 missing values generated)

. for var ks*: egen medkabX=median(X), by(kabid);

->  egen medkabks04b=median(ks04b), by(kabid)

->  egen medkabks07a=median(ks07a), by(kabid)

->  egen medkabks10aa=median(ks10aa), by(kabid)

->  egen medkabks10ab=median(ks10ab), by(kabid)

->  egen medkabks11aa=median(ks11aa), by(kabid)

->  egen medkabks11ab=median(ks11ab), by(kabid)

->  egen medkabks12aa=median(ks12aa), by(kabid)

->  egen medkabks12ab=median(ks12ab), by(kabid)

->  egen medkabks12bb=median(ks12bb), by(kabid)

. * VI.3 Imputation
> ****************************************************************************;
. for var ks*: gen origX=X;

->  gen origks04b=ks04b
(89 missing values generated)

->  gen origks07a=ks07a
(85 missing values generated)

->  gen origks10aa=ks10aa
(35 missing values generated)

->  gen origks10ab=ks10ab
(20 missing values generated)

->  gen origks11aa=ks11aa
(73 missing values generated)

->  gen origks11ab=ks11ab
(35 missing values generated)

->  gen origks12aa=ks12aa
(36 missing values generated)

->  gen origks12ab=ks12ab
(28 missing values generated)

->  gen origks12bb=ks12bb
(22 missing values generated)

. for var ks*: replace X=medcomX if X==. & origea==1  & _outlierks0~=1;

->  replace ks04b=medcomks04b if ks04b==. & origea==1 & _outlierks0~=1
(63 real changes made)

->  replace ks07a=medcomks07a if ks07a==. & origea==1 & _outlierks0~=1
(57 real changes made)

->  replace ks10aa=medcomks10aa if ks10aa==. & origea==1 & _outlierks0~=1
(30 real changes made)

->  replace ks10ab=medcomks10ab if ks10ab==. & origea==1 & _outlierks0~=1
(17 real changes made)

->  replace ks11aa=medcomks11aa if ks11aa==. & origea==1 & _outlierks0~=1
(64 real changes made)

->  replace ks11ab=medcomks11ab if ks11ab==. & origea==1 & _outlierks0~=1
(27 real changes made)

->  replace ks12aa=medcomks12aa if ks12aa==. & origea==1 & _outlierks0~=1
(29 real changes made)

->  replace ks12ab=medcomks12ab if ks12ab==. & origea==1 & _outlierks0~=1
(24 real changes made)

->  replace ks12bb=medcomks12bb if ks12bb==. & origea==1 & _outlierks0~=1
(18 real changes made)

. for var ks*: replace X=medkecX if X==. & _outlierks0~=1;

->  replace ks04b=medkecks04b if ks04b==. & _outlierks0~=1
(19 real changes made)

->  replace ks07a=medkecks07a if ks07a==. & _outlierks0~=1
(19 real changes made)

->  replace ks10aa=medkecks10aa if ks10aa==. & _outlierks0~=1
(3 real changes made)

->  replace ks10ab=medkecks10ab if ks10ab==. & _outlierks0~=1
(2 real changes made)

->  replace ks11aa=medkecks11aa if ks11aa==. & _outlierks0~=1
(5 real changes made)

->  replace ks11ab=medkecks11ab if ks11ab==. & _outlierks0~=1
(5 real changes made)

->  replace ks12aa=medkecks12aa if ks12aa==. & _outlierks0~=1
(4 real changes made)

->  replace ks12ab=medkecks12ab if ks12ab==. & _outlierks0~=1
(2 real changes made)

->  replace ks12bb=medkecks12bb if ks12bb==. & _outlierks0~=1
(2 real changes made)

. for var ks*: replace X=medkabX if X==. & _outlierks0~=1;

->  replace ks04b=medkabks04b if ks04b==. & _outlierks0~=1
(5 real changes made)

->  replace ks07a=medkabks07a if ks07a==. & _outlierks0~=1
(8 real changes made)

->  replace ks10aa=medkabks10aa if ks10aa==. & _outlierks0~=1
(2 real changes made)

->  replace ks10ab=medkabks10ab if ks10ab==. & _outlierks0~=1
(1 real change made)

->  replace ks11aa=medkabks11aa if ks11aa==. & _outlierks0~=1
(3 real changes made)

->  replace ks11ab=medkabks11ab if ks11ab==. & _outlierks0~=1
(2 real changes made)

->  replace ks12aa=medkabks12aa if ks12aa==. & _outlierks0~=1
(3 real changes made)

->  replace ks12ab=medkabks12ab if ks12ab==. & _outlierks0~=1
(2 real changes made)

->  replace ks12bb=medkabks12bb if ks12bb==. & _outlierks0~=1
(2 real changes made)

. ********** START OF THE 'MANUAL' IMPUTATION OF KS04B, KS07A, KS10AA, KS10AB, KS11AA, KS11AB, KS12AA, KS12AB, KS12BB*************;
. replace ks04b=medkabks04b  if origks04b==. & commid=="32BP";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32BR";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32BS";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32BV";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32C2";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32LE";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32LR";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32LU";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32NQ";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32ON";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32OW";
(0 real changes made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="32OX";
(1 real change made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="33OS";
(1 real change made)

. replace ks04b=medkabks04b  if origks04b==. & commid=="35IP";
(1 real change made)

. replace ks04b=medkecks04b if origks04b==. & commid=="3246";
(0 real changes made)

. replace ks04b=medkecks04b if origks04b==. & commid=="32K3";
(0 real changes made)

. replace ks04b=medkecks04b if origks04b==. & commid=="32K4";
(0 real changes made)

. replace ks04b=medkecks04b if origks04b==. & commid=="32KF";
(0 real changes made)

. replace ks04b=medkecks04b if origks04b==. & commid=="32LD";
(0 real changes made)

. replace ks04b=medkecks04b if origks04b==. & commid=="32NJ";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="31AN";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="3246";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32BI";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32BV";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32CK";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32EG";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32JR";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32LU";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32NL";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32NP";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32NQ";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32OM";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="32OX";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="52AC";
(0 real changes made)

. replace ks07a=medkabks07a   if origks07a==. & commid=="63CM";
(2 real changes made)

. replace ks07a=medkecks07a if origks07a==. & commid=="32K3";
(0 real changes made)

. replace ks07a=medkecks07a if origks07a==. & commid=="32K4";
(0 real changes made)

. replace ks07a=medkecks07a if origks07a==. & commid=="32K6";
(0 real changes made)

. replace ks07a=medkecks07a if origks07a==. & commid=="32KF";
(0 real changes made)

. replace ks07a=medkecks07a if origks07a==. & commid=="32LD";
(0 real changes made)

. replace ks07a=medkecks07a if origks07a==. & commid=="32LJ";
(0 real changes made)

. replace ks10aa=medkabks10aa    if origks10aa==. & commid=="32EG";
(0 real changes made)

. replace ks10aa=medkabks10aa    if origks10aa==. & commid=="52AC";
(0 real changes made)

. replace ks10aa=medkecks10aa if origks10aa==. & commid=="31AW";
(0 real changes made)

. replace ks10aa=medkecks10aa if origks10aa==. & commid=="32KF";
(0 real changes made)

. replace ks10aa=medkecks10aa if origks10aa==. & commid=="63CJ";
(0 real changes made)

. replace ks10ab=medkabks10ab    if origks10ab==. & commid=="31A1";
(0 real changes made)

. replace ks10ab=medkabks10ab    if origks10ab==. & commid=="52AC";
(0 real changes made)

. replace ks10ab=medkecks10ab if origks10ab==. & commid=="32KF";
(0 real changes made)

. replace ks11aa=medkabks11aa   if origks11aa==. & commid=="13CX";
(1 real change made)

. replace ks11aa=medkabks11aa   if origks11aa==. & commid=="32EG";
(0 real changes made)

. replace ks11aa=medkabks11aa   if origks11aa==. & commid=="32NL";
(1 real change made)

. replace ks11aa=medkabks11aa   if origks11aa==. & commid=="33E8";
(0 real changes made)

. replace ks11aa=medkabks11aa   if origks11aa==. & commid=="52AC";
(0 real changes made)

. replace ks11aa=medkecks11aa if origks11aa==. & commid=="32KF";
(0 real changes made)

. replace ks11aa=medkecks11aa if origks11aa==. & commid=="32NP";
(0 real changes made)

. replace ks11aa=medkecks11aa if origks11aa==. & commid=="63CJ";
(0 real changes made)

. replace ks11ab=medkabks11ab    if origks11ab==. & commid=="31A1";
(0 real changes made)

. replace ks11ab=medkabks11ab    if origks11ab==. & commid=="33E8";
(0 real changes made)

. replace ks11ab=medkabks11ab    if origks11ab==. & commid=="33K8";
(0 real changes made)

. replace ks11ab=medkabks11ab    if origks11ab==. & commid=="33OS";
(1 real change made)

. replace ks11ab=medkabks11ab    if origks11ab==. & commid=="52AC";
(0 real changes made)

. replace ks11ab=medkabks11ab    if origks11ab==. & commid=="63CM";
(0 real changes made)

. replace ks11ab=medkecks11ab if origks11ab==. & commid=="32KF";
(0 real changes made)

. replace ks12aa=medkabks12aa   if origks12aa==. & commid=="32EG";
(0 real changes made)

. replace ks12aa=medkabks12aa   if origks12aa==. & commid=="32NL";
(1 real change made)

. replace ks12aa=medkabks12aa   if origks12aa==. & commid=="33E8";
(0 real changes made)

. replace ks12aa=medkabks12aa   if origks12aa==. & commid=="52AC";
(0 real changes made)

. replace ks12aa=medkecks12aa if origks12aa==. & commid=="32KF";
(0 real changes made)

. replace ks12aa=medkecks12aa if origks12aa==. & commid=="32NP";
(0 real changes made)

. replace ks12aa=medkecks12aa if origks12aa==. & commid=="63CJ";
(0 real changes made)

. replace ks12ab=medkabks12ab   if origks12ab==. & commid=="31A1";
(0 real changes made)

. replace ks12ab=medkabks12ab   if origks12ab==. & commid=="33E8";
(0 real changes made)

. replace ks12ab=medkabks12ab   if origks12ab==. & commid=="52AC";
(0 real changes made)

. replace ks12ab=medkecks12ab if origks12ab==. & commid=="32KF";
(0 real changes made)

. replace ks12bb=medkabks12bb   if origks12bb==. & commid=="31A1";
(0 real changes made)

. replace ks12bb=medkabks12bb   if origks12bb==. & commid=="33E8";
(0 real changes made)

. replace ks12bb=medkabks12bb   if origks12bb==. & commid=="52AC";
(0 real changes made)

. replace ks12bb=medkecks12bb if origks12bb==. & commid=="32KF";
(0 real changes made)

. for var ks07a* ks10* ks1*: replace X=. if _outlierks0==1;

->  replace ks07a=. if _outlierks0==1
(3 real changes made, 3 to missing)

->  replace ks10aa=. if _outlierks0==1
(4 real changes made, 4 to missing)

->  replace ks10ab=. if _outlierks0==1
(4 real changes made, 4 to missing)

->  replace ks10aa=. if _outlierks0==1
(0 real changes made)

->  replace ks10ab=. if _outlierks0==1
(0 real changes made)

->  replace ks11aa=. if _outlierks0==1
(3 real changes made, 3 to missing)

->  replace ks11ab=. if _outlierks0==1
(3 real changes made, 3 to missing)

->  replace ks12aa=. if _outlierks0==1
(4 real changes made, 4 to missing)

->  replace ks12ab=. if _outlierks0==1
(4 real changes made, 4 to missing)

->  replace ks12bb=. if _outlierks0==1
(4 real changes made, 4 to missing)

. ********** END OF THE 'MANUAL' IMPUTATION OF KS04B, KS07A, KS10AA, KS10AB, KS11AA, KS11AB, KS12AA, KS12AB, KS12BB*************;
. * VI.4 Generate variable containing information on missing values in this data file ;
. ****************************************************************************;
. gen miss4b=1 if ks04b==.;
(7563 missing values generated)

. lab var miss4b "Household with missing ks04b";

. mvencode miss4b, mv(0);
      miss4b: 7563 missing values recoded

. tab miss4b;

  Household |
       with |
    missing |
      ks04b |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,563       99.97       99.97
          1 |          2        0.03      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. gen miss7a=1 if ks07a==.;
(7561 missing values generated)

. lab var miss7a "Household with missing ks07a";

. mvencode miss7a, mv(0);
      miss7a: 7561 missing values recoded

. tab miss7a;

  Household |
       with |
    missing |
      ks07a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. gen miss10aa=1 if ks10aa==.;
(7561 missing values generated)

. lab var miss10aa "Household with missing ks10aa";

. mvencode miss10aa, mv(0);
    miss10aa: 7561 missing values recoded

. tab miss10aa;

  Household |
       with |
    missing |
     ks10aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. gen miss10ab=1 if ks10ab==.;
(7561 missing values generated)

. lab var miss10ab "Household with missing ks10ab";

. mvencode miss10ab, mv(0);
    miss10ab: 7561 missing values recoded

. tab miss10ab;

  Household |
       with |
    missing |
     ks10ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. gen miss11aa=1 if ks11aa==.;
(7561 missing values generated)

. lab var miss11aa "Household with missing ks11aa";

. mvencode miss11aa, mv(0);
    miss11aa: 7561 missing values recoded

. tab miss11aa;

  Household |
       with |
    missing |
     ks11aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. gen miss11ab=1 if ks11ab==.;
(7561 missing values generated)

. lab var miss11aa "Household with missing ks11ab";

. mvencode miss11ab, mv(0);
    miss11ab: 7561 missing values recoded

. tab miss11ab;

   miss11ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. gen miss12aa=1 if ks12aa==.;
(7561 missing values generated)

. lab var miss12aa "Household with missing ks12aa";

. mvencode miss12aa, mv(0);
    miss12aa: 7561 missing values recoded

. tab miss12aa;

  Household |
       with |
    missing |
     ks12aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. gen miss12ab=1 if ks12ab==.;
(7561 missing values generated)

. lab var miss12ab "Household with missing ks12ab";

. mvencode miss12ab, mv(0);
    miss12ab: 7561 missing values recoded

. tab miss12ab;

  Household |
       with |
    missing |
     ks12ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. gen miss12bb=1 if ks12bb==.;
(7561 missing values generated)

. lab var miss12bb "Household with missing ks12bb";

. mvencode miss12bb, mv(0);
    miss12bb: 7561 missing values recoded

. tab miss12bb;

  Household |
       with |
    missing |
     ks12bb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.95       99.95
          1 |          4        0.05      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. drop  med* origks*;

. sort hhid ;

. compress ;
_outlierks0 was float now byte
miss4b was float now byte
miss7a was float now byte
miss10aa was float now byte
miss10ab was float now byte
miss11aa was float now byte
miss11ab was float now byte
miss12aa was float now byte
miss12ab was float now byte
miss12bb was float now byte

. label data "Shorter version of b1_ks0 created using pre_pce.do";

. save $dir0\b1_ks097, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\b1_ks097.dta saved

. ************************************************************************************;
. * VII. MERGE ALL EXPENDITURE FILES;
. ************************************************************************************;
. use $dir0\b1_ks097, clear;
(Shorter version of b1_ks0 created using pre_pce.do)

. merge hhid  using $dir0\b1_ks197;
(label prov already defined)

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |      7,565      100.00      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. * _merge=1 hh w/ outliers in ks02/ks03;
. * _merge=2 hh w/ outliers in ks04b/ks07a/ks11aa;
. list hhid _merge if _merge~=3;

. *keep if _merge==3;
. rename _merge _m1;

. sort hhid ;

. merge hhid  using $dir0\b1_ks297;
(label prov already defined)

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |      7,565      100.00      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. * _merge=1 hh w/ outliers in ks06;
. * _merge=2 hh w/ outliers in ks02/ks03/ks04b/ks07a/ks11aa;
. list hhid _merge if _merge~=3;

. *keep if _merge==3;
. rename _merge _m2 ;

. sort hhid ;

. merge hhid  using $dir0\b1_ks397;
(label prov already defined)

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |      7,565      100.00      100.00
------------+-----------------------------------
      Total |      7,565      100.00

. * _merge=1 hh w/ outliers in ks08/ks09a;
. * _merge=2 hh w/ outliers in ks02/ks03/ks04b/ks07a/ks11aa/ks06 ;
. list hhid _merge if _merge~=3;

. *keep if _merge==3;
. rename _merge _m3;

. sort hhid ;

. merge hhid  using $dir0\b2_kr97;
(label sc05_ already defined)
(label prov already defined)

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          6        0.08        0.08
          2 |         40        0.53        0.60
          3 |      7,559       99.40      100.00
------------+-----------------------------------
      Total |      7,605      100.00

. * _merge=1 hh in Book 1-KS but not in Book 2 - KR;
. * _merge=2 hh in Book 2-KR but not in Book 1 - KS;
. list hhid _merge if _merge~=3;

      +------------------+
      |  hhid97   _merge |
      |------------------|
 398. | 0191100        1 |
 535. | 0261900        1 |
1594. | 0672000        1 |
1615. | 0690800        1 |
1885. | 0851600        1 |
      |------------------|
3393. | 1561000        1 |
7566. | 0012200        2 |
7567. | 0012500        2 |
7568. | 0021600        2 |
7569. | 0022800        2 |
      |------------------|
7570. | 0040400        2 |
7571. | 0041300        2 |
7572. | 0261700        2 |
7573. | 0500200        2 |
7574. | 0670300        2 |
      |------------------|
7575. | 0681400        2 |
7576. | 0711500        2 |
7577. | 0721600        2 |
7578. | 0751800        2 |
7579. | 0760600        2 |
      |------------------|
7580. | 0771800        2 |
7581. | 0801000        2 |
7582. | 0801900        2 |
7583. | 0802000        2 |
7584. | 0861500        2 |
      |------------------|
7585. | 0870500        2 |
7586. | 0870700        2 |
7587. | 0900200        2 |
7588. | 0910700        2 |
7589. | 0970200        2 |
      |------------------|
7590. | 1001400        2 |
7591. | 1041600        2 |
7592. | 1111700        2 |
7593. | 1141400        2 |
7594. | 1291800        2 |
      |------------------|
7595. | 1560600        2 |
7596. | 1701200        2 |
7597. | 1890900        2 |
7598. | 1901600        2 |
7599. | 1990200        2 |
      |------------------|
7600. | 2012600        2 |
7601. | 2152000        2 |
7602. | 2331600        2 |
7603. | 2451111        2 |
7604. | 2551500        2 |
      |------------------|
7605. | 2781200        2 |
      +------------------+

. *keep if _merge==3;
. rename _merge _mkr;

. gen z=missks02+missks03+missks06+miss4b+miss7a+missks08+missks09+misskr+miss10aa+miss10ab+miss11aa+miss11ab+miss12aa
> +miss12ab+miss12bb;
(46 missing values generated)

. gen missing=1 if z>0 & z~=.;
(7582 missing values generated)

.  replace missing=0 if missing==. & z~=.;
(7536 real changes made)

. drop z ;

. lab var missing "Household with at least 1 part of expenditure missing";

. tab missing, m;

  Household |
    with at |
    least 1 |
    part of |
expenditure |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,536       99.09       99.09
          1 |         23        0.30       99.40
          . |         46        0.60      100.00
------------+-----------------------------------
      Total |      7,605      100.00

. save $dir0\pre_pce97.dta, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\pre_pce97.dta saved

. ******************************************************************************;
. *VIII. PCE  ;
. ******************************************************************************;
. use $dir0\pre_pce97,clear;
(Shorter version of b1_ks0 created using pre_pce.do)

. **FOOD (KS02, KS03, AND KS04B), MONTHLY;
. ** Market purchased;
. gen mrice=ks02A*52/12;
(41 missing values generated)

. gen mstaple=(ks02A+ks02B+ks02C+ks02D+ks02E)*52/12 ;
(41 missing values generated)

. gen mvege=(ks02F+ks02G+ks02H)*52/12;
(41 missing values generated)

. gen mdried=(ks02I+ks02J)*52/12 ;
(41 missing values generated)

. gen mmeat=(ks02K+ks02L+ks02OA+ks02OB)*52/12 ;
(41 missing values generated)

. gen mfish=(ks02M+ks02N)*52/12;
(41 missing values generated)

. gen mdairy=(ks02P+ks02Q)*52/12;
(41 missing values generated)

.  gen mspices=(ks02R+ks02S+ks02T+ks02U+ks02V)*52/12;
(41 missing values generated)

. gen msugar=(ks02W+ks02AA)*52/12;
(41 missing values generated)

.  gen moil=(ks02X+ks02Y)*52/12;
(41 missing values generated)

. gen mbeve=(ks02Z+ks02BA+ks02CA+ks02DA+ks02EA)*52/12 ;
(41 missing values generated)

. gen maltb=(ks02FA+ks02GA+ks02HA)*52/12 ;
(41 missing values generated)

. gen msnack=(ks02IA)*52/12;
(41 missing values generated)

. gen mfdout=(ks02IB)*52/12;
(41 missing values generated)

. **Self-produced;
. gen irice=ks03A*52/12;
(45 missing values generated)

. gen istaple=(ks03A+ks03B+ks03C+ks03D+ks03E)*52/12 ;
(45 missing values generated)

. gen ivege=(ks03F+ks03G+ks03H)*52/12;
(45 missing values generated)

. gen idried=(ks03I+ks03J)*52/12 ;
(45 missing values generated)

. gen imeat=(ks03K+ks03L+ks03OA+ks03OB)*52/12 ;
(45 missing values generated)

. gen ifish=(ks03M+ks03N)*52/12;
(45 missing values generated)

. gen idairy=(ks03P+ks03Q)*52/12;
(45 missing values generated)

.  gen ispices=(ks03R+ks03S+ks03T+ks03U+ks03V)*52/12;
(45 missing values generated)

. gen isugar=(ks03W+ks03AA)*52/12;
(45 missing values generated)

.  gen ioil=(ks03X+ks03Y)*52/12;
(45 missing values generated)

. gen ibeve=(ks03Z+ks03BA+ks03CA+ks03DA+ks03EA)*52/12 ;
(45 missing values generated)

. gen ialtb=(ks03FA+ks03GA+ks03HA)*52/12 ;
(45 missing values generated)

. gen isnack=(ks03IA)*52/12;
(45 missing values generated)

. gen ifdout=(ks03IB)*52/12;
(45 missing values generated)

.  *Consumption=market purchased+self-produced;
. gen xrice=mrice+irice;
(45 missing values generated)

. gen xstaple=mstaple+istaple;
(45 missing values generated)

. gen xvege=mvege+ivege;
(45 missing values generated)

. gen xdried=mdried+idried;
(45 missing values generated)

. gen xmeat=mmeat+imeat;
(45 missing values generated)

. gen xfish=mfish+ifish;
(45 missing values generated)

. gen xdairy=mdairy+idairy;
(45 missing values generated)

. gen xspices=mspices+ispices;
(45 missing values generated)

.  gen xsugar=msugar+isugar;
(45 missing values generated)

. gen xoil=moil+ioil;
(45 missing values generated)

. gen xbeve=mbeve+ibeve;
(45 missing values generated)

. gen xaltb=maltb+ialtb;
(45 missing values generated)

. gen xsnack=msnack+isnack;
(45 missing values generated)

. gen xfdout=mfdout+ifdout;
(45 missing values generated)

.  *TOTAL MONTHLY;
. *mfood: total ks02;
. gen mfood =mstaple+mvege+mdried+mmeat+mfish+mdairy+mspices+msugar+moil+mbeve+maltb+msnack+mfdout;
(41 missing values generated)

. *ifood: total ks03;
. gen ifood =istaple+ivege+idried+imeat+ifish+idairy+ispices+isugar+ioil+ibeve+ialtb+isnack+ifdout;
(45 missing values generated)

. *xfdtout: Food transfer, ks04b;
. gen xfdtout=ks04b*52/12;
(42 missing values generated)

. lab var xfdtout "Monthly food transfer, ks04b";

. ******************************************************************;
. *MONTHLY EXPENDITURE ON FOOD: KS02 AND KS03 (NOT INCLUDING KS04B)
> *****************************************************************;
. gen xfood =xstaple+xvege+xdried+xmeat+xfish+xdairy+xspices+xsugar+xoil+xbeve+xaltb+xsnack+xfdout;
(45 missing values generated)

. lab var xfood "Monthly food consumption, ks02 and ks03";

. lab var mrice "Monthly food consumption ks02: rice";

.  lab var mstaple "Monthly food consumption ks02: staple";

.  lab var mvege "Monthly food consumption ks02: vegetable, fruit";

. lab var mdried "Monthly food consumption ks02: dried food";

. lab var mmeat "Monthly food consumption ks02: meat";

. lab var mfish "Monthly food consumption ks02: fish";

. lab var mdairy "Monthly food consumption ks02: dairy";

. lab var mspices "Monthly food consumption ks02: spices";

. lab var msugar "Monthly food consumption ks02: sugar";

. lab var moil "Monthly food consumption ks02: oil" ;

. lab var mbeve "Monthly food consumption ks02: beverages";

. lab var maltb "Monthly food consumption ks02: alcohol/tobacco";

. lab var msnack "Monthly food consumption ks02: snacks";

. lab var mfdout "Monthly food consumption ks02: food out of home";

. lab var irice "Monthly food consumption ks03: rice";

. lab var istaple "Monthly food consumption ks03: staple";

.  lab var ivege "Monthly food consumption ks03: vegetable, fruit";

. lab var idried "Monthly food consumption ks03: dried food";

. lab var imeat "Monthly food consumption ks03: meat";

. lab var ifish "Monthly food consumption ks03: fish";

. lab var idairy "Monthly food consumption ks03: dairy";

. lab var ispices "Monthly food consumption ks03: spices";

. lab var isugar "Monthly food consumption ks03: sugar";

. lab var ioil "Monthly food consumption ks03: oil" ;

. lab var ibeve "Monthly food consumption ks03: beverages";

. lab var ialtb "Monthly food consumption ks03: alcohol/tobacco";

. lab var isnack "Monthly food consumption ks03: snacks";

. lab var ifdout "Monthly food consumption ks03: food out of home";

. lab var xrice "Monthly food consumption ks02+ks03: rice" ;

. lab var xstaple "Monthly food consumption ks02+ks03: staple";

.  lab var xvege "Monthly food consumption ks02+ks03: vegetable, fruit";

. lab var xdried "Monthly food consumption ks02+ks03: dried food";

. lab var xmeat "Monthly food consumption ks02+ks03: meat";

. lab var xfish "Monthly food consumption ks02+ks03: fish";

. lab var xdairy "Monthly food consumption ks02+ks03: dairy";

. lab var xspices "Monthly food consumption ks02+ks03: spices";

. lab var xsugar "Monthly food consumption ks02+ks03: sugar";

. lab var xoil "Monthly food consumption ks02+ks03: oil" ;

. lab var xbeve "Monthly food consumption ks02+ks03: beverages";

. lab var xaltb "Monthly food consumption ks02+ks03: alcohol/tobacco";

. lab var xsnack "Monthly food consumption ks02+ks03: snacks";

. lab var xfdout "Monthly food consumption ks02+ks03: food out of home";

. lab var mfood "Monthly food cons.,market purch. all ks02";

. lab var ifood "Monthly food cons.,own-prod. all ks03";

. *END OF FOOD;
. * NON-FOOD FROM KS2TYPE (KS06), MONTHLY;
. rename ks06A xutility;

. rename ks06B xpersonal;

. rename ks06C xhhgood;

. rename ks06C1 xdomest;

. rename ks06D xrecreat;

. rename ks06E xtransp;

. rename ks06F1 xlottery;

. rename ks06F2 xarisan;

. rename ks06G xtransf2;

. lab var xutility "Monthly expend. on utility ks06A";

. lab var xpersonal "Monthly expend. on personal goods ks06B";

. lab var xhhgood "Monthly expend. on hh goods ks06C";

. lab var xdomest "Monthly expend. on domestic goods ks06C1";

. lab var xrecreat "Monthly expend. on recreation ks06D";

. lab var xtransp "Monthly expend. on transport. ks06E";

. lab var xlottery "Monthly expend. on lottery ks06F1";

. lab var xarisan "Monthly expend. on arisan ks06F2";

. lab var xtransf2 "Monthly expend. on transfer ks06G";

. rename ks07a inonfood;

. lab var inonfood "Monthly non-food own-produce (ks07a)";

. *xnonfood2 IS ALL KS06 EXCLUDING TRANSFER AND ARISAN ;
. gen xnonfood2=xutility+xpersonal+xhhgood+xdomest+xrecreat+xtransp+xlottery ;
(43 missing values generated)

. *totks06 IS ALL KS06 ;
. gen totks06=xnonfood2+xtransf2+xarisan;
(43 missing values generated)

. lab var xnonfood2 "Monthly non-food expend. ks2type, transfer & arisan excl.";

. lab var totks06 "Monthly non-food expend. ks2type, transfer & arisan incl.";

. sort hhid ;

. *NON-FOOD FROM KS3TYPE (KS08, KS09A), CONVERTED TO MONTHLY FIGURES;
. gen mcloth=ks08A/12;
(41 missing values generated)

. gen mfurn=ks08B/12;
(41 missing values generated)

. gen mmedical=ks08C/12;
(41 missing values generated)

. gen mcerem=ks08D/12;
(42 missing values generated)

. gen mtax=ks08E/12;
(41 missing values generated)

. gen mother=ks08F/12;
(41 missing values generated)

. gen mtransf3=ks08G/12;
(41 missing values generated)

. gen icloth=ks09aA/12;
(40 missing values generated)

. gen ifurn=ks09aB/12;
(40 missing values generated)

. gen imedical=ks09aC/12;
(40 missing values generated)

. gen icerem=ks09aD/12;
(40 missing values generated)

. gen iother=ks09aF/12;
(40 missing values generated)

. gen xcloth=mcloth+icloth;
(41 missing values generated)

. gen xfurn=mfurn+ifurn;
(41 missing values generated)

. gen xmedical=mmedical+imedical;
(41 missing values generated)

. gen xcerem=mcerem+icerem;
(42 missing values generated)

. gen xtax=mtax;
(41 missing values generated)

. gen xother=mother+iother;
(41 missing values generated)

. gen xtransf3=mtransf3;
(41 missing values generated)

.         *xnonfood3 IS ALL KS08 and KS09a EXCLUDING TRANSFER ;
. gen xnonfood3=xcloth+xfurn+xmedical+xcerem+xtax+xother;
(42 missing values generated)

.  lab var mcloth "Monthly non-food expend: clothing,ks08A";

. lab var mfurn "Monthly non-food expend: furniture,ks08B";

. lab var mmedical "Monthly non-food expend: medical,ks08C";

. lab var mcerem "Monthly non-food expend: ceremony,ks08D";

. lab var mtax "Monthly non-food expend: tax,ks08E";

. lab var mother "Monthly non-food expend: other,ks08F";

. lab var mtransf3 "Monthly non-food expend: transfer,ks08G";

. lab var icloth "Monthly non-food expend: clothing,ks09aA";

. lab var ifurn "Monthly non-food expend: furniture,ks09aB";

. lab var imedical "Monthly non-food expend: medical,ks09aC";

. lab var icerem "Monthly non-food expend: ceremony,ks09aD";

. lab var iother "Monthly non-food expend: other,ks09aF";

. lab var xcloth "Monthly non-food expend: clothing,ks08A+ks09aA";

. lab var xfurn "Monthly non-food expend: furniture,ks08B+ks09aB";

. lab var xmedical "Monthly non-food expend: medical,ks08C+ks09aC";

. lab var xcerem "Monthly non-food expend: ceremony,ks08D+ks09aD";

. lab var xtax "Monthly non-food expend: tax,ks08E";

. lab var xother "Monthly non-food expend: other,ks08F+ks09aF";

. lab var xtransf3 "Monthly non-food expend: transfer,ks08G";

. lab var xnonfood3 "Monthly non-food expend. ks3type(all ks08,ks09a excl. ks08G)";

. **HOUSING;
. gen xhrent=kr04 if kr04x~=.;
(7063 missing values generated)

. gen xhown=kr05 if kr05x~=.;
(558 missing values generated)

. gen xhouse=kr04 if kr04x~=.;
(7063 missing values generated)

. replace xhouse=kr05 if kr05x~=.;
(7047 real changes made)

. lab var xhrent "Monthly expend. on housing:rent (kr04)";

. lab var xhown "Monthly expend. on housing:own  (kr05)";

. lab var xhouse "Monthly expend. on housing (kr04/kr05)";

.  ********;
. *EDUCATIOn;
. gen xedutuit=ks10aa/12;
(44 missing values generated)

. gen xeduunif=ks11aa/12;
(44 missing values generated)

. gen xedutran=ks12aa/12;
(44 missing values generated)

. gen xeduc=xedutuit+xeduunif+xedutran;
(44 missing values generated)

. gen xedutuitout=ks10ab/12;
(44 missing values generated)

. gen xeduunifout=ks11ab/12;
(44 missing values generated)

. gen xedutranout=ks12ab/12;
(44 missing values generated)

. gen xedubordout=ks12bb/12;
(44 missing values generated)

. gen xeducout=xedutuitout+xeduunifout+xedutranout+xedubordout;
(44 missing values generated)

. gen xeducall=xeduc+xeducout;
(44 missing values generated)

. lab var xedutuit "Monthly expend. on educ.:tuition, ks10aa";

. lab var xeduunif "Monthly expend. on educ.:uniform, ks11aa";

. lab var xedutran "Monthly expend. on educ.:transport, ks12aa";

. lab var xedutuitout "Monthly expend. on educ. out of home:tuition, ks10ab";

. lab var xeduunifout "Monthly expend. on educ. out of home:uniform, ks11ab";

. lab var xedutranout "Monthly expend. on educ. out of home:transport, ks12ab";

. lab var xedubordout "Monthly expend. on educ. out of home:boarding, ks12bb";

. lab var xeduc "Monthly expend. on educ ks10aa-ks12aa";

. lab var xeducout "Monthly expend. on educ, out of home ks10ab-ks12bb";

. lab var xeducall "Monthly expend. on educ, all (ks10aa-ks12bb)";

. *NOTE: FOR CALCULATING HH EXPENDITURE, USE XEDUC (EXPEND. ON KIDS INSIDE THE HOME) ;
. *********************************;
. *MONTHLY EXPENDITURE CATEGORIES;
. ******************************;
. drop ks02* ks03*;

. ***************************************;
. * HOUSEHOLD EXPENDITURE: XFOOD + XNONFOOD;
. ***************************************;
. **FOOD : xfood: total of KS02 and KS03, already generated;
.  **NONFOOD:xnonfood=xnonfood2+xnonfood3+xhousing+xeduc+inonfood, 
> SO IT IS THE TOTAL OF KS06 WITHOUT ARISAN + TOTAL KS08,KS09 + HOUSING + EDUCATION FOR CHILDREN IN THE HOME ONLY + OWN-PRODUCED NON0-FOOD. 
> ks06 w/o arisan, ks08, ks09a, ks10aa-ks12aa, ks07a). Generated below:;
. gen xnonfood=xnonfood2+xnonfood3+xhouse+xeduc+inonfood;
(64 missing values generated)

. lab var xnonfood "Monthly non-food expenditure";

.  ** HHEXP: MONTHLY HOUSEHOLD EXPENDITURE;
.  gen hhexp=xfood+xnonfood;
(69 missing values generated)

. lab var hhexp "Monthly expenditure";

. inspect hhexp;

hhexp:  Monthly expenditure                     Number of Observations
---------------------------                 ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #                         Positive        7536      2340       5196
|  #                                        -----     -----      -----
|  #                         Total           7536      2340       5196
|  #   .   .   .   .         Missing           69
+----------------------                     -----
9958.333       1.00e+08                      7605
(More than 99 unique values)

.  **********************************;
. *OTHER CATEGORIES;
. **************************************;
. *MONTHLY FOOD CONSUMPTION: FROM KS02,KS03 AND TRANSFER OF FOOD OUT;
. gen hhfood=xfood+xfdtout;
(47 missing values generated)

. lab var hhfood "Monthly consumption on food (ks02,ks03 AND ks04b)";

. *MONTHLY TRANSFER: FROM KS04B, KS06G, KS8G, AND EDUC FOR KID OUTSIDE THE HOME monthly;
. gen xtransfer=xfdtout+xtransf2+xtransf3+xeducout;
(48 missing values generated)

. lab var xtransfer "Monthly transfer (from ks04b,ks6G,ks08G,ks10ab-ks12bb)";

. *MONTHLY EXPENDITURES ON HOUSEHOLD EXPENSES ;
. gen xhhx=xutility+xhhgood+xdomest+xfurn;
(44 missing values generated)

. lab var xhhx "Monthly expend. on household expenses";

. *MONTHLY EXPENDITURES ON TRANSPORTATION: xtransp (already generated);
. *MONTHLY EXPENDITURES ON MEDICAL: xmedical (already generated);
. *MONTHLY EXPENDITURES ON ENTERTAINMENT;
. gen xentn=xrecreat+xlottery+xcerem;
(45 missing values generated)

. lab var xentn "Monthly expend. on entertainment";

. *MONTHLY EXPENDITURES ON DURABLES;
. gen xdura=xfurn+xother+xtransf3 ;
(41 missing values generated)

. lab var xdura "Monthly expend. on durables";

. *MONTHLY EXPENDITURES ON CEREMONIES AND TAX;
. gen xritax=xcerem+xtax;
(42 missing values generated)

. lab var xritax "Monthly expend. on ritual and tax";

. sort hhid;

. drop ks0* ;

. compress;
missing was float now byte

. save $dir0\pce_wo_hhsize.dta, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\pce_wo_hhsize.dta saved

. ****************************************************************************************************;
. * IX. MERGE WITH HHSIZE.DTA,  DATA FROM AR WITH INFO ON HHSIZE (AR01==1 OR 5);
. *************************************************************************************************;
. #delimit ;
delimiter now ;
. use hhid97 member97 if member97==1 using $dir2\ptrack, clear;
(Person-level tracking across waves )

. bys hhid97: gen hhsize=_N;

. bys hhid97: keep if _n==_N;
(26315 observations deleted)

. lab var hhsize "HH size";

. sort hhid97;

. save $dir0\hhsize, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\hhsize.dta saved

. merge hhid97  using $dir0\pce_wo_hhsize.dta;

. lab var _merge "1=KS/KRmonthly 2=peg_hh97.dta 3=both";

. tab _merge ;

1=KS/KRmont |
        hly |
2=peg_hh97. |
 dta 3=both |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         14        0.18        0.18
          3 |      7,605       99.82      100.00
------------+-----------------------------------
      Total |      7,619      100.00

. keep if _merge==3;
(14 observations deleted)

. tab missing _merge, m;

 Household | 1=KS/KRmon
   with at |    thly
   least 1 | 2=peg_hh97
   part of |    .dta
expenditur |   3=both
 e missing |         3 |     Total
-----------+-----------+----------
         0 |     7,536 |     7,536 
         1 |        23 |        23 
         . |        46 |        46 
-----------+-----------+----------
     Total |     7,605 |     7,605 


. tab _mkr _merge, m;

           | 1=KS/KRmon
           |    thly
           | 2=peg_hh97
           |    .dta
           |   3=both
      _mkr |         3 |     Total
-----------+-----------+----------
         1 |         6 |         6 
         2 |        40 |        40 
         3 |     7,559 |     7,559 
-----------+-----------+----------
     Total |     7,605 |     7,605 


. inspect hhexp ;

hhexp:  Monthly expenditure                     Number of Observations
---------------------------                 ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #                         Positive        7536      2340       5196
|  #                                        -----     -----      -----
|  #                         Total           7536      2340       5196
|  #   .   .   .   .         Missing           69
+----------------------                     -----
9958.333       1.00e+08                      7605
(More than 99 unique values)

. inspect hhsize;

hhsize:  HH size                                Number of Observations
----------------                            ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #   #                     Positive        7605      7605          -
|  #   #                                    -----     -----      -----
|  #   #                     Total           7605      7605          -
|  #   #   .   .   .         Missing            -
+----------------------                     -----
1                    18                      7605
  (18 unique values)

. *PER CAPITA EXPENDITURES: HHEXP/HHSIZE;
. gen pce=hhexp/hhsize;
(69 missing values generated)

. lab var pce "Per capita expenditure";

. inspect pce;

pce:  Per capita expenditure                    Number of Observations
----------------------------                ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #                         Positive        7536      1166       6370
|  #                                        -----     -----      -----
|  #                         Total           7536      1166       6370
|  #   .   .   .   .         Missing           69
+----------------------                     -----
6614.583       1.71e+07                      7605
(More than 99 unique values)

. sum pce, detail;

                   Per capita expenditure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     16807.58       6614.583
 5%     27673.33        7226.19
10%     35551.04       7333.333       Obs                7536
25%     52567.41       7405.555       Sum of Wgt.        7536

50%     84704.16                      Mean           151073.7
                        Largest       Std. Dev.      446155.1
75%       145266       1.04e+07
90%       267450       1.25e+07       Variance       1.99e+11
95%     396156.3       1.51e+07       Skewness       21.80586
99%     932016.7       1.71e+07       Kurtosis       636.8175

. sum pce if missing==0 , detail;

                   Per capita expenditure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     16807.58       6614.583
 5%     27673.33        7226.19
10%     35551.04       7333.333       Obs                7536
25%     52567.41       7405.555       Sum of Wgt.        7536

50%     84704.16                      Mean           151073.7
                        Largest       Std. Dev.      446155.1
75%       145266       1.04e+07
90%       267450       1.25e+07       Variance       1.99e+11
95%     396156.3       1.51e+07       Skewness       21.80586
99%     932016.7       1.71e+07       Kurtosis       636.8175

. gen lnpce=log(pce);
(69 missing values generated)

. lab var lnpce "Log of per capita expenditure";

. **EXPENDITURE SHARES:  EXPEND. x 100 / HHEXP;
. gen wrice=xrice*100/hhexp;
(69 missing values generated)

. gen wstaple=xstaple*100/hhexp;
(69 missing values generated)

. gen wvege=xvege*100/hhexp;
(69 missing values generated)

. gen wfood=xfood*100/hhexp;
(69 missing values generated)

. gen woil=xoil*100/hhexp ;
(69 missing values generated)

. gen wmedical=xmedical*100/hhexp;
(69 missing values generated)

. gen wcloth=xcloth*100/hhexp;
(69 missing values generated)

. gen wdairy=xdairy*100/hhexp;
(69 missing values generated)

. gen weducall=xeducall*100/hhexp;
(69 missing values generated)

. gen whous=xhous*100/hhexp;
(69 missing values generated)

. gen wmtfs=(xmeat+xfish)*100/hhexp;
(69 missing values generated)

. gen wnonfood=xnonfood*100/hhexp;
(69 missing values generated)

. gen waltb=xaltb*100/hhexp;
(69 missing values generated)

. lab var wrice "Expend. share: rice";

. lab var wstaple "Expend. share: staple food";

. lab var wvege "Expend. share: vegetable";

. lab var woil "Expend. share: oil";

. lab var waltb "Expend. share: alcohol+tobacco";

. lab var wfood "Expend. share: food";

. lab var wmedical "Expend. share: medical cost";

. lab var wcloth "Expend. share: clothing";

. lab var wdairy "Expend. share: dairy";

. lab var weducall "Expend. share: education (all)";

. lab var whous "Expend. share: housing";

. lab var wmtfs "Expend. share: meat+fish";

. lab var wnonfood "Expend. share: nonfood excl.arisan";

. compress;
hhsize was float now byte

. tab1 miss*, m;

-> tabulation of miss4b  

  Household |
       with |
    missing |
      ks04b |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,563       99.45       99.45
          1 |          2        0.03       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of miss7a  

  Household |
       with |
    missing |
      ks07a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.42       99.42
          1 |          4        0.05       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of miss10aa  

  Household |
       with |
    missing |
     ks10aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.42       99.42
          1 |          4        0.05       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of miss10ab  

  Household |
       with |
    missing |
     ks10ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.42       99.42
          1 |          4        0.05       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of miss11aa  

  Household |
       with |
    missing |
     ks11ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.42       99.42
          1 |          4        0.05       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of miss11ab  

   miss11ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.42       99.42
          1 |          4        0.05       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of miss12aa  

  Household |
       with |
    missing |
     ks12aa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.42       99.42
          1 |          4        0.05       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of miss12ab  

  Household |
       with |
    missing |
     ks12ab |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.42       99.42
          1 |          4        0.05       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of miss12bb  

  Household |
       with |
    missing |
     ks12bb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,561       99.42       99.42
          1 |          4        0.05       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of missks02  

  Household |
w/ at least |
     1 KS02 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,564       99.46       99.46
          1 |          1        0.01       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of missks03  

  Household |
w/ at least |
     1 KS03 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,560       99.41       99.41
          1 |          5        0.07       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of missks06  

  Household |
w/ at least |
     1 KS06 |
    missing |
 -excluding |
         F2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,562       99.43       99.43
          1 |          3        0.04       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of missks08  

  Household |
w/ at least |
     1 KS08 |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,563       99.45       99.45
          1 |          2        0.03       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of missks09  

  Household |
w/ at least |
    1 KS09a |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,565       99.47       99.47
          . |         40        0.53      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of misskr  

  Household |
 w/ missing |
  kr04/kr05 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,589       99.79       99.79
          1 |         10        0.13       99.92
          . |          6        0.08      100.00
------------+-----------------------------------
      Total |      7,605      100.00

-> tabulation of missing  

  Household |
    with at |
    least 1 |
    part of |
expenditure |
    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,536       99.09       99.09
          1 |         23        0.30       99.40
          . |         46        0.60      100.00
------------+-----------------------------------
      Total |      7,605      100.00

. keep hhid97* commid97 prov kabid kecid orige x* m* i* w* _out* hh* *pce hhsize owners;

.  drop miss* member mover;

. des;

Contains data from C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\temp\\hhsize.dta
  obs:         7,605                          Person-level tracking across
                                                waves 
 vars:           131                          25 Jul 2007 16:28
 size:     3,703,635 (92.6% of memory free)
-------------------------------------------------------------------------------
              storage  display     value
variable name   type   format      label      variable label
-------------------------------------------------------------------------------
hhid97          str7   %9s                    97: HH identifier
hhsize          byte   %9.0g                  HH size
inonfood        long   %10.0g                 Monthly non-food own-produce
                                                (ks07a)
commid97        str4   %4s                    Community ID (1997 wave)
provid          byte   %20.0g      prov       97: Province of residence (98 B
kecid           float  %9.0g                  Kecamatan ID
kabid           int    %9.0g                  Kabupaten ID
origea          byte   %8.0g                  Original IFLS EA
_outlierks0     byte   %9.0g                  Any outlier in ks0.dta
_outlierks      byte   %9.0g                  Any outlier in ks
_outlierks02    byte   %9.0g                  Any outlier in ks02
_outlierks03    byte   %9.0g                  Any outlier in ks03
xutility        long   %10.0g                 Monthly expend. on utility ks06A
xpersonal       long   %10.0g                 Monthly expend. on personal
                                                goods ks06B
xhhgood         long   %10.0g                 Monthly expend. on hh goods
                                                ks06C
xdomest         long   %10.0g                 Monthly expend. on domestic
                                                goods ks06C1
xrecreat        long   %10.0g                 Monthly expend. on recreation
                                                ks06D
xtransp         long   %10.0g                 Monthly expend. on transport.
                                                ks06E
xlottery        long   %10.0g                 Monthly expend. on lottery
                                                ks06F1
xarisan         long   %10.0g                 Monthly expend. on arisan ks06F2
xtransf2        long   %10.0g                 Monthly expend. on transfer
                                                ks06G
_outlierks06    byte   %9.0g                  Any outlier in ks06
_outlierks08    byte   %9.0g                  Any outlier in ks08
_outlierks09    byte   %9.0g                  Any outlier in ks09
_outlierkr04    byte   %9.0g                  Any outlier in kr04
_outlierkr05    byte   %9.0g                  Any outlier in kr05
owners          byte   %9.0g       owners     Owner or Renter?
_outlierkr      byte   %9.0g                  Any outlier in kr
mrice           float  %9.0g                  Monthly food consumption ks02:
                                                rice
mstaple         float  %9.0g                  Monthly food consumption ks02:
                                                staple
mvege           float  %9.0g                  Monthly food consumption ks02:
                                                vegetable, fruit
mdried          float  %9.0g                  Monthly food consumption ks02:
                                                dried food
mmeat           float  %9.0g                  Monthly food consumption ks02:
                                                meat
mfish           float  %9.0g                  Monthly food consumption ks02:
                                                fish
mdairy          float  %9.0g                  Monthly food consumption ks02:
                                                dairy
mspices         float  %9.0g                  Monthly food consumption ks02:
                                                spices
msugar          float  %9.0g                  Monthly food consumption ks02:
                                                sugar
moil            float  %9.0g                  Monthly food consumption ks02:
                                                oil
mbeve           float  %9.0g                  Monthly food consumption ks02:
                                                beverages
maltb           float  %9.0g                  Monthly food consumption ks02:
                                                alcohol/tobacco
msnack          float  %9.0g                  Monthly food consumption ks02:
                                                snacks
mfdout          float  %9.0g                  Monthly food consumption ks02:
                                                food out of home
irice           float  %9.0g                  Monthly food consumption ks03:
                                                rice
istaple         float  %9.0g                  Monthly food consumption ks03:
                                                staple
ivege           float  %9.0g                  Monthly food consumption ks03:
                                                vegetable, fruit
idried          float  %9.0g                  Monthly food consumption ks03:
                                                dried food
imeat           float  %9.0g                  Monthly food consumption ks03:
                                                meat
ifish           float  %9.0g                  Monthly food consumption ks03:
                                                fish
idairy          float  %9.0g                  Monthly food consumption ks03:
                                                dairy
ispices         float  %9.0g                  Monthly food consumption ks03:
                                                spices
isugar          float  %9.0g                  Monthly food consumption ks03:
                                                sugar
ioil            float  %9.0g                  Monthly food consumption ks03:
                                                oil
ibeve           float  %9.0g                  Monthly food consumption ks03:
                                                beverages
ialtb           float  %9.0g                  Monthly food consumption ks03:
                                                alcohol/tobacco
isnack          float  %9.0g                  Monthly food consumption ks03:
                                                snacks
ifdout          float  %9.0g                  Monthly food consumption ks03:
                                                food out of home
xrice           float  %9.0g                  Monthly food consumption
                                                ks02+ks03: rice
xstaple         float  %9.0g                  Monthly food consumption
                                                ks02+ks03: staple
xvege           float  %9.0g                  Monthly food consumption
                                                ks02+ks03: vegetable, fruit
xdried          float  %9.0g                  Monthly food consumption
                                                ks02+ks03: dried food
xmeat           float  %9.0g                  Monthly food consumption
                                                ks02+ks03: meat
xfish           float  %9.0g                  Monthly food consumption
                                                ks02+ks03: fish
xdairy          float  %9.0g                  Monthly food consumption
                                                ks02+ks03: dairy
xspices         float  %9.0g                  Monthly food consumption
                                                ks02+ks03: spices
xsugar          float  %9.0g                  Monthly food consumption
                                                ks02+ks03: sugar
xoil            float  %9.0g                  Monthly food consumption
                                                ks02+ks03: oil
xbeve           float  %9.0g                  Monthly food consumption
                                                ks02+ks03: beverages
xaltb           float  %9.0g                  Monthly food consumption
                                                ks02+ks03: alcohol/tobacco
xsnack          float  %9.0g                  Monthly food consumption
                                                ks02+ks03: snacks
xfdout          float  %9.0g                  Monthly food consumption
                                                ks02+ks03: food out of home
mfood           float  %9.0g                  Monthly food cons.,market
                                                purch. all ks02
ifood           float  %9.0g                  Monthly food cons.,own-prod.
                                                all ks03
xfdtout         float  %9.0g                  Monthly food transfer, ks04b
xfood           float  %9.0g                  Monthly food consumption, ks02
                                                and ks03
xnonfood2       float  %9.0g                  Monthly non-food expend.
                                                ks2type, transfer & arisan
                                                excl.
mcloth          float  %9.0g                  Monthly non-food expend:
                                                clothing,ks08A
mfurn           float  %9.0g                  Monthly non-food expend:
                                                furniture,ks08B
mmedical        float  %9.0g                  Monthly non-food expend:
                                                medical,ks08C
mcerem          float  %9.0g                  Monthly non-food expend:
                                                ceremony,ks08D
mtax            float  %9.0g                  Monthly non-food expend:
                                                tax,ks08E
mother          float  %9.0g                  Monthly non-food expend:
                                                other,ks08F
mtransf3        float  %9.0g                  Monthly non-food expend:
                                                transfer,ks08G
icloth          float  %9.0g                  Monthly non-food expend:
                                                clothing,ks09aA
ifurn           float  %9.0g                  Monthly non-food expend:
                                                furniture,ks09aB
imedical        float  %9.0g                  Monthly non-food expend:
                                                medical,ks09aC
icerem          float  %9.0g                  Monthly non-food expend:
                                                ceremony,ks09aD
iother          float  %9.0g                  Monthly non-food expend:
                                                other,ks09aF
xcloth          float  %9.0g                  Monthly non-food expend:
                                                clothing,ks08A+ks09aA
xfurn           float  %9.0g                  Monthly non-food expend:
                                                furniture,ks08B+ks09aB
xmedical        float  %9.0g                  Monthly non-food expend:
                                                medical,ks08C+ks09aC
xcerem          float  %9.0g                  Monthly non-food expend:
                                                ceremony,ks08D+ks09aD
xtax            float  %9.0g                  Monthly non-food expend:
                                                tax,ks08E
xother          float  %9.0g                  Monthly non-food expend:
                                                other,ks08F+ks09aF
xtransf3        float  %9.0g                  Monthly non-food expend:
                                                transfer,ks08G
xnonfood3       float  %9.0g                  Monthly non-food expend.
                                                ks3type(all ks08,ks09a excl.
                                                ks08G)
xhrent          float  %9.0g                  Monthly expend. on housing:rent
                                                (kr04)
xhown           float  %9.0g                  Monthly expend. on housing:own
                                                (kr05)
xhouse          float  %9.0g                  Monthly expend. on housing
                                                (kr04/kr05)
xedutuit        float  %9.0g                  Monthly expend. on
                                                educ.:tuition, ks10aa
xeduunif        float  %9.0g                  Monthly expend. on
                                                educ.:uniform, ks11aa
xedutran        float  %9.0g                  Monthly expend. on
                                                educ.:transport, ks12aa
xeduc           float  %9.0g                  Monthly expend. on educ
                                                ks10aa-ks12aa
xedutuitout     float  %9.0g                  Monthly expend. on educ. out of
                                                home:tuition, ks10ab
xeduunifout     float  %9.0g                  Monthly expend. on educ. out of
                                                home:uniform, ks11ab
xedutranout     float  %9.0g                  Monthly expend. on educ. out of
                                                home:transport, ks12ab
xedubordout     float  %9.0g                  Monthly expend. on educ. out of
                                                home:boarding, ks12bb
xeducout        float  %9.0g                  Monthly expend. on educ, out of
                                                home ks10ab-ks12bb
xeducall        float  %9.0g                  Monthly expend. on educ, all
                                                (ks10aa-ks12bb)
xnonfood        float  %9.0g                  Monthly non-food expenditure
hhexp           float  %9.0g                  Monthly expenditure
hhfood          float  %9.0g                  Monthly consumption on food
                                                (ks02,ks03 AND ks04b)
xtransfer       float  %9.0g                  Monthly transfer (from
                                                ks04b,ks6G,ks08G,ks10ab-ks12bb)
xhhx            float  %9.0g                  Monthly expend. on household
                                                expenses
xentn           float  %9.0g                  Monthly expend. on entertainment
xdura           float  %9.0g                  Monthly expend. on durables
xritax          float  %9.0g                  Monthly expend. on ritual and
                                                tax
pce             float  %9.0g                  Per capita expenditure
lnpce           float  %9.0g                  Log of per capita expenditure
wrice           float  %9.0g                  Expend. share: rice
wstaple         float  %9.0g                  Expend. share: staple food
wvege           float  %9.0g                  Expend. share: vegetable
wfood           float  %9.0g                  Expend. share: food
woil            float  %9.0g                  Expend. share: oil
wmedical        float  %9.0g                  Expend. share: medical cost
wcloth          float  %9.0g                  Expend. share: clothing
wdairy          float  %9.0g                  Expend. share: dairy
weducall        float  %9.0g                  Expend. share: education (all)
whous           float  %9.0g                  Expend. share: housing
wmtfs           float  %9.0g                  Expend. share: meat+fish
wnonfood        float  %9.0g                  Expend. share: nonfood
                                                excl.arisan
waltb           float  %9.0g                  Expend. share: alcohol+tobacco
-------------------------------------------------------------------------------
Sorted by:  
     Note:  dataset has changed since last saved

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      hhid97 |         0
      hhsize |      7605    4.453386    2.085329          1         18
    inonfood |      7561    10785.18    76499.89          0    3000000
    commid97 |         0
      provid |      7605    34.52991    15.20148         12         73
-------------+--------------------------------------------------------
       kecid |      7605     3479905     1515086    1201020    7372030
       kabid |      7605    3479.819    1515.092       1201       7372
      origea |      7605    .8813938    .3233458          0          1
 _outlierks0 |      7565    .0005288      .02299          0          1
  _outlierks |      7565    .0006609    .0257019          0          1
-------------+--------------------------------------------------------
_outlierks02 |      7565    .0001322    .0114973          0          1
_outlierks03 |      7565    .0006609    .0257019          0          1
    xutility |      7562    26210.11    57677.62          0    2034000
   xpersonal |      7562     6545.92    17967.48          0     750000
     xhhgood |      7562    5688.003    9680.785          0     434400
-------------+--------------------------------------------------------
     xdomest |      7562     9321.33     93706.7          0    3180000
    xrecreat |      7562    5538.667    36537.16          0    1621000
     xtransp |      7562    21273.08     68566.5          0    1700000
    xlottery |      7562    249.4777    5535.245          0     273000
     xarisan |      7562    19891.73    172196.4          0   1.35e+07
-------------+--------------------------------------------------------
    xtransf2 |      7562    3132.769    30770.93          0    1600000
_outlierks06 |      7565    .0003966    .0199113          0          1
_outlierks08 |      7565    .0001322    .0114973          0          1
_outlierks09 |      7565           0           0          0          0
_outlierkr04 |      7599    .0001316    .0114715          0          1
-------------+--------------------------------------------------------
_outlierkr05 |      7599    .0001316    .0114715          0          1
      owners |      7599    .9284116    .2578221          0          1
  _outlierkr |      7599    .0002632    .0162221          0          1
       mrice |      7564    37192.45    57385.39          0    1733333
     mstaple |      7564    43176.96    74843.69          0    3170267
-------------+--------------------------------------------------------
       mvege |      7564    28581.82    45161.48          0     975000
      mdried |      7564    16042.87    26561.86          0     650000
       mmeat |      7564    28649.42    91967.33          0    4940000
       mfish |      7564    15651.24    28272.93          0   866666.7
      mdairy |      7564    15623.87    38213.08          0    1690000
-------------+--------------------------------------------------------
     mspices |      7564    15172.76    24092.49          0   927766.7
      msugar |      7564    11110.08    36986.23          0    2202633
        moil |      7564     10418.3    28050.53          0    1243667
       mbeve |      7564    9238.189    20810.49          0     876200
       maltb |      7564    18168.64    40683.55          0    2166667
-------------+--------------------------------------------------------
      msnack |      7564    12577.82    43717.46          0    2426667
      mfdout |      7564    6846.013    38775.26          0    1733333
       irice |      7560        9190    29364.55          0    1183000
     istaple |      7560     10423.6    30397.24          0    1183000
       ivege |      7560    4184.501    12698.38          0   433333.3
-------------+--------------------------------------------------------
      idried |      7560    1364.169    9879.121          0   433333.3
       imeat |      7560    2718.923    16205.73          0   693333.3
       ifish |      7560    1580.924     8254.41          0   216666.7
      idairy |      7560    1022.157    6174.705          0     260000
     ispices |      7560     735.929    4134.548          0   108333.3
-------------+--------------------------------------------------------
      isugar |      7560    409.6318    3071.585          0     115700
        ioil |      7560    483.9892    3357.561          0     130000
       ibeve |      7560    667.9323    4327.091          0   173333.3
       ialtb |      7560    435.1962    4276.048          0     208000
      isnack |      7560    1539.394    12751.35          0     520000
-------------+--------------------------------------------------------
      ifdout |      7560    493.4612    6766.498          0   303333.3
       xrice |      7560    46172.85    57748.51          0    1625000
     xstaple |      7560    53347.41    74938.72          0    3170267
       xvege |      7560    32680.27    46283.15          0     975000
      xdried |      7560    17350.47     28277.4          0     650000
-------------+--------------------------------------------------------
       xmeat |      7560    30716.88     76205.8          0    2600000
       xfish |      7560    17216.94    29115.75          0   866666.7
      xdairy |      7560    16611.65    38621.34          0    1690000
     xspices |      7560    15868.17    24379.49          0   927766.7
      xsugar |      7560    11389.11    35617.74          0    2202633
-------------+--------------------------------------------------------
        xoil |      7560    10826.18    27437.85          0    1243667
       xbeve |      7560    9887.681    21452.46          0     876200
       xaltb |      7560    18587.66    41071.48          0    2166667
      xsnack |      7560    14123.01     45855.3          0    2426667
      xfdout |      7560    7343.096    39560.18          0    1733333
-------------+--------------------------------------------------------
       mfood |      7564      231258    302333.7          0   1.08e+07
       ifood |      7560    26059.81    51904.07          0    1200117
     xfdtout |      7563    7967.518    54319.38          0    2166667
       xfood |      7560    255948.5    288469.1          0    8429634
   xnonfood2 |      7562    74826.59    175891.5          0    3616500
-------------+--------------------------------------------------------
      mcloth |      7564    14868.91    23751.39          0   833333.3
       mfurn |      7564    4233.296    18769.92          0     675000
    mmedical |      7564    10279.67    40586.66          0    1083333
      mcerem |      7563    11103.65    41078.56          0    2083333
        mtax |      7564    2392.969    9264.017          0     250000
-------------+--------------------------------------------------------
      mother |      7564    22967.05    210342.4          0    9166667
    mtransf3 |      7564    1324.685    12447.09          0     600000
      icloth |      7565    1492.968    7356.859          0     375000
       ifurn |      7565     261.838     3728.32          0     125000
    imedical |      7565    1292.401    19652.43          0   833333.3
-------------+--------------------------------------------------------
      icerem |      7565    2428.985    30281.73          0    1666667
      iother |      7565    412.9401    7667.781          0     300000
      xcloth |      7564    16356.57    25485.31          0   833333.3
       xfurn |      7564    4495.169    19322.13          0     675000
    xmedical |      7564    11572.24    45965.45          0    1158333
-------------+--------------------------------------------------------
      xcerem |      7563    13533.27    62503.22          0    3750000
        xtax |      7564    2392.969    9264.017          0     250000
      xother |      7564    23380.05    210502.2          0    9166667
    xtransf3 |      7564    1324.685    12447.09          0     600000
   xnonfood3 |      7563    71736.99    243063.2          0    9188167
-------------+--------------------------------------------------------
      xhrent |       542       59100    98761.43          0    1666666
       xhown |      7047    181951.8     2113855          0   1.00e+08
      xhouse |      7589    173177.8     2037378          0   1.00e+08
    xedutuit |      7561    12441.34    44141.03          0    2136000
    xeduunif |      7561    4549.323    10078.88          0   233333.3
-------------+--------------------------------------------------------
    xedutran |      7561    12743.98    40867.24          0    1676333
       xeduc |      7561    29734.64    74493.43          0    2275667
 xedutuitout |      7561    3102.467     33433.9          0    1666667
 xeduunifout |      7561    541.2952    8005.596          0   535333.3
 xedutranout |      7561    1941.312    22377.58          0    1000000
-------------+--------------------------------------------------------
 xedubordout |      7561    1755.706    14640.77          0   416666.7
    xeducout |      7561    7340.779    57422.85          0    2083333
    xeducall |      7561    37075.42    99774.45          0    3368000
    xnonfood |      7541    357589.9     2097131   1466.667   1.00e+08
       hhexp |      7536    608601.6     2133906   9958.333   1.00e+08
-------------+--------------------------------------------------------
      hhfood |      7558    261864.3    271685.7          0    7283467
   xtransfer |      7557    19571.91     93636.4          0    3268833
        xhhx |      7561    45640.36    126651.6          0    3290400
       xentn |      7560    19233.13    75291.64          0    3800000
       xdura |      7564     29199.9    214316.4          0    9168750
-------------+--------------------------------------------------------
      xritax |      7563    15926.55    65072.69          0    3816667
         pce |      7536    151073.7    446155.1   6614.583   1.71e+07
       lnpce |      7536    11.42344    .8347382   8.797032   16.65635
       wrice |      7536    13.14665    11.64967          0   91.56004
     wstaple |      7536    14.76316     12.1502          0   91.56004
-------------+--------------------------------------------------------
       wvege |      7536    6.787545    5.388287          0   63.53255
       wfood |      7536    56.81487    18.62993          0   97.54313
        woil |      7536    2.517895    2.526082          0   74.05657
    wmedical |      7536    1.843244    5.132947          0   84.32983
      wcloth |      7536    3.402444    2.978845          0     41.841
-------------+--------------------------------------------------------
      wdairy |      7536    2.893041    3.755049          0    60.2477
    weducall |      7536    5.996425    10.05606          0   159.7972
       whous |      7536    14.62566    14.66233          0   99.67076
       wmtfs |      7536    9.638342    6.962145          0     73.035
    wnonfood |      7536    43.18513    18.62993    2.45687        100
-------------+--------------------------------------------------------
       waltb |      7536    4.325002    5.775957          0   60.91253

. lab data "Per Capita Expenditure 1997";

. sort hhid;

. save $dir09\pce97nom.dta, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\data\\pce97nom.dta saved

. *************************************************************************************************;
. * X. Creating the smaller file containing only the nominal and the real consumption aggregate;
. *************************************************************************************************;
. #delimit ;
delimiter now ;
. use $dir09\pce97nom.dta, clear;
(Per Capita Expenditure 1997)

. merge hhid97 using $dir09\deflate_hh97;
(label prov already defined)

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |         32        0.42        0.42
          3 |      7,605       99.58      100.00
------------+-----------------------------------
      Total |      7,637      100.00

. rename hhexp xtotal;

. * deflate using temporal deflator with December 2000 as the base;
. gen temptotal=xtotal*cpi_tornq;
(101 missing values generated)

. gen tempfood=xfood*cpi_tornq;
(77 missing values generated)

. gen tempnonfood=xnonfood*cpi_tornq;
(96 missing values generated)

. * deflate using spatial deflator with Jakarta as the base;
. gen rtotal=temptotal/cpi_sp00;
(101 missing values generated)

. gen rfood=tempfood/cpi_sp00;
(77 missing values generated)

. gen rnonfood=tempnonfood/cpi_sp00;
(96 missing values generated)

. lab var xtotal "Monthly HH expenditure, nominal";

. lab var xfood "Monthly HH food expenditure, nominal";

. lab var xnonfood "Monthly HH non-food expenditure, nominal";

. lab var rtotal "Monthly HH expenditure, real";

. lab var rfood "Monthly HH food expenditure, real";

. lab var rnonfood "Monthly HH non-food expenditure, real";

. keep hhid97 hhsize xtotal xfood xnonfood rtotal rfood rnonfood;

. sort hhid97 ;

. compress;

. lab data "Real HH Per Capita Expenditure 1997";

. save $dir09\pce97.dta, replace;
file C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\data\\pce97.dta saved

. log close;
       log:  C:\DOCUME~1\FIRMAN~1\MYDOCU~1\pce\logfile\\pce97.log
  log type:  text
 closed on:  25 Jul 2007, 16:29:02
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
